import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const FISHING_COLLECTIBLE_LOCALIZATION_JA = {
	4100: {
		description:
			'地獄が犯罪者を拘束するために使う道具。 その上には人を戦慄させる怨念が残り、ひび割れた切れ目は不穏な兆しを現しているようだった。',
		name: '断ち切られた罪人の鎖',
	},
	4101: {
		description:
			'外界で流行っている奇妙な缶詰、開けなければ無事だが、小さな開口部を持ち上げれば、三途の川が見えそうな気分になる。',
		name: 'ニシンの缶詰',
	},
	4102: {
		description:
			'冬にしか現れない謎の妖怪が残した帽子、春になると彼女はいったいどこに行ってしまうのだろう。',
		name: '忘却の帽子',
	},
	4104: {
		description:
			'誰かがよくつけてたもの、でも一体誰なんだろう…今にでも思い出しそう。',
		name: '山椿の髪飾り',
	},
	4105: {
		description:
			'人間の村の酒場「鯢呑亭」のおかみさんの帽子。 深夜になると妖怪たちの酒場「蚕食鯢呑亭」に変身するという。',
		name: 'クジラの帽子',
	},
	4106: {
		description: '氷に封じられたカエル、ある馬鹿妖精のいたずらに見える。',
		name: '氷カエル',
	},
	4107: {
		description:
			'聞くところによると、それは紅魔館から「白黒泥棒」が盗み忘れた魔導書。その本に込められた重い魔力によって、水の浸食から守られていたのだという。',
		name: '盗み損ねた魔導書',
	},
	4108: {
		description:
			'食事時の子供専用の椅子に見えるが、よく見ると黒い吸血鬼の残滓が感じられる。',
		name: '児童椅子',
	},
	4109: {
		description:
			'永夜異変の際、博麗の巫女が竹林で戦った時に残した道具だと言われている。',
		name: '壊れた陰陽玉',
	},
	4110: {
		description:
			'永夜異変の際、森の巫女が竹林で戦った時に残した道具だと言われている。',
		name: '割れた金平糖の瓶',
	},
	4111: {
		description: 'ウサギの耳に見えるが…って耳って外せるものなの！？',
		name: '外せる耳',
	},
	4112: {
		description: '用途のわからないブランクカード。',
		name: 'ブランクカード',
	},
	4113: {
		description:
			'河童たちが発明した手袋。手ぶらで作業するよりも精度と安定性に優れ、小さな部品も引き寄せてくれる。',
		name: '不思議な手袋',
	},
	4114: {
		description: 'なんだか、河童たちの最終機密に触れた気がする…',
		name: '河童のウィッグ',
	},
	4115: {
		description:
			'不穏な雰囲気が漂う呪われた釣り竿。 え……あれ？ 釣り竿で釣れた？',
		name: '魔法の釣り竿',
	},
	4116: {
		description:
			'上海人形が防御の際に用いる盾で、その形状は、ある次元の一年戦争で恐ろしい悪魔が身に着けていた盾を参考にしていると言われている……。',
		name: '謎の盾のレプリカ',
	},
	4117: {
		description:
			'古代の三大神器のひとつ、魔を破る魔剣！ 遠い昔、この神剣を手にした者は世界を手に入れるという噂もあった。',
		name: '天叢雲剣',
	},
	4118: {
		description:
			'「邪悪な獣が住むと言われる血の池地獄への日帰り旅行！ 依神シスターズまでお問い合わせください」と書いてある！',
		name: '血の池地獄観光チラシ',
	},
	4119: {
		description:
			'旧地獄温泉街で、一定金額を消費すると貰える花魁のサイン入り絵葉書。地下で最も強く美しい人物だけがそこにプリントされる。',
		name: '旧地獄の花魁の葉書',
	},
	4120: {
		description:
			'様々な人間の寿命が書いてある恐ろしい道具……名前を消せば永遠に生きられるってこと？',
		name: '審判帳',
	},
	4121: {
		description:
			'近所の住民によると、この面の持ち主は、少し前までよくこの面で遊んでいたそうだが、その人が誰なのか、本当に誰も覚えていないという。 この面は能楽を得意とする付喪神のようだ。',
		name: '希望の仮面のレプリカ',
	},
	4122: {
		description:
			'怖い都市伝説のある道具。突然鳴り出したとしても絶対出てはいけない。',
		name: '紫色の電話',
	},
	4123: {
		description:
			'お燐をモチーフにして作られた地獄の記念品。とてもキュートで人気がある！',
		name: '猫のブローチ',
	},
	4124: {
		description:
			'噂によると、航海中に船幽霊に襲われたときは、底のない柄杓を与えれば逃げられるという。',
		name: '底なし柄杓',
	},
	4125: {
		description:
			'星さんがよく手に持っている宝塔。響子いわく、星さんはこの宝塔をよく失くしてしまい、拾ってくれた人にはナズーリンに言わないように頼むらしい。',
		name: '宝塔',
	},
	4126: {
		description:
			'その鍵には経典が刻まれており、響子によれば、神殿に潜む巨大な黒い怪物を動かすことができるという。',
		name: 'バイクのカギ',
	},
	4127: {
		description:
			'青娥さんがキョンシーに書いた呪文。これは途中で破棄されたもので、「変われ！」などと書かれているようだ。',
		name: '未完の呪文',
	},
	4128: {
		description:
			'キョンシーが水に弱いという弱点を克服するため、青娥さんが特別に開発した水に浮かぶための道具。',
		name: 'アヒルのライフブイ',
	},
	4129: {
		description:
			'神子の時代の札束。聖人の加護によって朽ちていない。 金額は大きくても、現代では何の価値もない。',
		name: '古い時代の貨幣',
	},
	4130: {
		description:
			'魔法の帽子なのかナイトキャップなのかわからない。かなりぼろぼろで、センスも奇妙だ。',
		name: '古い帽子',
	},
	4131: {
		description:
			'少し光っている素敵な装飾。強い人間的オーラと霊力が感じられる。',
		name: '十字架',
	},
	4132: {
		description:
			'星と月の模様のスリーピングハット。妖怪でさえ怯える悪魔的なパワーを放っている.....眠っている恐怖そのもの。',
		name: '星と月のスリーピングハット',
	},
	4133: {
		description:
			'幻想郷ではめったに目にしない打楽器のドラムスティック。特別な雷の模様があり、元の持ち主の日々練習した跡が見られる。',
		name: 'ドラムスティック',
	},
	4134: {
		description: 'ライブを盛り上げる道具。今は電力がないので光らない。',
		name: 'ペンライト',
	},
	4135: {
		description:
			'文さんの素晴らしい撮影技術で撮った「〇〇」の「〇〇」写真、惜しいことに、華彩乱戦２という世界じゃないと念写できない。',
		name: '秘密の写真ネガ',
	},
	4136: {
		description:
			'正邪の指名手配ポスター、賞金は1000円、少し前では100円だったらしい。',
		name: '逮捕状',
	},
	4137: {
		description:
			'チンピラの中で非常に流行っている帽子。かなり使い古している。けどなぜチンピラはみんなそういうのが好きなの？　不可解だ…',
		name: '航海士の帽子',
	},
	4138: {
		description:
			'正邪が量産した打ち出の小槌。小人族の魔力は秘めていないが、喧嘩の時に相手の頭を狙った一撃は、魔法より効果的だ。',
		name: '打ち出の小槌（偽物）',
	},
	4139: {
		description:
			'見た目がおかしすぎる！料理に使うにはもったいない！飼うことにした。泳いている様子を見るだけで笑っちゃう！面白すぎ！',
		name: '変な魚',
	},
	4140: {
		description: 'この椅子に座ると、来客に背を向けたくなる衝動に駆られる。',
		name: '白いプラスチックの椅子',
	},
	4141: {
		description:
			'「失効した地球破壊用」と書かれている、もう役に立たないようだ。',
		name: '四次元陽電子爆弾',
	},
	4142: {
		description:
			'あるエンジニアが手作りした戦車の模型。もし大きくして量産したら、恐ろしい戦力になるのでは？',
		name: '戦車模型',
	},
	4143: {
		description:
			'サークルの観察記録：ファイル番号No.1209、地球上のある倶楽部が月を観察していることが検出された、脅威は発見されず。保存不要。',
		name: 'サークル観察記録',
	},
	4144: {
		description:
			'静海でも消えないたいまつは、静寂な宇宙に向かって、生命力を狂わせる驚くべき狂気を噴き出している。',
		name: '燃え続けるたいまつ',
	},
	4145: {
		description:
			'「千年の酒」と書かれた空き酒瓶。一滴残らず飲まれているが、地上では珍しいアルコールの香りが漂っている。',
		name: '残された酒瓶',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
