import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const FISHING_COLLECTIBLE_LOCALIZATION_KO = {
	4100: {
		description:
			'지옥의 죄인을 가두어 두기 위해 사용하는 사슬. 앞으로 불쾌한 일이 일어날 것만 같은, 등골이 오싹해지는 원한의 잔재.',
		name: '죄인의 끊어진 사슬',
	},
	4101: {
		description:
			'바깥 세계에서 유행하는 이상한 깡통. 자세히 보지 않으면 전부 무난하지만, 자그마한 뚜껑을 열고 나면 즉시 삼도천이 눈 앞에 아른거려.',
		name: '수르스트뢰밍',
	},
	4102: {
		description:
			'겨울에만 나타나는 신비로운 요괴가 남긴 모자. 그녀는 봄엔 어디로 가는 걸까?',
		name: '잃어버린 모자',
	},
	4104: {
		description:
			'내가 아는 사람이 자주 하던 건데... 누구더라... 생각이 날 것 같기도...',
		name: '동백꽃 머리핀',
	},
	4105: {
		description:
			'인간 마을에 있는 몽환주점 "예탄정"의 점원의 모자. 늦은 밤엔 요괴 전용의 "잠식예탄정"으로 바뀐다고 해.',
		name: '고래 모자',
	},
	4106: {
		description:
			'차가운 얼음 속에 갇혀버린 개구리. 바보 요정의 장난이 분명해.',
		name: '냉동 개구리',
	},
	4107: {
		description:
			'목격자들의 증언에 따르면, 이 책은 홍마관의 도서관에서 많은 책을 훔친 "흑백의 강도"가 떨어뜨렸다고 해. 물에 젖지 않도록 강력한 마법으로 보호되고 있어.',
		name: '도둑이 떨어뜨린 마도서',
	},
	4108: {
		description:
			'인간 아이들이 밥을 먹을 때 넘어지지 않게 하기 위해 사용하는 의자... 인데, 흡혈귀의 마력이 느껴지는 것 같아.',
		name: '하이체어',
	},
	4109: {
		description:
			'영야이변 때, 하쿠레이의 무녀가 죽림에서 싸울 때 사용한 도구라 알려져 있어.',
		name: '부서진 음양옥',
	},
	4110: {
		description:
			'영야이변 때, 숲의 마녀가 죽림에서 싸울 때 사용한 도구라 알려져 있어.',
		name: '깨진 별사탕 병',
	},
	4111: {
		description: '토끼 귀처럼 생겼는데... 뗄 수 있었던 거였어!?',
		name: '탈부착 귀',
	},
	4112: {
		description: '비어있는 카드. 어디에 사용되는 지는 아무도 몰라.',
		name: '공백의 카드',
	},
	4113: {
		description:
			'캇파가 발명한 장갑. 맨손보다 더 정확하고 안정적임을 보증해. 그리고 흡착 패드가 있어 작은 부품을 붙이는데도 유용해.',
		name: '마법 장갑',
	},
	4114: {
		description: '캇파들의 중요한 비밀을 하나 알아버린 것 같아…',
		name: '캇파 가발',
	},
	4115: {
		description:
			'저주받은 느낌의 낚싯대. 잠깐... 낚싯대로 낚싯대를 낚은 거야?',
		name: '마법이 부여된 낚싯대',
	},
	4116: {
		description:
			'상하이 인형이 들고 있던 방패야. 어딘가의 일년전쟁 때 모두에게 공포를 준 악마가 사용한 디자인을 차용해 만들어졌어.',
		name: '작은 방패 모형',
	},
	4117: {
		description:
			'악마를 토벌할 수 있는 고대의 삼종신기중 하나. 이 검을 손에 넣은 자는 천하를 지배할 수 있다는 옛 전설도 있지!',
		name: '쿠사나기의 검',
	},
	4118: {
		description:
			'일일 여행으로 피연못지옥의 모든 짐승들을 만나보세요! (자세한 사항은 요리가미 여행사에 문의 바랍니다) 라고 적혀 있어.',
		name: '피연못지옥 관광 전단지',
	},
	4119: {
		description:
			'옛 지옥의 온천에서 어느정도 돈을 쓰면 받을 수 있는 엽서. 지저에서 가장 강하고 아름다운 자만이 여기에 자신의 얼굴을 박아넣을 수 있어.',
		name: '옛 지옥 오이란의 엽서',
	},
	4120: {
		description:
			'인간의 수명이 빼곡히 적힌 섬뜩한 책... 그럼 여기서 이름을 지우면 영원히 살 수 있는 거 아닌가?',
		name: '생사부',
	},
	4121: {
		description:
			'인근의 주민들은 최근 이 가면을 만지작거리던 이를 봤지만, 그게 누구였는지 아무도 기억할 수 없었다고 해. 이 가면의 원형은 춤을 잘 추는 츠쿠모가미인듯 해.',
		name: '가짜 희망의 가면',
	},
	4122: {
		description:
			'무서운 도시전설이 깃든 전화기. 전화벨이 울린다면 절대 받아선 안 돼.',
		name: '보라색 전화기',
	},
	4123: {
		description:
			'오린을 모델로 한 옛 지옥의 기념품. 매우 귀엽고 인기가 많죠!',
		name: '냥냥 브로치',
	},
	4124: {
		description:
			'뱃유령과 맞닥뜨렸다면, 바닥이 없는 국자를 주면 무사히 탈출할 수 있다는 전설이 있어.',
		name: '밑바닥이 빠진 국자',
	},
	4125: {
		description:
			'쇼씨가 가지고 다니는 보탑. 쿄코는 보탑을 잃어버리는 시간이 더 긴 것 같대... 그리고 나즈린씨께는 절대 알리지 말라고도 했어.',
		name: '보탑',
	},
	4126: {
		description:
			'경전이 새겨진 열쇠. 쿄코는 이게 거대하고 검은 괴물을 봉인하고 있다고 믿고 있어…',
		name: '오토바이 키',
	},
	4127: {
		description:
			'청아씨가 강시를 위해 쓴 부적. "강시가 되라"라고 써져 있어.',
		name: '미완성된 부적',
	},
	4128: {
		description:
			'강시가 물 위에 뜰 수 있게끔 청아씨가 특별히 제작한 오리 튜브.',
		name: '오리 튜브',
	},
	4129: {
		description:
			'미코씨의 시대 때 사용되던 돈뭉치. 성인의 가호 덕분에 훼손되지 않았어. 양은 많지만, 지금 와서 가치는 없지.',
		name: '옛 적의 화폐',
	},
	4130: {
		description:
			'이게 마술용 모자인지 그냥 잠 잘 때 쓰는 모자인지 전혀 모르겠어. 디자인도 이상하고....',
		name: '낡고 오래된 모자',
	},
	4131: {
		description:
			'약한 빛을 내는 화려한 장식. 하지만 안에서 인간의 영혼과 기운이 느껴지는 것 같은데?',
		name: '육망성 십자가',
	},
	4132: {
		description:
			'달과 별이 새겨진 모자. 요괴도 공포에 떨게 만드는 힘을 내뿜고 있어. 그야마로 잠자는 공포라고 할 수 있지.',
		name: '별 헤는 밤 모자',
	},
	4133: {
		description:
			'환상향에서는 좀처럼 볼 수 없는 타악기 스틱. 특별한 표시가 새겨져 있어. 막대기가 마모된 정도를 보면 주인이 얼마나 많은 연습을 했는지 알 수 있지.',
		name: '드럼 스틱',
	},
	4134: {
		description:
			'라이브 콘서트에서 사용하는 빛을 내는 막대기. 하지만 이미 모든 힘을 소진해버려 더는 빛을 내지 못하게 되버렸어.',
		name: '형광봉',
	},
	4135: {
		description:
			'아야씨가 뛰어난 실력으로 찍은 [검열됨] 의 [검열됨] 사진. 불행하게도 이 사진은 화채난전2라는 다른 평행 세계에서만 볼 수 있다고 해.',
		name: '검열된 사진',
	},
	4136: {
		description:
			'세이자가 그려진 현상수배 포스터. 지금 현상금은 1000엔이야. 얼마 전까지만 해도 100엔이었는데 말야.',
		name: '현상수배 포스터',
	},
	4137: {
		description:
			'불량배들 사이에서 인기 있는 모자야. 많이 낡았는데, 왜 이런 스타일을 좋아하는 거지...?',
		name: '뱃사람 모자',
	},
	4138: {
		description:
			'세이자가 양산한 가짜 요술 망치 중 하나. 소인족의 힘은 담겨있지 않지만, 상대방의 머리를 후려칠수는 있지! 그 편이 마법보다 훨씬 효과적이고 말야!',
		name: '요술 망치(가짜)',
	},
	4139: {
		description:
			'진짜 웃기게 생겼어! 너무 웃겨서 요리엔 절대 못쓴다구! 그냥 키우다가 가끔 보면 정말 재밌을 것 같아!',
		name: '이상한 물고기',
	},
	4140: {
		description:
			'이 의자만 보면 앉아서 손님들을 등지고 싶은 기분이 드는걸.',
		name: '흰색 플라스틱 의자',
	},
	4141: {
		description:
			'지구 파괴용으로 사용 불가라고 적혀 있는데, 지금은 쓸모가 없어진 것 같아.',
		name: '사차원 양전자 폭탄',
	},
	4142: {
		description:
			'어떤 장인이 직접 만든 장난감 탱크. 좀 더 크게 만들어졌다면 무서운 무기가 됐지 않았을까?',
		name: '장난감 탱크',
	},
	4143: {
		description:
			'보고서: 파일 No.1209. 어떤 서클이 지구에서 달을 관찰하는 것을 감지함. 어떠한 위험 요소도 발견되지 않음. 보존 불필요.',
		name: '서클 관찰 기록',
	},
	4144: {
		description:
			'고요의 바다에서도 꺼지지 않는 횃불. 이 조용한 우주 전체를 향해 생명을 미치도록 불태우고 있어.',
		name: '영원히 불타는 횃불',
	},
	4145: {
		description:
			'천년의 술이라고 적혀진 빈 술병. 한 방울도 남아있지 않지만, 지상에선 보기 힘든 술의 향 만큼은 남아있어.',
		name: '남겨진 술병',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
