import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const FISHING_COLLECTIBLE_LOCALIZATION_ZH_TW = {
	4100: {
		description:
			'地獄用來關押罪犯的道具。上面殘留着一股讓人顫慄的怨念，破裂的斷口似乎預示着不詳的信息。',
		name: '斷裂的罪人鎖鏈',
	},
	4101: {
		description:
			'外界流行的奇怪東西，沒打開時天清地朗，一旦掀開一個小口，感覺馬上就要去三途川報道了。',
		name: '鯡魚罐頭',
	},
	4102: {
		description:
			'只有冬天才會出現的神秘妖怪留下的帽子，她在春天時到底去哪裏了呢？',
		name: '遺忘的帽子',
	},
	4104: {
		description:
			'似乎是某個熟人經常佩戴的東西，但到底是誰呢？……感覺馬上就要想起來了。',
		name: '山茶花髮飾',
	},
	4105: {
		description:
			'人類村子的酒館“鯢吞亭”看板娘的帽子。據説深夜時分，那裏會變成妖怪專用酒館“蠶食鯢吞亭”。',
		name: '鯨魚帽子',
	},
	4106: {
		description: '被凍在冰裏的青蛙，想必是某個笨蛋妖精的惡作劇。',
		name: '凍青蛙',
	},
	4107: {
		description:
			'據知情者説，這是某個剛從紅魔館滿載而歸的“黑白大盜”遺落的魔法書，書上厚重的魔力保護了書免遭水的侵蝕。',
		name: '竊賊遺漏的魔法書',
	},
	4108: {
		description:
			'人類小孩吃飯時常用的防摔餐椅，奇怪的是，上面竟然隱約纏繞着一縷吸血鬼的魔力。',
		name: '兒童座椅',
	},
	4109: {
		description: '據説是永夜異變時，博麗的巫女在竹林中戰鬥時留下的道具。',
		name: '破損的陰陽玉',
	},
	4110: {
		description: '據説是永夜異變時，森林的魔法使在竹林中戰鬥時留下的痕跡。',
		name: '破損的金平糖罐',
	},
	4111: {
		description: '看起來像是兔子的耳朵……這種耳朵原來是可拆卸的嗎！？',
		name: '可拆卸耳朵',
	},
	4112: { description: '不知道是做什麼用的空白卡牌。', name: '空白卡牌' },
	4113: {
		description:
			'河童們發明的手套，比空手作業時有更好的精度和穩定性，還能吸附小零件。',
		name: '神奇手套',
	},
	4114: {
		description: '似乎釣上了什麼河童們的終極機密……',
		name: '河童的假髮',
	},
	4115: {
		description: '散發着詛咒氣息的釣竿。咦……？我用釣竿釣上了釣竿？',
		name: '附魔釣魚竿',
	},
	4116: {
		description:
			'上海人形進行防禦行為時手持的盾牌，該盾牌造型據説參考了某個次元裏的一年戰爭期間某令人聞風喪膽的惡魔所裝備的盾牌……',
		name: '謎之盾牌仿製品',
	},
	4117: {
		description:
			'上古三大神器之一、破魔的神劍！在遙遠的過去還流傳着得神劍者得天下的傳聞。',
		name: '天叢雲劍',
	},
	4118: {
		description:
			'上面寫着“傳説寄宿着邪惡猛獸的血池地獄一日遊！詳情請諮詢依神姐妹旅社”的字樣。',
		name: '血池地獄旅遊傳單',
	},
	4119: {
		description:
			'舊地獄温泉街消費一定金額獲贈的花魁的簽名明信片，地底公認最強最美的人才能印在上面。',
		name: '舊地獄花魁的明信片',
	},
	4120: {
		description:
			'寫着許多人類壽命極限的超可怕的道具……劃掉名字的話是不是就可以永生了？',
		name: '審判賬',
	},
	4121: {
		description:
			'附近的住民説前陣子常見到這個面具的製作者在把玩它，但誰也想不起來那個人到底是誰。面具上的模樣似乎是一位擅長能樂的付喪神。',
		name: '仿製的希望之面',
	},
	4122: {
		description: '有着恐怖都市傳説的道具，如果有一天突然響了，也不要去聽。',
		name: '紫色的電話機',
	},
	4123: {
		description: '以阿燐形象製作的地底紀念品，非常可愛，很有人氣！',
		name: '貓貓胸針',
	},
	4124: {
		description:
			'傳聞在航行中遭遇船幽靈攻擊時，只要給她一把沒有底的舀子，就能逃出一劫。',
		name: '沒底的舀子',
	},
	4125: {
		description:
			'星小姐經常拿在手裏的寶塔，據響子説她經常把它弄丟，還囑咐撿到的人千萬不要告訴娜茲玲小姐。',
		name: '寶塔',
	},
	4126: {
		description:
			'鑰匙上篆刻着經文，據響子説它能驅動潛伏在寺院裏的巨大黑色怪獸……',
		name: '摩托車鑰匙',
	},
	4127: {
		description:
			'青娥小姐給殭屍寫的符咒，但這個寫到一半就丟棄了，上面好像寫着“給我變……！”等字樣。',
		name: '沒寫完的符咒',
	},
	4128: {
		description:
			'為了克服殭屍對水的弱點，青娥小姐特意研究了這種可以浮水的道具。',
		name: '鴨子救生圈',
	},
	4129: {
		description:
			'在神子時代的一捆錢，受聖人的護佑沒有受損。雖然數額很大，但在現代一毛不值。',
		name: '舊時的古幣',
	},
	4130: {
		description:
			'分不清是魔法帽還是睡帽，看着很殘破了，品味和造型也很奇怪。',
		name: '陳舊的破帽子',
	},
	4131: {
		description: '微微發着光，很好看的裝飾物，但是有強烈人類的氣息和靈力？',
		name: '六芒星十字架',
	},
	4132: {
		description:
			'有着星星和月亮圖案的帽子，散發着讓妖怪也齒凍膽寒的妖力……可謂沉眠的恐怖。',
		name: '星月睡帽',
	},
	4133: {
		description:
			'在幻想鄉少見的打擊樂器的鼓棒，上面有特殊的雷紋，從上面的痕跡可以看出它原主人夜以繼日的練習量。',
		name: '鼓棒',
	},
	4134: {
		description:
			'Live活動用來提升現場氣氛的道具，目前已經失去了電力，再也無法點亮。',
		name: '熒光棒',
	},
	4135: {
		description:
			'文文小姐用她高超的攝影技術拍下的「〇〇」的「〇〇」照片，可惜只能在另一個叫華彩亂戰2的世界裏才能將其念寫成型。',
		name: '秘密寫真底片',
	},
	4136: {
		description:
			'畫着正邪頭像的通緝令，賞金是¥1000。據説不久之前只有¥100。',
		name: '通緝令',
	},
	4137: {
		description:
			'在混混中非常流行的帽子，已經很破舊了。但為什麼混混都喜歡這種風格呢？不解……',
		name: '航海家帽子',
	},
	4138: {
		description:
			'正邪批量生產的萬寶槌，雖然沒有小人族的魔力，但是打架時對着對方腦袋上來一槌可比魔法好使多了！',
		name: '萬寶槌(贗品)',
	},
	4139: {
		description:
			'長得很好笑！因為太好笑了都捨不得用來做菜！就這樣養在水裏，平時不開心了看看它就會笑出來！真是太好玩了！',
		name: '奇怪的魚',
	},
	4140: {
		description: '看到這把椅子就會有一種坐在上面背對來客的衝動。',
		name: '白色的塑料椅',
	},
	4141: {
		description: '上面標記着“失效的地球破壞用”字樣，看起來已經沒用了。',
		name: '四次元陽電子炸彈',
	},
	4142: {
		description:
			'某個工程師手工製作的戰車模型。如果按比例放大以後批量生產，會是很恐怖的戰鬥力吧？',
		name: '戰車模型',
	},
	4143: {
		description:
			'一份報告：檔案編號No.1209，檢測到地球上某個俱樂部正在觀察月球，未發現其威脅，不予歸檔。',
		name: '社團觀察記錄',
	},
	4144: {
		description:
			'在靜海里也永不熄滅的火炬，火焰向靜寂的宇宙噴薄着驚人的狂氣，彷彿生命力狂放一般。',
		name: '恆常燃燒的火炬',
	},
	4145: {
		description:
			'寫着“千年古酒”字樣的空酒瓶。雖然被喝得一滴不剩，但依然散發着地上罕見的醇香味。',
		name: '遺留的酒瓶',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
