import type { ILocalizedRecordText } from '@/domain/data/localization/types';

export const RECORD_LOCALIZATION_JA = {
	11: {
		description:
			'獣道での営業時の曲が収録されている。全部で三曲あるうちの一曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「妖怪の獣道」〜その１',
		trackName: '妖怪獣道 - 静夜の始まり',
	},
	12: {
		description:
			'人間の里での営業時の曲が収録されている。全部で三曲あるうちの一曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「人間の里」〜その１',
		trackName: '人間の里 - 三々五々',
	},
	13: {
		description:
			'博麗神社での営業時の曲が収録されている。全部で三曲あるうちの一曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「博麗神社」〜その１',
		trackName: '博麗神社 - お客だと？！',
	},
	14: {
		description:
			'紅魔館での営業時の曲が収録されている。全部で三曲あるうちの一曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「紅魔館」〜その１',
		trackName: '紅魔館 - 一献傾ける',
	},
	15: {
		description:
			'迷いの竹林での営業時の曲が収録されている。全部で三曲あるうちの一曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「迷いの竹林」〜その１',
		trackName: '迷いの竹林 - 稀に迷い子',
	},
	16: {
		description:
			'白玉楼・最終決戦の営業時の曲が収録されている。全部で三曲あるうちの一曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「白玉楼」〜その１',
		trackName: '白玉楼 - 四面楚歌',
	},
	36: {
		description:
			'獣道での営業時の曲が収録されている。全部で三曲あるうちの二曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「妖怪の獣道」〜その２',
		trackName: '妖怪獣道 - にぎわい',
	},
	37: {
		description:
			'獣道での営業時の曲が収録されている。全部で三曲あるうちの三曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「妖怪の獣道」〜その３',
		trackName: '妖怪獣道 - 千客万来',
	},
	38: {
		description:
			'人間の里での営業時の曲が収録されている。全部で三曲あるうちの二曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「人間の里」〜その２',
		trackName: '人間の里 - 次から次へと',
	},
	39: {
		description:
			'人間の里での営業時の曲が収録されている。全部で三曲あるうちの三曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「人間の里」〜その３',
		trackName: '人間の里 - 人の波',
	},
	40: {
		description:
			'博麗神社での営業時の曲が収録されている。全部で三曲あるうちの二曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「博麗神社」〜その２',
		trackName: '博麗神社 - 珍客続々',
	},
	41: {
		description:
			'博麗神社での営業時の曲が収録されている。全部で三曲あるうちの三曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「博麗神社」〜その３',
		trackName: '博麗神社 - 満員御礼',
	},
	42: {
		description:
			'紅魔館での営業時の曲が収録されている。全部で三曲あるうちの二曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「紅魔館」〜その２',
		trackName: '紅魔館 - 今夜の楽しみ',
	},
	43: {
		description:
			'紅魔館での営業時の曲が収録されている。全部で三曲あるうちの三曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「紅魔館」〜その３',
		trackName: '紅魔館 - 心ゆくまで',
	},
	44: {
		description:
			'迷いの竹林での営業時の曲が収録されている。全部で三曲あるうちの二曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「迷いの竹林」〜その２',
		trackName: '迷いの竹林 - 気軽な遠足',
	},
	45: {
		description:
			'迷いの竹林での営業時の曲が収録されている。全部で三曲あるうちの三曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「迷いの竹林」〜その３',
		trackName: '迷いの竹林 - 狂喜乱舞',
	},
	46: {
		description:
			'白玉楼・最終決戦の営業時の曲が収録されている。全部で三曲あるうちの二曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「白玉楼」〜その２',
		trackName: '白玉楼 - 暗流渦巻く',
	},
	47: {
		description:
			'白玉楼・最終決戦の営業時の曲が収録されている。全部で三曲あるうちの三曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「白玉楼」〜その３',
		trackName: '白玉楼 - あと一歩',
	},
	1005: {
		description:
			'妖怪の山での営業時の曲が収録されている。全部で三曲あるうちの一曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「妖怪の山」～その１',
		trackName: '妖怪の山 - 初見方円',
	},
	1006: {
		description:
			'妖怪の山での営業時の曲が収録されている。全部で三曲あるうちの二曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「妖怪の山」～その２',
		trackName: '妖怪の山 - 臨風対月',
	},
	1007: {
		description:
			'妖怪の山での営業時の曲が収録されている。全部で三曲あるうちの三曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「妖怪の山」～その３',
		trackName: '妖怪の山 - 一覧衆小',
	},
	1008: {
		description:
			'魔法の森での営業時の曲が収録されている。全部で三曲あるうちの一曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「魔法の森」～その１',
		trackName: '魔法の森 - 孤芳自賞',
	},
	1009: {
		description:
			'魔法の森での営業時の曲が収録されている。全部で三曲あるうちの二曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「魔法の森」～その２',
		trackName: '魔法の森 - 花鳥庭園',
	},
	1010: {
		description:
			'魔法の森での営業時の曲が収録されている。全部で三曲あるうちの三曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「魔法の森」～その３',
		trackName: '魔法の森 - わびさび',
	},
	1011: {
		description:
			'饕餮尤魔との決戦時の曲が収録されている。蓄音機にかけることで再生できる。',
		name: 'レコード「血の池地獄」',
		trackName: '血の池地獄 - 天地を飲み込む',
	},
	2005: {
		description:
			'旧地獄での営業時の曲が収録されている。全部で三曲あるうちの一曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「旧地獄」～その１',
		trackName: '旧地獄 - 陰に晴れを求める',
	},
	2006: {
		description:
			'旧地獄での営業時の曲が収録されている。全部で三曲あるうちの二曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「旧地獄」～その２',
		trackName: '旧地獄 - 柳暗花明',
	},
	2007: {
		description:
			'旧地獄での営業時の曲が収録されている。全部で三曲あるうちの三曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「旧地獄」～その３',
		trackName: '旧地獄 - 百花繚乱',
	},
	2008: {
		description:
			'地霊殿での営業時の曲が収録されている。全部で三曲あるうちの一曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「地霊殿」～その１',
		trackName: '地霊殿 - 廃獄笙歌',
	},
	2009: {
		description:
			'地霊殿での営業時の曲が収録されている。全部で三曲あるうちの二曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「地霊殿」～その２',
		trackName: '地霊殿 - 影隻形単',
	},
	2010: {
		description:
			'地霊殿での営業時の曲が収録されている。全部で三曲あるうちの三曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「地霊殿」～その３',
		trackName: '地霊殿 - 扇影衣香',
	},
	2011: {
		description:
			'怪奇料理大会の曲が収録されている。全部で三曲あるうちの一曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「怪奇料理大会」～その１',
		trackName: '料理大会 - 一喜一憂',
	},
	2012: {
		description:
			'怪奇料理大会の曲が収録されている。全部で三曲あるうちの二曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「怪奇料理大会」～その２',
		trackName: '料理大会 - 試合動く',
	},
	2013: {
		description:
			'怪奇料理大会の曲が収録されている。全部で三曲あるうちの三曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「怪奇料理大会」～その３',
		trackName: '料理大会 - 頂上決戦',
	},
	3003: {
		description:
			'命蓮寺での営業時の曲が収録されている。全部で三曲あるうちの一曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「命蓮寺」～その１',
		trackName: '命蓮寺 - 青山緑瓦',
	},
	3004: {
		description:
			'命蓮寺での営業時の曲が収録されている。全部で三曲あるうちの二曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「命蓮寺」～その２',
		trackName: '命蓮寺 - 丹書黄巻',
	},
	3005: {
		description:
			'命蓮寺での営業時の曲が収録されている。全部で三曲あるうちの三曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「命蓮寺」～その３',
		trackName: '命蓮寺 - 古仏新衣',
	},
	3006: {
		description:
			'神霊廟での営業時の曲が収録されている。全部で三曲あるうちの一曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「神霊廟」～その１',
		trackName: '神霊廟 - 紺碧一隅',
	},
	3007: {
		description:
			'神霊廟での営業時の曲が収録されている。全部で三曲あるうちの二曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「神霊廟」～その２',
		trackName: '神霊廟 - 樹静風軽',
	},
	3008: {
		description:
			'神霊廟での営業時の曲が収録されている。全部で三曲あるうちの三曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「神霊廟」～その３',
		trackName: '神霊廟 - 苔痕皆縁',
	},
	3009: {
		description:
			'国宴大会での営業時の曲が収録されている。全部で三曲あるうちの一曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「国宴大会」～その１',
		trackName: '国宴大会 - 丹精込めて',
	},
	3010: {
		description:
			'国宴大会での営業時の曲が収録されている。全部で三曲あるうちの二曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「国宴大会」～その２',
		trackName: '国宴大会 - 精雕細刻',
	},
	3011: {
		description:
			'国宴大会での営業時の曲が収録されている。全部で三曲あるうちの三曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「国宴大会」～その３',
		trackName: '国宴大会 - 大器晩成',
	},
	4005: {
		description:
			'太陽の畑での営業時の曲が収録されている。全部で三曲あるうちの一曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「太陽の畑」～その１',
		trackName: '太陽の畑 - 夢に見る片葉',
	},
	4006: {
		description:
			'太陽の畑での営業時の曲が収録されている。全部で三曲あるうちの二曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「太陽の畑」～その２',
		trackName: '太陽の畑 - 咲き誇る花々',
	},
	4007: {
		description:
			'太陽の畑での営業時の曲が収録されている。全部で三曲あるうちの三曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「太陽の畑」～その３',
		trackName: '太陽の畑 - 金色のシンフォニー',
	},
	4008: {
		description:
			'輝針城での営業時の曲が収録されている。全部で三曲あるうちの一曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「輝針城」～その１',
		trackName: '輝針城 - 悠々たる音',
	},
	4009: {
		description:
			'輝針城での営業時の曲が収録されている。全部で三曲あるうちの二曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「輝針城」～その２',
		trackName: '輝針城 - 回転加速',
	},
	4010: {
		description:
			'輝針城での営業時の曲が収録されている。全部で三曲あるうちの三曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「輝針城」～その３',
		trackName: '輝針城 - 無限爆走',
	},
	4011: {
		description:
			'鬼ごっこでの営業時の曲が収録されている。全部で三曲あるうちの一曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「鬼ごっこ」～その１',
		trackName:
			'鬼ごっこ - 春のそよ風よ、我が命じる！無限の闇を吹き払え！その１',
	},
	4012: {
		description:
			'鬼ごっこでの営業時の曲が収録されている。全部で三曲あるうちの二曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「鬼ごっこ」～その２',
		trackName:
			'鬼ごっこ - 春のそよ風よ、我が命じる！無限の闇を吹き払え！その２',
	},
	4013: {
		description:
			'鬼ごっこの営業ソングを収録したレコードで、全3曲。これが三曲目で、蓄音機でいつでも再生できる。',
		name: 'レコード「鬼ごっこ」 ~ 其三',
		trackName:
			'鬼ごっこ - 春のそよ風よ、我が命じる！無限の闇を吹き払え！その３',
	},
	5000: {
		description:
			'月の都での営業時の曲が収録されている。全部で三曲あるうちの一曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「月の都」～その１',
		trackName: '月の都 - 水中の月',
	},
	5001: {
		description:
			'月の都での営業時の曲が収録されている。全部で三曲あるうちの二曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「月の都」～その２',
		trackName: '月の都 - 風起蕭瑟',
	},
	5002: {
		description:
			'月の都での営業時の曲が収録されている。全部で三曲あるうちの三曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「月の都」～その３',
		trackName: '月の都 - 古往今来',
	},
	5003: {
		description:
			'魔界での営業時の曲が収録されている。全部で三曲あるうちの一曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「魔界」～その１',
		trackName: '魔界 - 林の中の秘境',
	},
	5004: {
		description:
			'魔界での営業時の曲が収録されている。全部で三曲あるうちの二曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「魔界」～その２',
		trackName: '魔界 - 奇花異草',
	},
	5005: {
		description:
			'魔界での営業時の曲が収録されている。全部で三曲あるうちの三曲目。蓄音機にかけることで再生できる。',
		name: 'レコード「魔界」～その３',
		trackName: '魔界 - 月暗珠明',
	},
	5006: {
		description:
			'月都試練時の営業時の曲が収録されている。蓄音機にかけることで再生できる。',
		name: 'レコード「天羅地網」～その１',
		trackName: '破魔の太刀',
	},
	5007: {
		description:
			'宮出口瑞霊との決戦時の営業時の曲が収録されている。蓄音機にかけることで再生できる。',
		name: 'レコード「天羅地網」～その２',
		trackName: '困獣の闘、天羅地網！',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedRecordText>>>;
