import type { ILocalizedRecordText } from '@/domain/data/localization/types';

export const RECORD_LOCALIZATION_KO = {
	11: {
		description:
			'요괴 짐승길에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 첫 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「요괴 짐승길」 1',
		trackName: '요괴 짐승길 - 고요한 밤의 시작',
	},
	12: {
		description:
			'인간 마을에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 첫 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「인간 마을」 1',
		trackName: '인간 마을 - 역사의 편린',
	},
	13: {
		description:
			'하쿠레이 신사에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 첫 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「하쿠레이 신사」 1',
		trackName: '하쿠레이 신사 - 멋진 소식',
	},
	14: {
		description:
			'홍마관에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 첫 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「홍마관」 1',
		trackName: '홍마관 - 와인과 식사',
	},
	15: {
		description:
			'미혹의 죽림에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 첫 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「미혹의 죽림」 1',
		trackName: '미혹의 죽림 - 가끔 오는 손님',
	},
	16: {
		description:
			'백옥루에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 첫 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「백옥루」 1',
		trackName: '백옥루 - 사면초가',
	},
	36: {
		description:
			'요괴 짐승길에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 두 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「요괴 짐승길」 2',
		trackName: '요괴 짐승길 - 계속되는 밤의 잔치',
	},
	37: {
		description:
			'요괴 짐승길에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 세 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「요괴 짐승길」 3',
		trackName: '요괴 짐승길 - 붐비는 한밤의 환락',
	},
	38: {
		description:
			'인간 마을에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 두 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「인간 마을」 2',
		trackName: '인간 마을 - 쌓여가는 손님',
	},
	39: {
		description:
			'인간 마을에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 세 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「인간 마을」 3',
		trackName: '인간 마을 - 인산인해',
	},
	40: {
		description:
			'하쿠레이 신사에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 두 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「하쿠레이 신사」 2',
		trackName: '하쿠레이 신사 - 호객',
	},
	41: {
		description:
			'하쿠레이 신사에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 세 번째로, 축음기A를 이용해 재생할 수 있습니다.',
		name: '디스크 「하쿠레이 신사」 3',
		trackName: '하쿠레이 신사 - 풀하우스',
	},
	42: {
		description:
			'홍마관에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 두 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「홍마관」 2',
		trackName: '홍마관 - 색과 맛',
	},
	43: {
		description:
			'홍마관에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 세 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「홍마관」 3',
		trackName: '홍마관 - 합창과 셉텟',
	},
	44: {
		description:
			'미혹의 죽림에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 두 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「미혹의 죽림」 2',
		trackName: '미혹의 죽림 - 숙련된 여주인',
	},
	45: {
		description:
			'미혹의 죽림에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 세 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「미혹의 죽림」 3',
		trackName: '미혹의 죽림 - 루나틱 싱어',
	},
	46: {
		description:
			'백옥루에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 두 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「백옥루」 2',
		trackName: '백옥루 - 검은 저류의 꽃',
	},
	47: {
		description:
			'백옥루에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 세 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「백옥루」 3',
		trackName: '백옥루 - 마지막 한 걸음',
	},
	1005: {
		description:
			'요괴의 산에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 첫 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「요괴의 산」 1',
		trackName: '요괴의 산-처음 보는 광경',
	},
	1006: {
		description:
			'요괴의 산에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 두 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「요괴의 산」 2',
		trackName: '요괴의 산-바람 맞이, 달 맞이',
	},
	1007: {
		description:
			'요괴의 산에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 세 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「요괴의 산」 3',
		trackName: '요괴의 산-한 눈에 보는 풍경',
	},
	1008: {
		description:
			'마법의 숲에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 첫 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「마법의 숲」 1',
		trackName: '마법의 숲-고고한 꽃',
	},
	1009: {
		description:
			'마법의 숲에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 두 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「마법의 숲」 2',
		trackName: '마법의 숲-꽃과 새의 정원',
	},
	1010: {
		description:
			'마법의 숲에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 세 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「마법의 숲」 3',
		trackName: '마법의 숲-한적하고 고요한 곳',
	},
	1011: {
		description:
			'피연못지옥에서의 결전 음악이 담겨 있습니다. 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크「피연못지옥」',
		trackName: '피연못 지옥-하늘을 삼키다',
	},
	2005: {
		description:
			'옛 지옥에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 첫 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「옛 지옥」 1',
		trackName: '옛 지옥 - 흐린 날에 맑은 하늘 찾기',
	},
	2006: {
		description:
			'옛 지옥에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 두 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「옛 지옥」 2',
		trackName: '옛 지옥 - 아름다운 봄날의 경치',
	},
	2007: {
		description:
			'옛 지옥에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 세 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「옛 지옥」 3',
		trackName: '옛 지옥 - 만개한 빛깔',
	},
	2008: {
		description:
			'지령전에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 첫 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「지령전」 1',
		trackName: '지령전 - 폐옥의 활기찬 노래',
	},
	2009: {
		description:
			'지령전에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 두 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「지령전」 2',
		trackName: '지령전 - 독무대의 그림자',
	},
	2010: {
		description:
			'지령전에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 세 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「지령전」 3',
		trackName: '지령전 - 그림자들의 윤무',
	},
	2011: {
		description:
			'괴식 요리 대회에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 첫 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「괴식 요리 대회」 1',
		trackName: '괴식 요리 대회 - 걱정 반 행복 반',
	},
	2012: {
		description:
			'괴식 요리 대회에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 두 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「괴식 요리 대회」 2',
		trackName: '괴식 요리 대회 - 시합과 요란함',
	},
	2013: {
		description:
			'괴식 요리 대회에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 세 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「괴식 요리 대회」 3',
		trackName: '괴식 요리 대회 - 성공의 길',
	},
	3003: {
		description:
			'명련사에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 첫 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「명련사」 1',
		trackName: '명련사-푸른 산과 푸른 기와',
	},
	3004: {
		description:
			'명련사에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 두 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「명련사」 2',
		trackName: '명련사-노란 책의 붉은 글씨',
	},
	3005: {
		description:
			'명련사에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 세 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「명련사」 3',
		trackName: '명련사-부처의 새 옷',
	},
	3006: {
		description:
			'신령묘에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 첫 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「신령묘」 1',
		trackName: '신령묘-감벽의 모퉁이',
	},
	3007: {
		description:
			'신령묘에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 두 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「신령묘」 2',
		trackName: '신령묘-물 위 정자의 진풍경',
	},
	3008: {
		description:
			'신령묘에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 세 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「신령묘」 3',
		trackName: '신령묘-인연을 담은 축축한 돌',
	},
	3009: {
		description:
			'예대제에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 첫 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「예대제」 1',
		trackName: '요리 대결-전심전력',
	},
	3010: {
		description:
			'예대제에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 두 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「예대제」 2',
		trackName: '요리 대결-정조세각',
	},
	3011: {
		description:
			'예대제에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 세 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「예대제」 3',
		trackName: '요리 대결-나 자신을 뛰어넘어',
	},
	4005: {
		description:
			'태양의 밭에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 첫 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「태양의 밭」 1',
		trackName: '태양의 밭 - 꿈꾸는 잎새',
	},
	4006: {
		description:
			'태양의 밭에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 두 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「태양의 밭」 2',
		trackName: '태양의 밭 - 찬란한 꽃무리',
	},
	4007: {
		description:
			'태양의 밭에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 세 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「태양의 밭」 3',
		trackName: '태양의 밭 - 금빛 교향악',
	},
	4008: {
		description:
			'휘침성에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 첫 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「휘침성」 1',
		trackName: '휘침성 - 유유히 들리는 소리',
	},
	4009: {
		description:
			'휘침성에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 두 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「휘침성」 2',
		trackName: '휘침성 - 가속하는 역전',
	},
	4010: {
		description:
			'휘침성에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 세 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「휘침성」 3',
		trackName: '휘침성 - 무한한 맹풍',
	},
	4011: {
		description:
			'귀신잡기에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 첫 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「귀신잡기」 1',
		trackName: '귀신잡기 - 봄바람이여, 무한한 어둠을 불어내거라! 그 1',
	},
	4012: {
		description:
			'귀신잡기에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 두 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「귀신잡기」 2',
		trackName: '귀신잡기 - 봄바람이여, 무한한 어둠을 불어내거라! 그 2',
	},
	4013: {
		description:
			'귀신잡기에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 세 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「귀신잡기」 3',
		trackName: '귀신잡기 - 봄바람이여, 무한한 어둠을 불어내거라! 그 3',
	},
	5000: {
		description:
			'달의 도시에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 첫 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「달의 도시」 1',
		trackName: '달의 도시 - 물 속의 보름달',
	},
	5001: {
		description:
			'달의 도시에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 두 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「달의 도시」 2',
		trackName: '달의 도시 - 적막한 바람',
	},
	5002: {
		description:
			'달의 도시에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 세 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「달의 도시」 3',
		trackName: '달의 도시 - 예전부터 지금까지',
	},
	5003: {
		description:
			'마계에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 첫 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「마계」 1',
		trackName: '마계 - 숲 속의 비경',
	},
	5004: {
		description:
			'마계에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 두 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「마계」 2',
		trackName: '마계 - 기이한 풀꽃',
	},
	5005: {
		description:
			'마계에서의 영업 음악이 담겨 있습니다. 전체 3곡 중 세 번째로, 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「마계」 3',
		trackName: '마계 - 어두운 달, 밝은 달',
	},
	5006: {
		description:
			'달의 도시에서 훈련할 때의 음악이 담겨 있습니다. 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「천라지망」 1',
		trackName: '악마를 가르는 태도',
	},
	5007: {
		description:
			'미야데구치 미즈치와의 결전 때의 음악이 담겨 있습니다. 축음기를 이용해 재생할 수 있습니다.',
		name: '디스크 「천라지망」 2',
		trackName: '벼랑 끝 혈투, 천라지망!',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedRecordText>>>;
