import type { ILocalizedRecordText } from '@/domain/data/localization/types';

export const RECORD_LOCALIZATION_ZH_TW = {
	11: {
		description:
			'收錄了獸道的營業之歌的唱片，一共三首，此為第一首。可以隨時放在留聲機裏播放。',
		name: '唱片「妖怪獸道」 ~ 其一',
		trackName: '妖怪獸道-靜夜伊始',
	},
	12: {
		description:
			'收錄了人間之里的營業之歌的唱片，一共三首，此為第一首。可以隨時放在留聲機裏播放。',
		name: '唱片「人間之里」 ~ 其一',
		trackName: '人間之里-三五成羣',
	},
	13: {
		description:
			'收錄了博麗神社的營業之歌的唱片，一共三首，此為第一首。可以隨時放在留聲機裏播放。',
		name: '唱片「博麗神社」 ~ 其一',
		trackName: '博麗神社-驚聞客來',
	},
	14: {
		description:
			'收錄了紅魔館的營業之歌的唱片，一共三首，此為第一首。可以隨時放在留聲機裏播放。',
		name: '唱片「紅魔館」 ~ 其一',
		trackName: '紅魔館-飲酒品餚',
	},
	15: {
		description:
			'收錄了迷途竹林的營業之歌的唱片，一共三首，此為第一首。可以隨時放在留聲機裏播放。',
		name: '唱片「迷途竹林」 ~ 其一',
		trackName: '迷途竹林-偶有客至',
	},
	16: {
		description:
			'收錄了白玉樓·最終決戰的營業之歌的唱片，一共三首，此為第一首。可以隨時放在留聲機裏播放。',
		name: '唱片「白玉樓」 ~ 其一',
		trackName: '白玉樓-四面楚歌',
	},
	36: {
		description:
			'收錄了獸道的營業之歌的唱片，一共三首，此為第二首。可以隨時放在留聲機裏播放。',
		name: '唱片「妖怪獸道」 ~ 其二',
		trackName: '妖怪獸道-紅燈綠酒',
	},
	37: {
		description:
			'收錄了獸道的營業之歌的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「妖怪獸道」 ~ 其三',
		trackName: '妖怪獸道-千客萬來',
	},
	38: {
		description:
			'收錄了人間之里的營業之歌的唱片，一共三首，此為第二首。可以隨時放在留聲機裏播放。',
		name: '唱片「人間之里」 ~ 其二',
		trackName: '人間之里-接踵而至',
	},
	39: {
		description:
			'收錄了人間之里的營業之歌的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「人間之里」 ~ 其三',
		trackName: '人間之里-人山人海',
	},
	40: {
		description:
			'收錄了博麗神社的營業之歌的唱片，一共三首，此為第二首。可以隨時放在留聲機裏播放。',
		name: '唱片「博麗神社」 ~ 其二',
		trackName: '博麗神社-稀客盈門',
	},
	41: {
		description:
			'收錄了博麗神社的營業之歌的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「博麗神社」 ~ 其三',
		trackName: '博麗神社-座無虛席',
	},
	42: {
		description:
			'收錄了紅魔館的營業之歌的唱片，一共三首，此為第二首。可以隨時放在留聲機裏播放。',
		name: '唱片「紅魔館」 ~ 其二',
		trackName: '紅魔館-色味共賞',
	},
	43: {
		description:
			'收錄了紅魔館的營業之歌的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「紅魔館」 ~ 其三',
		trackName: '紅魔館-遂心快意',
	},
	44: {
		description:
			'收錄了迷途竹林的營業之歌的唱片，一共三首，此為第二首。可以隨時放在留聲機裏播放。',
		name: '唱片「迷途竹林」 ~ 其二',
		trackName: '迷途竹林-輕車熟路',
	},
	45: {
		description:
			'收錄了迷途竹林的營業之歌的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「迷途竹林」 ~ 其三',
		trackName: '迷途竹林-歡欣狂舞',
	},
	46: {
		description:
			'收錄了白玉樓·最終決戰的營業之歌的唱片，一共三首，此為第二首。可以隨時放在留聲機裏播放。',
		name: '唱片「白玉樓」 ~ 其二',
		trackName: '白玉樓-明潮暗湧',
	},
	47: {
		description:
			'收錄了白玉樓·最終決戰的營業之歌的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「白玉樓」 ~ 其三',
		trackName: '白玉樓-一步之遙',
	},
	1005: {
		description:
			'收錄了妖怪之山的營業之歌的唱片，一共三首，此為第一首。可以隨時放在留聲機裏播放。',
		name: '唱片「妖怪之山」 ~ 其一',
		trackName: '妖怪之山-初見方園',
	},
	1006: {
		description:
			'收錄了妖怪之山的營業之歌的唱片，一共三首，此為第二首。可以隨時放在留聲機裏播放。',
		name: '唱片「妖怪之山」 ~ 其二',
		trackName: '妖怪之山-臨風對月',
	},
	1007: {
		description:
			'收錄了妖怪之山的營業之歌的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「妖怪之山」 ~ 其三',
		trackName: '妖怪之山-一覽眾小',
	},
	1008: {
		description:
			'收錄了森林的營業之歌的唱片，一共三首，此為第一首。可以隨時放在留聲機裏播放。',
		name: '唱片「魔法之森」 ~ 其一',
		trackName: '魔法之森-孤芳自賞',
	},
	1009: {
		description:
			'收錄了森林的營業之歌的唱片，一共三首，此為第二首。可以隨時放在留聲機裏播放。',
		name: '唱片「魔法之森」 ~ 其二',
		trackName: '魔法之森-花鳥庭園',
	},
	1010: {
		description:
			'收錄了森林的營業之歌的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「魔法之森」 ~ 其三',
		trackName: '魔法之森-閒適靜謐',
	},
	1011: {
		description:
			'收錄了與饕餮尤魔決戰時音樂的唱片。可以隨時放在留聲機裏播放。',
		name: '唱片「血池地獄」',
		trackName: '血池地獄-吞天噬地',
	},
	2005: {
		description:
			'收錄了舊地獄的營業之歌的唱片，一共三首，此為第一首。可以隨時放在留聲機裏播放。',
		name: '唱片「舊地獄」 ~ 其一',
		trackName: '舊地獄-陰裏尋晴',
	},
	2006: {
		description:
			'收錄了舊地獄的營業之歌的唱片，一共三首，此為第二首。可以隨時放在留聲機裏播放。',
		name: '唱片「舊地獄」 ~ 其二',
		trackName: '舊地獄-柳暗花明',
	},
	2007: {
		description:
			'收錄了舊地獄的營業之歌的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「舊地獄」 ~ 其三',
		trackName: '舊地獄-萬紫千紅',
	},
	2008: {
		description:
			'收錄了地靈殿的營業之歌的唱片，一共三首，此為第一首。可以隨時放在留聲機裏播放。',
		name: '唱片「地靈殿」 ~ 其一',
		trackName: '地靈殿-廢獄笙歌',
	},
	2009: {
		description:
			'收錄了地靈殿的營業之歌的唱片，一共三首，此為第二首。可以隨時放在留聲機裏播放。',
		name: '唱片「地靈殿」 ~ 其二',
		trackName: '地靈殿-獨舞成影',
	},
	2010: {
		description:
			'收錄了地靈殿的營業之歌的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「地靈殿」 ~ 其三',
		trackName: '地靈殿-眾影成卷',
	},
	2011: {
		description:
			'收錄了怪誕料理大賽背景音樂的唱片，一共三首，此為第一首。可以隨時放在留聲機裏播放。',
		name: '唱片「怪誕料理大賽」~ 其一',
		trackName: '料理大賽-半憂半喜',
	},
	2012: {
		description:
			'收錄了怪誕料理大賽背景音樂的唱片，一共三首，此為第二首。可以隨時放在留聲機裏播放。',
		name: '唱片「怪誕料理大賽」~ 其二',
		trackName: '料理大賽-亦賽亦鬧',
	},
	2013: {
		description:
			'收錄了怪誕料理大賽背景音樂的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「怪誕料理大賽」~ 其三',
		trackName: '料理大賽-一將功成',
	},
	3003: {
		description:
			'收錄了命蓮寺的營業之歌的唱片，一共三首，此為第一首。可以隨時放在留聲機裏播放。',
		name: '唱片「命蓮寺」 ~ 其一',
		trackName: '命蓮寺-青山綠瓦',
	},
	3004: {
		description:
			'收錄了命蓮寺的營業之歌的唱片，一共三首，此為第二首。可以隨時放在留聲機裏播放。',
		name: '唱片「命蓮寺」 ~ 其二',
		trackName: '命蓮寺-丹書黃卷',
	},
	3005: {
		description:
			'收錄了命蓮寺的營業之歌的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「命蓮寺」 ~ 其三',
		trackName: '命蓮寺-古佛新衣',
	},
	3006: {
		description:
			'收錄了神靈廟的營業之歌的唱片，一共三首，此為第一首。可以隨時放在留聲機裏播放。',
		name: '唱片「神靈廟」 ~ 其一',
		trackName: '神靈廟-紺碧一隅',
	},
	3007: {
		description:
			'收錄了神靈廟的營業之歌的唱片，一共三首，此為第二首。可以隨時放在留聲機裏播放。',
		name: '唱片「神靈廟」 ~ 其二',
		trackName: '神靈廟-樹靜風輕',
	},
	3008: {
		description:
			'收錄了神靈廟的營業之歌的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「神靈廟」 ~ 其三',
		trackName: '神靈廟-苔痕皆緣',
	},
	3009: {
		description:
			'收錄了國宴大賽的營業之歌的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「國宴大賽」 ~ 其一',
		trackName: '國宴大賽-殫精竭慮',
	},
	3010: {
		description:
			'收錄了國宴大賽的營業之歌的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「國宴大賽」 ~ 其二',
		trackName: '國宴大賽-精雕細琢',
	},
	3011: {
		description:
			'收錄了國宴大賽的營業之歌的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「國宴大賽」 ~ 其三',
		trackName: '國宴大賽-超我大成',
	},
	4005: {
		description:
			'收錄了太陽花田的營業之歌的唱片，一共三首，此為第一首。可以隨時放在留聲機裏播放。',
		name: '唱片「太陽花田」 ~ 其一',
		trackName: '太陽花田-一葉入夢',
	},
	4006: {
		description:
			'收錄了太陽花田的營業之歌的唱片，一共三首，此為第二首。可以隨時放在留聲機裏播放。',
		name: '唱片「太陽花田」 ~ 其二',
		trackName: '太陽花田-花團錦簇',
	},
	4007: {
		description:
			'收錄了太陽花田的營業之歌的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「太陽花田」 ~ 其三',
		trackName: '太陽花田-金色交響',
	},
	4008: {
		description:
			'收錄了輝針城的營業之歌的唱片，一共三首，此為第一首。可以隨時放在留聲機裏播放。',
		name: '唱片「輝針城」 ~ 其一',
		trackName: '輝針城-悠然來聲',
	},
	4009: {
		description:
			'收錄了輝針城的營業之歌的唱片，一共三首，此為第二首。可以隨時放在留聲機裏播放。',
		name: '唱片「輝針城」 ~ 其二',
		trackName: '輝針城-迴轉加速',
	},
	4010: {
		description:
			'收錄了輝針城的營業之歌的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「輝針城」 ~ 其三',
		trackName: '輝針城-無垠狂飆',
	},
	4011: {
		description:
			'收錄了抓鬼比賽營業之歌的的唱片，一共三首，此為第一首。可以隨時放在留聲機裏播放。',
		name: '唱片「抓鬼比賽」 ~ 其一',
		trackName: '抓鬼比賽-吾令徐徐春風!吹散無盡幽暗!其一',
	},
	4012: {
		description:
			'收錄了抓鬼比賽營業之歌的的唱片，一共三首，此為第二首。可以隨時放在留聲機裏播放。',
		name: '唱片「抓鬼比賽」 ~ 其二',
		trackName: '抓鬼比賽-吾令徐徐春風!吹散無盡幽暗!其二',
	},
	4013: {
		description:
			'收錄了抓鬼比賽營業之歌的的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「抓鬼比賽」 ~ 其三',
		trackName: '抓鬼比賽-吾令徐徐春風!吹散無盡幽暗!其三',
	},
	5000: {
		description:
			'收錄了月之都的營業之歌的唱片，一共三首，此為第一首。可以隨時放在留聲機裏播放。',
		name: '唱片「月之都」 ~ 其一',
		trackName: '月都-水中望月',
	},
	5001: {
		description:
			'收錄了月之都的營業之歌的唱片，一共三首，此為第二首。可以隨時放在留聲機裏播放。',
		name: '唱片「月之都」 ~ 其二',
		trackName: '月都-風起蕭瑟',
	},
	5002: {
		description:
			'收錄了月之都的營業之歌的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「月之都」 ~ 其三',
		trackName: '月都-古往今來',
	},
	5003: {
		description:
			'收錄了魔界的營業之歌的唱片，一共三首，此為第一首。可以隨時放在留聲機裏播放。',
		name: '唱片「魔界」 ~ 其一',
		trackName: '魔界-林中秘境',
	},
	5004: {
		description:
			'收錄了魔界的營業之歌的唱片，一共三首，此為第二首。可以隨時放在留聲機裏播放。',
		name: '唱片「魔界」 ~ 其二',
		trackName: '魔界-奇花異卉',
	},
	5005: {
		description:
			'收錄了魔界的營業之歌的唱片，一共三首，此為第三首。可以隨時放在留聲機裏播放。',
		name: '唱片「魔界」 ~ 其三',
		trackName: '魔界-月暗珠明',
	},
	5006: {
		description:
			'收錄了月都試煉時營業之歌的唱片。可以隨時放在留聲機裏播放。',
		name: '唱片「天羅地網」 ~ 其一',
		trackName: '破魔的太刀',
	},
	5007: {
		description:
			'收錄了與宮出口瑞靈決戰時營業之歌的唱片。可以隨時放在留聲機裏播放。',
		name: '唱片「天羅地網」 ~ 其二',
		trackName: '困獸之鬥，天羅地網！',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedRecordText>>>;
