import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const BADGE_LOCALIZATION_JA = {
	1000: { description: '饕餮尤魔に再挑戦すると獲得', name: '血の池地獄の証' },
	2000: {
		description:
			'古明地さとりの記憶で怪奇料理大会に再挑戦し、Easy以上の難易度で勝利すると獲得',
		name: '怪奇妖怪制覇の証-Easy',
	},
	2001: {
		description:
			'古明地さとりの記憶で怪奇料理大会に再挑戦し、Normal以上の難易度で勝利すると獲得',
		name: '怪奇妖怪制覇の証-Normal',
	},
	2002: {
		description:
			'古明地さとりの記憶で怪奇料理大会に再挑戦し、Hard以上の難易度で勝利すると獲得',
		name: '怪奇妖怪制覇の証-Hard',
	},
	2003: {
		description:
			'古明地さとりの記憶で怪奇料理大会に再挑戦し、Lunaticの難易度で勝利すると獲得',
		name: '怪奇妖怪制覇の証-Lunatic',
	},
	2500: {
		description:
			'「妖怪獣道」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '原始と野性のバッジ ~ 銀',
	},
	2501: {
		description:
			'「妖怪獣道」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '原始と野性のバッジ ~ 金',
	},
	2502: {
		description:
			'「人間の里」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '豊穣と満作のバッジ ~ 銀',
	},
	2503: {
		description:
			'「人間の里」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '豊穣と満作のバッジ ~ 金',
	},
	2504: {
		description:
			'「博麗神社」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '孤独と節制のバッジ ~ 銀',
	},
	2505: {
		description:
			'「博麗神社」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '孤独と節制のバッジ ~ 金',
	},
	2506: {
		description:
			'「紅魔館」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '魔法と呪いのバッジ ~ 銀',
	},
	2507: {
		description:
			'「紅魔館」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '魔法と呪いのバッジ ~ 金',
	},
	2508: {
		description:
			'「迷いの竹林」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '終古と刹那のバッジ ~ 銀',
	},
	2509: {
		description:
			'「迷いの竹林」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '終古と刹那のバッジ ~ 金',
	},
	2510: {
		description:
			'「白玉楼」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '桜咲と桜散のバッジ ~ 銀',
	},
	2511: {
		description:
			'「白玉楼」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '桜咲と桜散のバッジ ~ 金',
	},
	2512: {
		description:
			'「鳥獣伎楽」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '始まりと終わりのバッジ ~ 銀',
	},
	2513: {
		description:
			'「鳥獣伎楽」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '始まりと終わりのバッジ ~ 金',
	},
	2514: {
		description:
			'「魔法の森」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '幽深と残響のバッジ ~ 銀',
	},
	2515: {
		description:
			'「魔法の森」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '幽深と残響のバッジ ~ 金',
	},
	2516: {
		description:
			'「妖怪の山」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '豊作と寂寥のバッジ ~ 銀',
	},
	2517: {
		description:
			'「妖怪の山」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '豊作と寂寥のバッジ ~ 金',
	},
	2518: {
		description:
			'「血の池地獄」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '呑込と破滅のバッジ ~ 銀',
	},
	2519: {
		description:
			'「血の池地獄」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '呑込と破滅のバッジ ~ 金',
	},
	2520: {
		description:
			'「旧地獄」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '灼熱と躁動のバッジ ~ 銀',
	},
	2521: {
		description:
			'「旧地獄」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '灼熱と躁動のバッジ ~ 金',
	},
	2522: {
		description:
			'「地霊殿」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '寂寥と偏愛のバッジ ~ 銀',
	},
	2523: {
		description:
			'「地霊殿」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '寂寥と偏愛のバッジ ~ 金',
	},
	2524: {
		description:
			'「怪奇料理大会」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '怪誕と常理のバッジ ~ 銀',
	},
	2525: {
		description:
			'「怪奇料理大会」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '怪誕と常理のバッジ ~ 金',
	},
	2526: {
		description: '「音楽を愛する者の挑戦」ストーリーをクリアした後に獲得',
		name: '音楽愛のバッジ',
	},
	2527: {
		description:
			'「博麗大祭」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '博麗大祭のバッジ ~ 銀',
	},
	2528: {
		description:
			'「博麗大祭」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '博麗大祭のバッジ ~ 金',
	},
	2529: {
		description:
			'「命蓮寺」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '静寂と晨暮のバッジ ~ 銀',
	},
	2530: {
		description:
			'「命蓮寺」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '静寂と晨暮のバッジ ~ 金',
	},
	2531: {
		description:
			'「神霊廟大会」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '陰陽と協調のバッジ ~ 銀',
	},
	2532: {
		description:
			'「神霊廟大会」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '陰陽と協調のバッジ ~ 金',
	},
	2533: {
		description:
			'「太陽の畑」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '薫風と芳華のバッジ ~ 銀',
	},
	2534: {
		description:
			'「太陽の畑」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '薫風と芳華のバッジ ~ 金',
	},
	2535: {
		description:
			'「輝針城」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '朽ちた夢と生残のバッジ ~ 銀',
	},
	2536: {
		description:
			'「輝針城」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '朽ちた夢と生残のバッジ ~ 金',
	},
	2537: {
		description:
			'「紅魔館の鬼ごっこ」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '幽閉と禁忌のバッジ ~ 銀',
	},
	2538: {
		description:
			'「紅魔館の鬼ごっこ」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '幽閉と禁忌のバッジ ~ 金',
	},
	2539: {
		description:
			'「月の都」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '努力と守旧のバッジ ~ 銀',
	},
	2540: {
		description:
			'「月の都」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '努力と守旧のバッジ ~ 金',
	},
	2541: {
		description:
			'「魔界」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '夢幻と茶会のバッジ ~ 銀',
	},
	2542: {
		description:
			'「魔界」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '夢幻と茶会のバッジ ~ 金',
	},
	2543: {
		description:
			'「天羅地網」の章の全楽曲において難易度「Easy」でA以上の評価を達成すると獲得',
		name: '窮鼠と猫のバッジ ~ 銀',
	},
	2544: {
		description:
			'「天羅地網」の章の全楽曲において難易度「Hard」でA以上の評価を達成すると獲得',
		name: '窮鼠と猫のバッジ ~ 金',
	},
	3000: {
		description: '博麗大祭対抗戦・神霊廟料理大会勝利記念',
		name: '博麗大祭料理大会メダル',
	},
	3001: {
		description: '博麗大祭対抗戦・命蓮寺ロック大会勝利記念',
		name: '博麗大祭ロック大会メダル',
	},
	4000: {
		description:
			'紅魔館の鬼ごっこゲームでフランドールのすべての分身を撃破すると獲得',
		name: '悪魔の妹、制覇の証-Easy',
	},
	4001: {
		description:
			'紅魔館の地下室に行き、難易度Normal以上の鬼ごっこゲームでフランドールのすべての分身を撃破すると獲得',
		name: '悪魔の妹、制覇の証-Normal',
	},
	4002: {
		description:
			'紅魔館の地下室に行き、難易度Hard以上の鬼ごっこゲームでフランドールのすべての分身を撃破すると獲得',
		name: '悪魔の妹、制覇の証-Hard',
	},
	4003: {
		description:
			'紅魔館の地下室に行き、難易度Lunaticの鬼ごっこゲームでフランドールのすべての分身を撃破すると獲得',
		name: '悪魔の妹、制覇の証-Lunatic',
	},
	5000: {
		description: '神綺の創造者の箱を入手すると獲得',
		name: '創造と無限の証',
	},
	5001: {
		description: '反獄王・宮出口瑞霊を捕獲すると獲得',
		name: '反獄王捕獲の証-Easy',
	},
	5002: {
		description:
			'月の都のシミュレーションで、１つ以上の悪呪が活性化された状態にして、反獄王・宮出口瑞霊を捕獲すると獲得',
		name: '反獄王捕獲の証-Normal',
	},
	5003: {
		description:
			'月の都のシミュレーションで、２つ以上の悪呪が活性化された状態にして、反獄王・宮出口瑞霊を捕獲すると獲得',
		name: '反獄王捕獲の証-Hard',
	},
	5004: {
		description:
			'月の都のシミュレーションで、３つの悪呪が活性化された状態にして、反獄王・宮出口瑞霊を捕獲すると獲得',
		name: '反獄王捕獲の証-Lunatic',
	},
	5005: {
		description: '月の都のシミュレーションで、サバイバルモードに入る',
		name: '何でもローグライク？',
	},
	5006: {
		description: 'サバイバルモードで初めてミケの営業カードを発動',
		name: 'ローグライクの魂は選択にあり',
	},
	5007: {
		description:
			'サバイバルモードの夜間営業で、ミケの営業カードを合計18回発動',
		name: '知られざるカードの闇市',
	},
	5008: {
		description: 'サバイバルモードで、ミケの営業カードを累計100枚引いた',
		name: '強欲な夜雀',
	},
	5009: {
		description:
			'サバイバルモードの夜間営業で「万物豊穣」、「三頭犬の捕獣罠」、「三途川牛鬼魚市」と「秘宝探査機」の4種類のカードを発動',
		name: '魚・肉・野菜・卵、栄養たっぷり',
	},
	5010: {
		description:
			'サバイバルモードで、カード「必ず当たる」を使用し、最高条件で以下のいずれかのお酒を返還：アカツキ・十四夜・火鼠の衣',
		name: 'パーフェクトゴールデンスピン！',
	},
	5011: {
		description: 'サバイバルモードで、初めてミケのグローバルカードを発動',
		name: '大吉猫の招き術',
	},
	5012: {
		description: 'サバイバルモードで、異なるグローバルカードを9枚集める',
		name: 'バフがいっぱい！',
	},
	5013: {
		description: 'サバイバルモードで、異なるグローバルカードを24枚集める',
		name: '千宝万来、金札満堂',
	},
	5014: {
		description:
			'サバイバルモードでカード「鬼渡の試練」を使用し、試練を一度クリアした',
		name: '鳥頭の地獄試練官',
	},
	5015: {
		description: 'サバイバルモードで、移動力が5に達する',
		name: '一筋斗で、遥か彼方へ',
	},
	5016: {
		description: 'サバイバルモードで、香霖堂の商品が90%オフの割引になる',
		name: 'ワンコイン',
	},
	5017: {
		description:
			'サバイバルモードで、香霖堂の販売材料数が300%以上の状態で食材を買い尽くす',
		name: '食食食食食料徴収人',
	},
	5018: {
		description:
			'サバイバルモードで「妖怪獣道」、「人間の里」、「博麗神社」、「紅魔館」と「迷いの竹林」の夜雀食堂レベルはすべて3級に到達させ、かつそれぞれの店を開いたことがある',
		name: '疾風迅雷、大地に駆け巡る',
	},
	5019: {
		description:
			'サバイバルモードで、5種類の「危険なカード」をそれぞれ一度引いた',
		name: '輪廻・終末',
	},
	5020: {
		description:
			'サバイバルモードで、いずれかの営業において売上目標の110%を超えずにギリギリクリア',
		name: 'かすり弾と決死',
	},
	5021: {
		description: 'サバイバルモードで、80種類のレシピを獲得',
		name: '記憶の収束が始まった？',
	},
	5022: {
		description: 'サバイバルモードで、最高収入が10000に達する',
		name: '金は尽きても、また巡り来るもの。',
	},
	5023: {
		description: 'サバイバルモードで、最高収入が30000に達する',
		name: '魔理沙をも凌ぐ裕福',
	},
	5024: {
		description: 'サバイバルモードで、最高収入が60000に達する',
		name: '八雲グループを買収できるほどの資産',
	},
	5025: {
		description: 'サバイバルモードで、香霖堂で合計20000円消費する',
		name: '香霖堂のスーパーVIP',
	},
	5026: {
		description: 'サバイバルモードで、所持率が100%に達する',
		name: 'コンプ勢',
	},
	5027: {
		description: 'サバイバルモードで、20ラウンドのクリア条件を達成する',
		name: '勝利の法則は決まった！',
	},
	5028: {
		description: '全てのサバイバルモード実績を達成',
		name: 'サバイバルモードを制覇した証',
	},
	5029: {
		description: 'サバイバルモードで、「異変乱流」を1回解決した',
		name: '巫女代理',
	},
	5030: {
		description:
			'サバイバルモードで、幽々子の幻影を満腹にさせることなく、異変乱流「墨染めの桜」を解決する。',
		name: '悪属性効果抜群',
	},
	5031: {
		description:
			'サバイバルモードで、 幽々子の幻影を満腹にさせることで異変乱流「墨染めの桜」を解決する',
		name: '終わった…もう一度…',
	},
	5032: {
		description:
			'サバイバルモードで、カード「ハノイの塔の積石」の数が９に達する',
		name: '石業石得',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
