import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const BADGE_LOCALIZATION_KO = {
	1000: {
		description: '토테츠 유마에게 재도전하고 승리하여 획득하였습니다!',
		name: '피연못지옥의 제패자',
	},
	2000: {
		description:
			'코메이지 코이시의 괴식 요리 대회를 Easy 난이도로 클리어 시 획득',
		name: '괴식 대회 제패의 증명-이지',
	},
	2001: {
		description:
			'코메이지 코이시의 괴식 요리 대회를 Normal 난이도로 클리어 시 획득',
		name: '괴식 대회 제패의 증명-노말',
	},
	2002: {
		description:
			'코메이지 코이시의 괴식 요리 대회를 Hard 난이도로 클리어 시 획득',
		name: '괴식 대회 제패의 증명-하드',
	},
	2003: {
		description:
			'코메이지 코이시의 괴식 요리 대회를 Lunatic 난이도로 클리어 시 획득',
		name: '괴식 대회 제패의 증명-루나틱',
	},
	2500: {
		description:
			'「요괴 짐승길」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '원시와 야성의 훈장 ~ 실버',
	},
	2501: {
		description:
			'「요괴 짐승길」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '원시와 야성의 훈장 ~ 골드',
	},
	2502: {
		description:
			'「인간 마을」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '우순과 풍조의 훈장 ~ 실버',
	},
	2503: {
		description:
			'「인간 마을」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '우순과 풍조의 훈장 ~ 골드',
	},
	2504: {
		description:
			'「하쿠레이 신사」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '고독과 절제의 훈장 ~ 실버',
	},
	2505: {
		description:
			'「하쿠레이 신사」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '고독과 절제의 훈장 ~ 골드',
	},
	2506: {
		description:
			'「홍마관」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '마법과 저주의 훈장 ~ 실버',
	},
	2507: {
		description:
			'「홍마관」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '마법과 저주의 훈장 ~ 골드',
	},
	2508: {
		description:
			'「미혹의 죽림」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '영원과 찰나의 훈장 ~ 실버',
	},
	2509: {
		description:
			'「미혹의 죽림」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '영원과 찰나의 훈장 ~ 골드',
	},
	2510: {
		description:
			'「백옥루」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '만개와 낙화의 훈장 ~ 실버',
	},
	2511: {
		description:
			'「백옥루」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '만개와 낙화의 훈장 ~ 골드',
	},
	2512: {
		description:
			'「조수기악」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '시작과 종결의 훈장 ~ 실버',
	},
	2513: {
		description:
			'「조수기악」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '시작과 종결의 훈장 ~ 골드',
	},
	2514: {
		description:
			'「마법의 숲」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '심록과 반향의 훈장 ~ 실버',
	},
	2515: {
		description:
			'「마법의 숲」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '심록과 반향의 훈장 ~ 골드',
	},
	2516: {
		description:
			'「요괴의 산」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '풍요와 적막의 훈장 ~ 실버',
	},
	2517: {
		description:
			'「요괴의 산」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '풍요와 적막의 훈장 ~ 골드',
	},
	2518: {
		description:
			'「피연못 지옥」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '병탄과 파멸의 훈장 ~ 실버',
	},
	2519: {
		description:
			'「피연못 지옥」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '병탄과 파멸의 훈장 ~ 골드',
	},
	2520: {
		description:
			'「옛 지옥」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '작열과 분란의 훈장 ~ 실버',
	},
	2521: {
		description:
			'「옛 지옥」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '작열과 분란의 훈장 ~ 골드',
	},
	2522: {
		description:
			'「지령전」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '고요와 편애의 훈장 ~ 실버',
	},
	2523: {
		description:
			'「지령전」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '고요와 편애의 훈장 ~ 골드',
	},
	2524: {
		description:
			'「괴식 요리 대회」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '괴상와 이치의 훈장 ~ 실버',
	},
	2525: {
		description:
			'「괴식 요리 대회」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '괴리와 이치의 훈장 ~ 골드',
	},
	2526: {
		description: '모든 곡을 클리어 시 획득',
		name: '음악 애호가의 훈장',
	},
	2527: {
		description:
			'「예대제」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '하쿠레이 예대제 훈장 ~ 실버',
	},
	2528: {
		description:
			'「예대제」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '하쿠레이 예대제 훈장 ~ 골드',
	},
	2529: {
		description:
			'「명련사」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '정적과 주야의 훈장 ~ 실버',
	},
	2530: {
		description:
			'「명련사」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '정적과 주야의 훈장 ~ 골드',
	},
	2531: {
		description:
			'「신령묘」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '음양과 조화의 훈장 ~ 실버',
	},
	2532: {
		description:
			'「신령묘」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '음양과 조화의 훈장 ~ 골드',
	},
	2533: {
		description:
			'「태양의 꽃밭」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '바람과 향기의 훈장 ~ 실버',
	},
	2534: {
		description:
			'「태양의 꽃밭」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '바람과 향기의 훈장 ~ 골드',
	},
	2535: {
		description:
			'「휘침성」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '옛 꿈과 생존의 훈장 ~ 실버',
	},
	2536: {
		description:
			'「휘침성」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '옛 꿈과 생존의 훈장 ~ 골드',
	},
	2537: {
		description:
			'「홍마관 귀신잡기」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '유폐와 금기의 훈장 ~ 실버',
	},
	2538: {
		description:
			'「홍마관 귀신잡기」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '유폐와 금기의 훈장 ~ 골드',
	},
	2539: {
		description:
			'「달의 도시」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '진척과 수구의 훈장 ~ 실버',
	},
	2540: {
		description:
			'「달의 도시」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '진척과 수구의 훈장 ~ 골드',
	},
	2541: {
		description:
			'「마계」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '몽환과 다과의 훈장 ~ 실버',
	},
	2542: {
		description:
			'「마계」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '몽환과 다과의 훈장 ~ 골드',
	},
	2543: {
		description:
			'「천라지망」 챕터의 모든 노래를 「보통」 난이도에서 A랭크를 달성할 시 획득',
		name: '곤궁과 분투의 훈장 ~ 실버',
	},
	2544: {
		description:
			'「천라지망」 챕터의 모든 노래를 「어려움」 난이도에서 A랭크를 달성할 시 획득',
		name: '곤궁과 분투의 훈장 ~ 골드',
	},
	3000: {
		description: '하쿠레이 예대제 참가 · 신령묘 요리 대항전 우승 기념',
		name: '하쿠레이 예대제 요리 대항전 배지',
	},
	3001: {
		description: '하쿠레이 예대제 참가 · 명련사 록 대항전 우승 기념',
		name: '하쿠레이 예대제 록 대항전 배지',
	},
	4000: {
		description:
			'플랑드르의 홍마관 귀신잡기를 Easy 난이도로 클리어 시 획득',
		name: '악마 여동생 제패의 증명-이지',
	},
	4001: {
		description:
			'플랑드르의 홍마관 귀신잡기를 Normal 난이도로 클리어 시 획득',
		name: '악마 여동생 제패의 증명-노말',
	},
	4002: {
		description:
			'플랑드르의 홍마관 귀신잡기를 Hard 난이도로 클리어 시 획득',
		name: '악마 여동생 제패의 증명-하드',
	},
	4003: {
		description:
			'플랑드르의 홍마관 귀신잡기를 Lunatic 난이도로 클리어 시 획득',
		name: '악마 여동생 제패의 증명-루나틱',
	},
	5000: {
		description: '신키로부터 창조주의 상자를 받을 시 획득',
		name: '창조와 무한의 증명',
	},
	5001: {
		description: '반옥왕 미야데구치 미즈치를 포획할 시 획득',
		name: '반옥왕 포획의 증명-이지',
	},
	5002: {
		description:
			'달의 도시 시뮬레이터를 통해 저주를 하나 이상 활성화한 상태에서 반옥왕 미야데구치 미즈치를 포획할 시 획득',
		name: '반옥왕 포획의 증명-노말',
	},
	5003: {
		description:
			'달의 도시 시뮬레이터를 통해 저주를 두 개 이상 활성화한 상태에서 반옥왕 미야데구치 미즈치를 포획할 시 획득',
		name: '반옥왕 포획의 증명-하드',
	},
	5004: {
		description:
			'달의 도시 시뮬레이터를 통해 저주를 세 개 이상 활성화한 상태에서 반옥왕 미야데구치 미즈치를 포획할 시 획득',
		name: '반옥왕 포획의 증명-루나틱',
	},
	5005: {
		description: '달의 도시 단말기를 통해 서바이벌 모드 첫 진입 시 획득',
		name: '죄다 로그라이크 모드가 나오네?',
	},
	5006: {
		description: '미케의 영업 카드를 처음으로 활성화 시 획득',
		name: '선택이야말로 로그라이크의 정수',
	},
	5007: {
		description:
			'서바이벌 모드에서 한 번의 야간 영업동안 미케의 영업 카드 누적 18장 활성화',
		name: '당신이 몰랐던 카드 암시장',
	},
	5008: {
		description: '서바이벌 모드에서 미케의 영업 카드 누적 100장 획득',
		name: '미스치 & 카이룰라 환상향',
	},
	5009: {
		description:
			'서바이벌 모드에서 한 번의 야간 영업동안 "만물의 풍요", "삼두견 포획 함정", "삼도천 규키 어시장", "비보 탐색기"를 전부 활성화',
		name: '맛도 영양도 최고라고',
	},
	5010: {
		description:
			'서바이벌 모드에서 "백발백중" 카드를 이용해 "아카츠키/보름전야/불쥐의 웃옷" 중 하나를 획득',
		name: '완전한 황금의 회전!',
	},
	5011: {
		description: '미케의 전역 카드를 처음으로 활성화 시 획득',
		name: '대길 키튼식 고양이 돈받기',
	},
	5012: {
		description: '서바이벌 모드에서 누적 9개의 서로 다른 전역 카드를 획득',
		name: '버프칸이 무너지질 않아',
	},
	5013: {
		description: '서바이벌 모드에서 누적 24개의 서로 다른 전역 카드를 획득',
		name: '귀중품도 보물도 집안 가득',
	},
	5014: {
		description:
			'서바이벌 모드에서 "오니와타리 시련" 카드를 사용하고 시련에 통과',
		name: '새대가리 지옥의 시련',
	},
	5015: {
		description: '서바이벌 모드에서 행동력 5 달성',
		name: '여기 저기로 신기한 에브리웨어',
	},
	5016: {
		description: '서바이벌 모드에서 향림당 할인율 90% 달성',
		name: '일원의 행복',
	},
	5017: {
		description:
			'서바이벌 모드에서 향림당에서 판매하는 재료의 수량이 300% 이상일 때 전부 구매',
		name: '곡식의 지배자',
	},
	5018: {
		description:
			'서바이벌 모드에서 요괴 짐승길, 인간 마을, 하쿠레이 신사, 홍마관, 미혹의 죽림 가게를 전부 3등급 이상으로 만든 뒤 각각 한 번 이상 영업',
		name: '전국 순회 공연',
	},
	5019: {
		description:
			'서바이벌 모드에서 다섯 개의 "위험 카드"를 전부 한 번 이상 획득',
		name: '윤회의 종점',
	},
	5020: {
		description:
			'서바이벌 모드에서 수입의 110%를 넘기지 않고 임의의 영업 완료',
		name: '필사적인 그레이즈',
	},
	5021: {
		description: '서바이벌 모드에서 메뉴 80종류 획득',
		name: '기억의 끝맺음?',
	},
	5022: {
		description: '서바이벌 모드에서 최고 수익 10,000 도달',
		name: '천금이 바닥나더라도 다시 모이리',
	},
	5023: {
		description: '서바이벌 모드에서 최고 수익 30,000 도달',
		name: '대부호 마리사',
	},
	5024: {
		description: '서바이벌 모드에서 최고 수익 60,000 도달',
		name: '야쿠모 가 파산시키기',
	},
	5025: {
		description:
			'서바이벌 모드에서, 향림당에서 사용한 누적 금액 20,000 달성',
		name: '향림당 지존 VIP 고객',
	},
	5026: { description: '서바이벌 모드에서 수집률 100% 달성', name: '수집광' },
	5027: {
		description: '서바이벌 모드에서 20웨이브 클리어',
		name: '확정된 승리의 법칙',
	},
	5028: {
		description: '모든 서바이벌 모드 업적 완료',
		name: '서바이벌 제패의 증명',
	},
	5029: {
		description: '서바이벌 모드에서 "이변의 난류" 1회 해결',
		name: '대리 무녀',
	},
	5030: {
		description:
			'서바이벌 모드에서 유유코의 환상을 만족시키지 않고 “이변의 난류 「묵염의 벚꽃」” 해결',
		name: '악 속성 최고잖아',
	},
	5031: {
		description:
			'서바이벌 모드에서 “이변의 난류 「묵염의 벚꽃」” 도중 유유코의 환상을 만족시키기',
		name: '다시…해치웠나…',
	},
	5032: {
		description: '서바이벌 모드에서 스펠 카드 「하노이의 탑」 9개 도달',
		name: '애완 돌멩이',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
