import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const BADGE_LOCALIZATION_ZH_TW = {
	1000: {
		description: '再次前往血池地獄挑戰饕餮尤魔勝利後獲得',
		name: '地獄大胃王制霸的證明',
	},
	2000: {
		description:
			'通過古明地覺的回憶重戰怪誕料理賽並且在Easy或更高難度下取勝時獲得',
		name: '怪誕妖怪制霸的證明-簡單',
	},
	2001: {
		description:
			'通過古明地覺的回憶重戰怪誕料理賽並且在Normal或更高難度下取勝時獲得',
		name: '怪誕妖怪制霸的證明-普通',
	},
	2002: {
		description:
			'通過古明地覺的回憶重戰怪誕料理賽並且在Hard或更高難度下取勝時獲得',
		name: '怪誕妖怪制霸的證明-高級',
	},
	2003: {
		description:
			'通過古明地覺的回憶重戰怪誕料理賽並且在Lunatic難度下取勝時獲得',
		name: '怪誕妖怪制霸的證明-瘋狂',
	},
	2500: {
		description:
			'「妖怪獸道」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '原始與野性徽章 ~ 銀',
	},
	2501: {
		description:
			'「妖怪獸道」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '原始與野性徽章 ~ 金',
	},
	2502: {
		description:
			'「人間之里」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '雨順與風調徽章 ~ 銀',
	},
	2503: {
		description:
			'「人間之里」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '雨順與風調徽章 ~ 金',
	},
	2504: {
		description:
			'「博麗神社」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '孤獨與節制徽章 ~ 銀',
	},
	2505: {
		description:
			'「博麗神社」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '孤獨與節制徽章 ~ 金',
	},
	2506: {
		description:
			'「紅魔館」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '魔法與詛咒徽章 ~ 銀',
	},
	2507: {
		description:
			'「紅魔館」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '魔法與詛咒徽章 ~ 金',
	},
	2508: {
		description:
			'「迷途竹林」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '終古與剎那徽章 ~ 銀',
	},
	2509: {
		description:
			'「迷途竹林」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '終古與剎那徽章 ~ 金',
	},
	2510: {
		description:
			'「白玉樓」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '櫻開與櫻落徽章 ~ 銀',
	},
	2511: {
		description:
			'「白玉樓」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '櫻開與櫻落徽章 ~ 金',
	},
	2512: {
		description:
			'「鳥獸伎樂」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '開端與結局徽章 ~ 銀',
	},
	2513: {
		description:
			'「鳥獸伎樂」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '開端與結局徽章 ~ 金',
	},
	2514: {
		description:
			'「魔法森林」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '幽深與迴響徽章 ~ 銀',
	},
	2515: {
		description:
			'「魔法森林」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '幽深與迴響徽章 ~ 金',
	},
	2516: {
		description:
			'「妖怪之山」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '豐收與寂寥徽章 ~ 銀',
	},
	2517: {
		description:
			'「妖怪之山」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '豐收與寂寥徽章 ~ 金',
	},
	2518: {
		description:
			'「血池地獄」章節曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '吞噬與破滅徽章 ~ 銀',
	},
	2519: {
		description:
			'「血池地獄」章節曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '吞噬與破滅徽章 ~ 金',
	},
	2520: {
		description:
			'「舊地獄」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '灼熱與躁動徽章 ~ 銀',
	},
	2521: {
		description:
			'「舊地獄」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '灼熱與躁動徽章 ~ 金',
	},
	2522: {
		description:
			'「地靈殿」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '寂寥與偏愛徽章 ~ 銀',
	},
	2523: {
		description:
			'「地靈殿」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '寂寥與偏愛徽章 ~ 金',
	},
	2524: {
		description:
			'「怪誕料理大賽」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '怪誕與常理徽章 ~ 銀',
	},
	2525: {
		description:
			'「怪誕料理大賽」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '怪誕與常理徽章 ~ 金',
	},
	2526: {
		description: '完成「愛樂者的挑戰賽」劇情後獲得的獎勵',
		name: '愛樂徽章',
	},
	2527: {
		description:
			'「博麗大祭」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '博麗神社大祭徽章 ~ 銀',
	},
	2528: {
		description:
			'「博麗大祭」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '博麗神社大祭徽章 ~ 金',
	},
	2529: {
		description:
			'「命蓮寺」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '靜寂與晨暮徽章 ~ 銀',
	},
	2530: {
		description:
			'「命蓮寺」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '靜寂與晨暮徽章 ~ 金',
	},
	2531: {
		description:
			'「神靈廟大賽」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '陰陽與協調徽章 ~ 銀',
	},
	2532: {
		description:
			'「神靈廟大賽」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '陰陽與協調徽章 ~ 金',
	},
	2533: {
		description:
			'「太陽花田」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '風靈與芳華徽章 ~ 銀',
	},
	2534: {
		description:
			'「太陽花田」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '風靈與芳華徽章 ~ 金',
	},
	2535: {
		description:
			'「輝針城」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '朽夢與孑遺徽章 ~ 銀',
	},
	2536: {
		description:
			'「輝針城」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '朽夢與孑遺徽章 ~ 金',
	},
	2537: {
		description:
			'「紅魔館的抓鬼遊戲」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '幽閉與禁忌徽章 ~ 銀',
	},
	2538: {
		description:
			'「紅魔館的抓鬼遊戲」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '幽閉與禁忌徽章 ~ 金',
	},
	2539: {
		description:
			'「月之都」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '奮進與守舊徽章 ~ 銀',
	},
	2540: {
		description:
			'「月之都」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '奮進與守舊徽章 ~ 金',
	},
	2541: {
		description:
			'「魔界」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '夢幻與茶會徽章 ~ 銀',
	},
	2542: {
		description:
			'「魔界」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '夢幻與茶會徽章 ~ 金',
	},
	2543: {
		description:
			'「天羅地網」章節所有曲目在「普通」難度下達成A及以上評價後獲得的獎勵',
		name: '困獸與搏鬥徽章 ~ 銀',
	},
	2544: {
		description:
			'「天羅地網」章節所有曲目在「困難」難度下達成A及以上評價後獲得的獎勵',
		name: '困獸與搏鬥徽章 ~ 金',
	},
	3000: {
		description: '參與博麗大祭對抗賽·神靈廟料理賽場獲勝紀念',
		name: '博麗大祭料理賽徽章',
	},
	3001: {
		description: '參與博麗大祭對抗賽·命蓮寺搖滾賽場獲勝紀念',
		name: '博麗大祭搖滾賽徽章',
	},
	4000: {
		description: '在紅魔館的抓鬼遊戲中擊敗全部的芙蘭朵露分身後獲得',
		name: '惡魔之妹制霸的證明-簡單',
	},
	4001: {
		description:
			'再次前往紅魔館地下室，並在Normal或更高難度下的抓鬼遊戲中擊敗全部的芙蘭朵露分身後獲得',
		name: '惡魔之妹制霸的證明-普通',
	},
	4002: {
		description:
			'再次前往紅魔館地下室，並在Hard或更高難度下的抓鬼遊戲中擊敗全部的芙蘭朵露分身後獲得',
		name: '惡魔之妹制霸的證明-困難',
	},
	4003: {
		description:
			'再次前往紅魔館地下室，並在Lunatic難度下的抓鬼遊戲中擊敗全部的芙蘭朵露分身後獲得',
		name: '惡魔之妹制霸的證明-瘋狂',
	},
	5000: {
		description: '獲得神綺的造物者之盒後的獎勵',
		name: '創造與無限的證明',
	},
	5001: {
		description: '在劇情中捕獲反獄王宮出口瑞靈後獲得',
		name: '捕獲反獄王的證明·簡單',
	},
	5002: {
		description:
			'通過月都終端模擬，在至少激活了一個惡咒的情況下捕獲反獄王宮出口瑞靈後獲得',
		name: '捕獲反獄王的證明·普通',
	},
	5003: {
		description:
			'通過月都終端模擬，在至少激活了兩個惡咒的情況下捕獲反獄王宮出口瑞靈後獲得',
		name: '捕獲反獄王的證明·困難',
	},
	5004: {
		description:
			'通過月都終端模擬，在激活三個惡咒的情況下捕獲反獄王宮出口瑞靈後獲得',
		name: '捕獲反獄王的證明·瘋狂',
	},
	5005: {
		description: '通過月都終端模擬，進入生存模式',
		name: '萬物皆可肉鴿？',
	},
	5006: {
		description: '生存模式中，首次激活三花的營業卡牌',
		name: '肉鴿的靈魂在於選擇',
	},
	5007: {
		description: '生存模式中，在一場夜間營業裏累計激活18次三花的營業卡牌',
		name: '你所不知道的卡牌黑市',
	},
	5008: {
		description: '生存模式中，累計抽取100張三花的營業卡牌',
		name: '強欲之夜雀',
	},
	5009: {
		description:
			'生存模式中，在一場夜間營業裏激活了「萬物豐穰」、「三頭犬捕獸夾」、「三途川牛鬼魚市」、「秘寶探測器」四種類型的卡牌',
		name: '魚肉菜蛋，營養管飽',
	},
	5010: {
		description:
			'生存模式中，使用卡牌「怒押必中」以最高條件獲得以下之一的酒水返還：曉/十四夜/火鼠裘',
		name: '完美的黃金迴旋！',
	},
	5011: {
		description: '生存模式中，首次激活三花的全局卡牌',
		name: '大吉貓咪的聚寶功',
	},
	5012: {
		description: '生存模式中，累計收集9種不同的全局卡牌',
		name: 'Buff欄要塞不下了！',
	},
	5013: {
		description: '生存模式中，累計收集24種不同的全局卡牌',
		name: '寶貨盈門，金卡滿堂',
	},
	5014: {
		description: '生存模式中，使用卡牌「鬼渡試煉」並成功完成一次試煉',
		name: '鳥腦袋的地獄試煉官',
	},
	5015: {
		description: '生存模式中，行動力達到5',
		name: '一個筋斗，這頭到那頭',
	},
	5016: { description: '生存模式中，香霖堂折扣率達到90%', name: '一元購' },
	5017: {
		description:
			'生存模式中，香霖堂出售材料數不少於300%的情況下買空香霖堂的食材頁面',
		name: '糧糧糧糧糧草徵收人',
	},
	5018: {
		description:
			'生存模式中，妖怪獸道、人間之里、博麗神社、紅魔館、迷途竹林的雀食堂等級都達到3級且至少開過一次店',
		name: '風風火火闖九州',
	},
	5019: {
		description: '生存模式中，五種"危險卡牌"都抽取過至少一次',
		name: '輪迴·終末',
	},
	5020: {
		description:
			'生存模式中，任意一次營業在不超過營業額的110%的情況下極限過關',
		name: '擦彈與決死',
	},
	5021: { description: '生存模式中，獲得80種菜譜', name: '記憶開始收束？' },
	5022: {
		description: '生存模式中，最高收入達到10000',
		name: '千金散盡還復來',
	},
	5023: {
		description: '生存模式中，最高收入達到30000',
		name: '富可敵魔理沙',
	},
	5024: {
		description: '生存模式中，最高收入達到60000',
		name: '能收購八雲錢莊程度的資產',
	},
	5025: {
		description: '生存模式中，累計在香霖堂消費20000',
		name: '香霖堂至尊VIP客户',
	},
	5026: { description: '生存模式中，收集率達到100%', name: '收集狂' },
	5027: {
		description: '生存模式中，完成20波次通關要求',
		name: '勝利的法則已然確定',
	},
	5028: { description: '完成全部的生存模式成就', name: '生存模式制霸的證明' },
	5029: { description: '生存模式中，解決1次“異變亂流”', name: '代理巫女' },
	5030: {
		description:
			'生存模式中，不通過餵飽幽幽子幻象的方式解決“異變亂流「墨染之櫻」”',
		name: '惡屬性效果絕佳',
	},
	5031: {
		description: '生存模式中，在“異變亂流「墨染之櫻」”中餵飽幽幽子幻象',
		name: '結束了…再一次…',
	},
	5032: {
		description: '生存模式中，卡牌「漢諾塔壘石」數量達到9',
		name: '實石求石',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
