import type { ILocalizedGuestText } from '@/domain/data/localization/types';

export const NORMAL_GUEST_LOCALIZATION_JA = {
	0: {
		chat: [
			'健康に気をつかえば長生きできるウサ！妖怪兎の知恵袋ウサ！',
			'私達のボスに出会えたら幸運を得られるウサ！でももしここにいたら……',
			'竹林はとっても綺麗で筍もあるウサ！でも余所者は立入禁止ウサ！',
			'満月のときヘンになる人もいるけど……私達は関係ないウサ！',
			'うどん……？親近感のわく言葉ウサ！きっとおいしいウサ！',
		],
		description:
			'ウサギは妖怪になっても、甘くて新鮮な味が好きのようで、本当にかわいいね。でも、妖怪になったからには、肉を食べないわけにはいかない。その肉を食べている様子もまたかわいいね。',
		name: '妖怪ウサギ',
	},
	1: {
		chat: [
			'猫の舌は敏感だから、もっと新鮮な食材を仕入れてほしいね',
			'夜にこんなに大きな赤ちょうちんなんて、初見はビックリしちゃうな',
			'猫に九生ありなんて言う人、絶対猫嫌いでしょ！',
			'妖獣は尻尾が多いほど強いらしいけど、普通の妖怪猫は二本だね',
			'水に濡れるのって気持ち悪いし、雨の日は家で寝るのが一番だね',
		],
		description:
			'化け猫の特徴は2本に枝分かれした尻尾であり、妖力が強いほど、その尻尾の数もより増えるという。外見はかわいいけど、性格が凶暴である。幻想郷ではノラネコまでも舌が肥えているね。',
		name: '妖怪ネコ',
	},
	2: {
		chat: [
			'今日出逢ったあの巫女、怖かったな……',
			'そんなに見られると酒がマズくなっちゃうよ',
			'……わかってるって！葉っぱでお勘定しないって！',
			'親分がまた付喪神を引き入れたらしいね。これでもっと強くなるぞ！',
			'月が綺麗でしょう？でも、はたしてあの月は本物かな？',
		],
		description:
			'怒りっぽくて、いつも海千山千のフリをしていて、実はまともな特技など何もないのだろう。しかし、彼らは変化の術が上手だそうで、葉っぱで会計されることがないように、警戒を強めた方がよい。',
		name: '妖怪タヌキ',
	},
	3: {
		chat: [
			'イマドキの居酒屋がどんなんか見せてもらおうか',
			'年長者は労るもんだよ、こっちはアンタが食べた米よりPアイテム落としてんだから',
			'若者は水割りなんか飲みたがるけど……あんなんダメだね',
			'高級な食材を使えば高級な料理ができる。覚えておきなよ！',
			'読書はするもんだよ……天狗の新聞もたまには役立つ記事があるからね',
		],
		description:
			'いつも長老みたいな口調で話していて、年寄り風を吹かせている印象がする。長生きしただけに、たまには何かと役に立つありがたい言葉も出る。',
		name: '妖怪キツネ',
	},
	4: {
		chat: [
			'妖獣ならやっぱり肉を食べないとね！',
			'あの夜雀もなかなか……ってアレは食べ物じゃないのか',
			'獣道を避ける人間は多いけど、いいものもいっぱいあるよ',
			'この店は結構長くやってる割に、随分さびれてるなあ',
			'獣道の猪でなにか作ったら、きっとおいしいだろうな',
		],
		description:
			'古の凶獣が現れた……と思ったら、ただの食いしん坊妖怪のようである。食事量が多くて、それに食へのこだわりが非常に多い。',
		name: '妖怪オロチ',
	},
	5: {
		chat: [
			'よーし、おこづかい使っちゃうぞ〜！',
			'授業めんどくさいなぁ…サボっても慧音せんせーにバレないかな？',
			'慧音せんせーの授業つまんなーい！阿求ねえちゃんにやらせた方が面白いんじゃないの？',
			'子どもにだってジュース飲まなきゃやってられないときがあるのさ！',
			'このまえ自分の身長くらいのヒマワリを妖精から取り上げたけど、よく持ってこれたよね',
		],
		description:
			'いつも騒いでいる人間のチビガキ、昔ならこんな奴なんて……それでも今は彼らと顔見知りになって、たまにその笑顔で一日の疲れを癒されることもある。なんと不思議なことだろう。',
		name: '人間の子供',
	},
	6: {
		chat: [
			'一日の疲れにこの一杯！',
			'いい匂いだなぁ。お腹ペコペコだよ。',
			'娘が香霖堂で……すまほ？を買ってきたよ。現代っ子だなぁ',
			'上司に叱られちゃってさ…飲まなきゃやってらんないよ！',
			'マスター！なんで焼鳥は置いてねぇんだ！？…って、そんな目で見ないでくれよ',
		],
		description:
			'偉い人には見えないが、いつも偉そうに独り言を言っている。特に酒を飲むと愚痴っぽくなってしまう。しかし人間という種族の中では体格が一番大きく、いつも家族から頼られる存在だと言われている。',
		name: '人間の男性',
	},
	7: {
		chat: [
			'春を告げる妖精に会うと幸せになれるらしいのよ。いつか見てみたいわね',
			'お隣さんったらお裁縫がうまいのよ。いろんな柄の服が作れて羨ましいわ',
			'ウチの息子なんて先日妖精を捕まえてきたのよ。大事にならなくてよかったわ',
			'他人の作ったごはんを食べるのってシアワセよね〜',
			'男衆が飲んでるお酒よりも、度数が低めの方が私は好みね',
		],
		description:
			'集まれば永遠にお喋りが続きそうだが、その中身のほとんどは些細なことか、互いのファッションを褒め合うことである。たまには料理についてのコツが聞こえるから良いけど。',
		name: '人間の女性',
	},
	8: {
		chat: [
			'今日はいい天気だねぇ…一時期は霧に地震に雹と大変だったけどねぇ',
			'この歳になると魔法の森には住めないねぇ…湿気で関節痛がねぇ…',
			'長く生きてりゃ色々見れるねぇ。梅と桜が夏に咲いたりね。ありゃ良かったよ。',
			'こんな所で生きてくなら、頑固にならずに何よりも時代に適応するコトだねぇ',
			'今年の四季は珍しくいつも通りだねぇ',
		],
		description:
			'人間の長老といってもせいぜい数十年しか生きておらず、私たち妖怪からすればただの若造だろう。でも、たまに仙人じみたオーラを持っているような奴もいる……時には年寄りの話を聞くのも悪くはないだろう。',
		name: '人間の老人',
	},
	9: {
		chat: [
			'至高のメニューは市井の中にも隠れている。それが私がここに来た理由。',
			'真心を込めれば上等な料理になる……とはいうが、私はやはり高級なものが好みだな。',
			'女将の歌は紛れもなく本物だ。大自然の調律を奏でる、正に天籟の音といえよう',
			'音律と料理がどう関わるか、と？……ハッハ、それこそが自然の奥深さよ…',
		],
		description:
			'人間の中で有名な食いしん坊だそうで、珍味を探すために村を離れて旅することもいとわない……よくこれまで生き伸びてこれたね、この私が君の胃袋を満足させるよ〜',
		name: 'ごろう',
	},
	10: {
		chat: [
			'わらしって言うけど、もう子どもじゃないもん！',
			'座敷わらしにも世間を見て回りたいってときがあるのよ〜',
			'座敷わらしは地縛霊と違って、一箇所から動けないわけじゃないのよ',
			'くっ……それっぽく常連感を出さなきゃ……',
			'外出できないどころか、外の世界に行ったことだって…ってこれは言っちゃダメだった！',
		],
		description:
			'ずっと地縛霊の一種だと思っていたので、来店した時には驚いた。何かに憑依すればどこでも行けるそうだ。そういえば、座敷童子が店に幸運をもたらすとも言うし、こちらの噂は真実であってほしいなぁ〜',
		name: '座敷わらし',
	},
	11: {
		chat: [
			'お、こんな店があるのか',
			'慣れない料理をムリに作ってもロクなことにならないし、やっぱり段階を踏んでくべきだね',
			'霧の湖がなんだか騒がしいね。また妖精がやらかしたのかな？',
			'幻想郷では東洋派？それとも西洋派？どっちにしろもう片方に嫌われるけどね',
			'香霖堂には掘り出し物が多いけど、実用性ならこっちが一枚上手だね',
		],
		description:
			'河童は泳ぎが得意というが、幻想郷の河童は商売も上手であり、この私の大先輩だと言っても過言ではない。悠々自適にそろばんをパチパチ弾くその姿に、目が離せなくなることもあるよね〜',
		name: '河童',
	},
	12: {
		chat: [
			'もう長いこと幻想郷にいるけど、外出するとやっぱり睨まれるな',
			'人間ってのは、すぐ見かけで判断するな！',
			'洋館で楽な生活ができると思ったら、まさかこんなに重労働だとは…',
			'見かけは多少悪くても、仕事はできるんだぜ',
			'外見が整ってても、それでメシが食えるワケじゃねぇしな',
		],
		description:
			'少し困ったお客さんである。性格は落ち着いているが、見た目のせいか一部人間のお客さんを驚かせてしまう。他の妖怪なら相席でも大丈夫なのに、なぜかしら……',
		name: 'ホフゴブリン',
	},
	13: {
		chat: [
			'秋になったら妖怪の山の紅葉が綺麗だよ',
			'変なウワサも多いけど……博麗の巫女のことは尊敬してるよ',
			'料理して手土産にするのが好きなんだけど、女将の方が得意そうだね',
			'謎の洋館？北にも西にもあるけど。だって幻想郷だし',
			'ちゃんと客の要求さえ満たしてれば、難癖つけられることはないよ',
		],
		description:
			'話し方が上品で礼儀正しいが、なんか押しが強いような気がする。度々外勤に出る鴉天狗っていう種族は、やっぱり苦手だね。でも客は客、どんな相手でも頑張ってもてなすよ！',
		name: '鴉天狗',
	},
	14: {
		chat: [
			'妖精だから何も食べなくてもいいんだけど〜…おじゃましま〜す！',
			'安心して〜！イタズラは大好きだけど、あんなのがある店ではやらないわよ〜',
			'あんなのってどんなのかって〜？アレよ〜…あの独特なセンスのお札…',
			'妖精と妖怪の違い〜？ズバリ、カワイイ方が私達よ〜！',
			'霧の湖に新人さんが来たの！妖怪なのに怪しい道具で何かしてるのよ〜',
		],
		description:
			'実は妖精は食事をする必要がない。人間が美味しいものを食べる様子を見て、まねをしているだけである。騒ぎが好きでイタズラも好きな彼女たちにだまされるなよ！',
		name: '妖精',
	},
	1000: {
		chat: [
			'私たち下っ端は山で基本的な仕事しかできません。',
			'鬼がまた幻想郷に現れましたか？鬼の復権はないでしょうか？',
			'こんなところに店を開くなんて、仕事を増やしてくれますね。',
			'上位天狗は私たちよりずっと強いのに、護衛の意味とはいったい？',
		],
		description:
			'天狗の社会には厳密な等級制度があり、山の警備は基本的に白狼天狗が担当している。職業柄か、彼女らの多くはまじめな性格だが、酒が入ったらそうでもないようだ。',
		name: '白狼天狗',
	},
	1001: {
		chat: [
			'何を見ている！目ん玉を潰すよ！',
			'山姥は集団も組織もなく、単独行動を好む種族だ。',
			'この山は天狗だけのものではない。',
			'世の中に食堂という存在があるなんて、もう飯も作れない時代なのか。',
		],
		description:
			'妖怪の山に住む非常に辺鄙な種族で、同族同士であってもほとんど交流がない。山で迷子になった子供を捕まえる……という噂があるが、それは誤解で、不器用でも実はとても気さくで善良な妖怪だ。',
		name: '山姥',
	},
	1002: {
		chat: [
			'川なんて、私たちはとっくに気にしていない。',
			'サバゲーでお腹すいた！お腹がいっぱいになってからまた戦おう！',
			'川に住む両生類に、山の面白さはわかるまい。',
			'村の経済と山の経済は全く異なるシステムである。',
		],
		description:
			'川を捨てた河童で、妖怪の山の奥に大本営を建てた、山の専門家である！経済面での研究は特に進んでおり、複雑な金融システムを構築しており、私には全く理解できない分野である。',
		name: '山童',
	},
	1003: {
		chat: [
			'魔法は神秘の力だが、本質的には科学です。',
			'付き合いの無い人に挨拶に行くのは、勇気がいりますね。',
			'魔法の研究をするときは一心不乱になるから、大半の魔法使いは邪魔が入らない一人暮らしなんです。',
			'魔法研究はお金がかかります。捨食の魔法をマスターできれば、食費を節約して魔法研究ができます。',
		],
		description:
			'魔法の森には魔法使いの魔力向上に役立つキノコがたくさん生えているので、魔法使いがたくさん住んでいる。彼女たちは一人暮らしが多く、性格がひねくれているようだ。魔法の修行自体が寂しいものなのだろうか。',
		name: '魔法使い',
	},
	1004: {
		chat: [
			'森のダンジョン探索はとっても面白い！……寒がりな妖精の家だけど。',
			'さっき来た道で朝顔の妖怪に取り込まれそうになった、危ない、危ない！',
			'木に生えた妖怪スイカを見たことがある？殴られると本当に痛いよ。',
			'友達が幻覚キノコを食べたら、自分を蟲だって言い出してさ、笑っちゃった！',
		],
		description:
			'妖精が多ければ多いほど、自然が生き生きとする。魔法の森には妖精がたくさん住んでいるので、さまざまな物産が豊富である。どの木にも妖精が宿っているそうだが、妖精のいたずらも多いので気をつけないといけない。',
		name: '森の妖精',
	},
	1005: {
		chat: [
			'森は湿気が多くて、体にカビが生えそうな気がします。',
			'無名の丘にはスズランの花畑があるんです、行ってみたいですね。',
			'人間なんて、うんざりです。',
			'森には物覚えの悪い妖精が多すぎて……一体いつになれば私をおもちゃと間違えなくなるのやら。',
		],
		description:
			'得体の知れない人形。付喪神かどうかはまだわからない。なにしろ森には人形を操る魔法使いが住んでいるのだから……。しかし、この人形はあまり操られているようには見えないので、やはり付喪神ではなかろうか。',
		name: '謎の人形',
	},
	2000: {
		chat: [
			'私もヤマメさんのように人気になりたいなぁ～',
			'こんな明るい洞窟は初めて。',
			'お店に虫が出たら、解決してあげてもいいですよ。',
			'病気は生活の調味料ですよ。',
		],
		description:
			'暗闇の風穴に潜む土蜘蛛。性格は理解しにくいが、建築事業に対する態度は非常に真剣で、仲間の間でも建築学の問題をよく議論している。私が学ぶ価値がありますね。',
		name: '土蜘蛛',
	},
	2001: {
		chat: [
			'飲める場所は多ければ多いほどいい～',
			'地上には今でも鬼退治の専門家はいるのか？',
			'ここの賑わいは旧地獄街道の飲み屋に劣らない。',
			'スズメちゃん——早く酒頂戴——',
		],
		description:
			'大昔から存在する、伝説の幻想郷最強の妖怪種族！実は幻想郷を離れて久しいが、意外にも地底世界に巣食っていた。鬼族は大雑把で獰猛な性格なので、絶対に彼らに嘘をついてはいけませんよ！',
		name: '鬼',
	},
	2002: {
		chat: [
			'橋姫は毎晩藁人形を釘刺しにしてて、とても怖いです。',
			'どんなに美しい外見でも、所詮浮世の絵です。',
			'自分を喜ばせることが一番大切です。',
			'地獄を謳歌すると決めた以上、美味しい料理を食べないと～',
		],
		description:
			'おしゃれ上手なお姉さんたちは、話し方が優しくて大人っぽい。手にはいつもボタンの灯籠をもっており、通りすがりの人間を惑わすことができるという。実際に洞窟で出会うと、前の道を照らしてくれます。',
		name: '骨女',
	},
	2003: {
		chat: [
			'熱地獄を守っていたアイツは三本足になって、あまりにも奇妙に見えた。',
			'ここの商売は地獄のように燃え上っている。',
			'カラスもかつては奉納された神鳥だが、今や不吉の鳥。',
			'鳥頭はいつからバカの代名詞になったのか？',
		],
		description:
			'旧地獄の最奥部に生息していた。旧地獄に住んでいた妖怪のほとんどは、元の居住地が廃墟となったために移り住んだが、地獄鴉はもともとこの地獄に住んでいて、ここで最初の住民だった。',
		name: '地獄鴉',
	},
	2004: {
		chat: [
			'姑獲鳥は子供を連れて行った。夏獲鳥は子供を引き取って行った～',
			'要らない爪は私にあげてね。',
			'姑獲鳥と産女は別の妖怪だよ。',
			'子供の服を外に干すのはシグナルよ。',
		],
		description:
			'伝説では羽を着けると鳥で、羽を脱ぐと少女の妖怪になると言われています。人の爪を集めることで福禍を予知できるため、占い業に従事することが多い。神秘を保つためか、話はいつも五里霧中にしている。',
		name: '姑獲鳥',
	},
	2005: {
		chat: [
			'狩猟は面白いが、たまにはこのように食事をするのもいい。',
			'この店の主人はスズメなのか——',
			'食事になりたくなければ、ちゃんと食事を作ってね～',
			'スズメにどんな料理ができるのだろうか～',
		],
		description:
			'野性的な妖獣。性格はさわやかでわがままだ。種族の天性から、私は彼女たちを少し恐れている……が、ヒョウ自体の実力は強いが、妖怪になれる数はそれほど多くないようだ。',
		name: '女豹',
	},
	3000: {
		chat: [
			'いわゆる「酒肉は体を通り過ぎれど仏は心に留まる」だからね。',
			'昼間の命蓮寺は静かで厳粛だけど、夜になるととても賑やか。',
			'住職さんは定期的に寺で怪談大会を開催してて、すごく刺激的だよ。',
			'仏心で仏法を伝え、その声が雷のごとし。',
		],
		description:
			'人間はあまり知らないかもしれないが、私は知っている…命蓮寺の僧侶はみんな妖怪なんだ。はらみつだかはちみつだかの修行はしてるかもしれないが、どれだけの効果があるのか誰にも分からなくて、修行以外は変わらずやりたいようにやってる妖怪も多いよ。',
		name: '僧侶',
	},
	3001: {
		chat: [
			'村ではネズミの駆除剤がもう普及してて、油断しちゃならないな。',
			'我々のボスは、至る所に宝が埋められてる謎の地に住んでるんだ。',
			'「チーズの穴はネズミたちによるものだ」って噂話は、一体誰がしたんだろう。',
			'この世に我々に見つけられないものはない。',
			'我々が宝だと思っているものは、人間にとってはそうでもないらしい。',
		],
		description:
			'幻想郷の至る所で見られるトレジャーハンター。彼らと良い関係を築けば、物をなくす心配がなくなるだろう。食べ物探しを依頼したら、戻ってくる前に食べ尽くしてしまうかもしれないけど。',
		name: '妖怪ネズミ',
	},
	3002: {
		chat: [
			'妖怪にとって存在感がないのは、人間にとって死病にかかるのと同じよ。',
			'細身のまま身長ばかり伸びていくのもいいとは限らないわね…。',
			'太りたいって言うたびに自慢だと思われてしまって…',
			'この象徴的な衣装を失っても、八尺様って呼ばれるのかしら？',
			'妖怪の改革も難しいものよね。',
		],
		description:
			'身長が8尺ある妖怪。いつもつば広帽子を被っているので肌が白い。昔は白いドレスを着るのが好きだったせいで昼間の存在感が非常に低く、種族全体が空腹で痩せてしまった。今は、一部の向上心のある者がもっと注目を集めやすい服飾を探し始めている。',
		name: '八尺様',
	},
	3003: {
		chat: [
			'寺の聖人様がかつて世界中で有名だった貴人だって噂らしい。',
			'聖人様は今日も私の悩みを聞いてくれて、道筋を示してくれた。',
			'どこかで聖人様のイヤホンを買えないだろうか…？',
			'本当に雑念と欲望を払いきったら仙人になりたくなくなるのかな。',
			'修行は先が長いから、とりあえず腹をごしらえよう！',
		],
		description:
			'神霊廟には、仙術を学ぶために神子に弟子入りしている人が多い。雑用にこき使われてるだけらしいんだけどね。いつもやる気満々みたいだが…雑用にも楽しいところがあるのかもしれないな。',
		name: '道士',
	},
	3004: {
		chat: [
			'皿を……食べるな……',
			'腐っちゃう……',
			'ご飯をちゃんと食べないと育たなくなるって……誰かに言われた気が……',
			'思い出せない……',
			'皿の上のもの以外は食べるなって……覚えておいて……',
		],
		description:
			'邪仙に操られているゾンビ。死体だが腐らずに、生前より強い力を持っている。頭があまり良くないのでコミュニケーションを取りにくいが、好き嫌いしないのは良いところ。人間は噛まれるとしばらく同類になってしまうのはなかなか面白い。「ゾンビ無料体験期間」的な？',
		name: 'キョンシー',
	},
	3005: {
		chat: [
			'まさか仙界でも人世らしき雰囲気を感じることがあるとはな。',
			'いつになったら自分の仙界を持つのだろうか。',
			'ようやくあの鬱陶しい死神を振り切れた…人間が長生きするのは罪か何かなのか？',
			'ようやく今日の百万遍念仏を唱え終わった…',
			null,
		],
		description:
			'長年に渡る修行で常人の域を超えた能力を手に入れた人間。妖怪にとっては上品な食べ物なので、大変な人生を送ることになる。生きるのが厳しすぎるのか、そういう人は大体性格が歪んでいる…',
		name: '仙人',
	},
	4000: {
		chat: [
			'美食の伝承は、こだわりのある美食家あってのもの。',
			'地上にはこういう店が多いのかな…',
			'そろそろ外に出てもいいかも。',
			'今の社会って種族に関係なくこんな風に一緒になれるのか？',
		],
		description: '少彦名命の一族と言われている種族。身長が一寸しかない。',
		name: '小人族',
	},
	4001: {
		chat: [
			'もう飯の香りがするぞ！',
			'故郷への思いっていうのは故郷の味への思いだよ。',
			'これからどうしよう…',
			'そろそろこれからを考えないとな…',
		],
		description:
			'正邪が幻想郷のあちこちから呼び寄せた各種族の男性。そのほとんどが未来に戸惑い、正邪が言う「壮大な計画」に熱く共感し彼女に従う若者である。今はさらに戸惑っているようだが……',
		name: '不良の少年',
	},
	4002: {
		chat: [
			'これからどうしよう…',
			'そろそろこれからを考えないとね…',
			'あたしでも、頑張ればこういう店開けるのかな？',
			'座っただけでお腹が温かい気分だ。',
		],
		description:
			'正邪が幻想郷のあちこちから呼び寄せた各種族の女性。そのほとんどが未来に戸惑い、正邪が言う「壮大な計画」に熱く共感し彼女に従う若者である。今はさらに戸惑っているが……',
		name: '不良の少女',
	},
	4003: {
		chat: [
			'生きる喜びを一番実感できるのは、食べる時だ。',
			'生きることも食べることも、思いっきり楽しんだほうがいい。',
			'いっぱい食べないと守る力が出ないからな。',
			'私はクリスマスで一番人気なプレゼントだぞ～。',
		],
		description:
			'打ち出の小槌の力で命を得た道具。偉い人の啓発を受けて、回収されるはずの小槌の魔力を自分の魔力に転換し、真の命を手に入れた。',
		name: 'おもちゃ兵士',
	},
	4004: {
		chat: [
			'スーさんって誰だろう……',
			'毒を以て毒を制すのが一番美味しい！',
			'すずらんの毒は神経毒だよ。',
			'あの提灯はちょっとすずらんに似てるね～。',
		],
		description:
			'すずらんに宿っている妖精。いつも「メディスンさんの言うスーさんは誰」という謎を解こうとしており、現在の懸賞金は「史上最も丸い石」99個になっているが、謎を解けた者はまだ現れていない。',
		name: 'すずらんの妖精',
	},
	4005: {
		chat: [
			'お花畑でかくれんぼするの一番好きだよ。',
			'私たちの大好きな遊び場で食堂を建てたなんて…',
			'女将さんのおかげでお花畑がもっと賑やかになった！',
			'お花畑にゴミを残さないでね！',
		],
		description:
			'ひまわりに宿っている妖精。ひまわりがずっと太陽に向かっているのは、彼女たちがこっそり花を回しているのが理由らしい。この自慢の技が多くの人間を惑わした。',
		name: 'ひまわりの妖精',
	},
	4006: {
		chat: [
			'あの惑星、B621っていうのかな？',
			'この店って個室ない？',
			'私って実はグルメの妖精なんだ～。',
			'好き嫌いってわけじゃなくて、ちょうどそんな味が気に入らなかっただけだよ。',
		],
		description:
			'バラに宿っている妖精。とある惑星で、バラが唯一そして最も高貴な花だという話をどこかで聞き、一斉に引っ越し熱を上げたが、成功した者はまだいない。',
		name: 'バラの妖精',
	},
	4007: {
		chat: [
			'うらめしやぁ——',
			'ちょっと髪で目を隠したほうが怖がらせやすいね。',
			'この恨みの行き先は……私のお腹だぁ！',
			'いっぱい食べないとイタズラできないからね。',
			'暗いフリをしてるだけだよ～。',
		],
		description:
			'性質上幽霊と怨霊の間にある霊。怨念を抱えたまま死んだのか、人間にイタズラするのが好きらしい。夜の部屋で、人がいないのに歩く影があるのであれば、影女の仕業だ。見た目は陰鬱だが見せかけである。',
		name: '影女',
	},
	5000: {
		chat: [
			'「ウサギの穴」から落ちた人は久しぶりです。',
			'あのお嬢さんは地上でどのように過ごしているのだろうか……。',
			'色柄の違う私たちは実は性格も少し違います。',
			'私たちの王はいつも優しくて賢い。',
		],
		description:
			'魔界の創造主の魔力によって化かされたカード兵。おとなしく朴訥な性格で、仕事がなくても自主的にパトロールに行く。空から誰かが降ってくるのを楽しみにしている様子は、ウサギの穴と何か関係があるのだろうか。',
		name: 'カード兵',
	},
	5001: {
		chat: [
			'何もすることないよね～',
			'いっそ辞めてホームレス芸人になればいい。',
			'もっと美味しいものを味わってほしいですね。',
			'地上の道化師はどうなっているのだろうか。',
		],
		description:
			'魔界の創造主の魔力によって化かされたカード兵は、兵長のような地位を担っている。長官の風格がないばかりか、兵士たちに手配できる仕事もない。一日中魔界のあちこちをぶらぶらしていて、兵士長よりも大道芸人のようだ。',
		name: '道化師',
	},
	5002: {
		chat: [
			'帽子、帽子をなべに投げろ！',
			'帽子に火がついたーー！',
			'仕事に夢中になっていると食事も忘れる。',
			'食べ終わったら帽子を作ろう！',
		],
		description:
			'制帽と裁断を得意とする職人。制帽用のフェルト布を保存する際に水銀を使う必要があるため、水銀中毒の痙攣現象が多発し、時には幻覚まで見ることもあることから、「マッドハッター」と呼ばれています。しかし、私は知っています、その狂気の下にある自分の作品に対する情熱と執着を。',
		name: 'マッドハッター',
	},
	5003: {
		chat: [
			'夜食は少し矜持が足りないでしょうか。',
			'あまり口腹の欲にふけってはいけない。',
			'女将さんは新しく来た月の使者ですか？',
			'豊姫様、桃食べ過ぎ…',
		],
		description:
			'月の都に住む人。彼らは寿命を捨て、生と死をなくすために穢れを取り除くことに力を入れている。しかし、彼らは不老不死ではなく、事故や戦争で死んでしまうこともあり、体にはかすかな穢れがついている。',
		name: '月人',
	},
	5004: {
		chat: [
			'XX様が恋しい……',
			'XX様はこれを食べたことがないのでは？',
			'地上のウサギが搗くのはちゃんと餅なんでしょうか。',
			'ウサギたちは穢れは嫌いではないが……',
		],
		description:
			'薬搗きを担当する玉兎。餅をついているように見えますが、臼の中身は実は薬です。薬をつく行為は価値のある薬を生み出すためではなく、誰かの罪を償うためだ。何の役にも立たないような労働を繰り返しているので、疲れがたまっている。',
		name: '薬草を搗くウサギ',
	},
	5005: {
		chat: [
			'最近訓練の強度が増しているのではないでしょうか……',
			'筋肉がついたような気がします。',
		],
		description:
			'月の都の警備を担当する玉兎。月の使者という仕事は玉兎の仕事の中では比較的規律が厳しい。肝心な時に地上人と戦えるよう、非常に厳しい訓練を受けなければならず、楽ではありません。',
		name: '月の使者',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedGuestText>>>;
