import type { ILocalizedGuestText } from '@/domain/data/localization/types';

export const NORMAL_GUEST_LOCALIZATION_KO = {
	0: {
		chat: [
			'건강을 최우선으로 챙기는 게 장수의 비결이다 우사. 요괴 토끼의 지혜라구.',
			'우리의 대장님을 만나면 행운이 깃든다 우사. 설마 여기 오진 않겠지...',
			'죽림은 되게 예쁘고, 죽순도 맛있다 우사! 그치만 외부인은 사절이다 우사.',
			'만월만 되면 이상해지는 사람들이 가끔 보이지만, 우리랑은 관계 없다 우사!',
			'우동...? 친근감이 드는 단어다 우사! 맛있어 보인다!',
		],
		description:
			'토끼가 요괴로 변했어도, 단 것과 신선한 것을 좋아하는 건 똑같아서 귀여워! 그래도 역시 요괴다보니 고기를 먹을 수밖에 없는것 같아. 그런 모습도 귀엽지만!',
		name: '요괴 토끼',
	},
	1: {
		chat: [
			'신선한 재료를 썼길 바래! 고양이 혀는 민감하단 말야.',
			'밤에 이런 붉은 등불을 보면, 오싹오싹하지 않아?',
			'고양이는 목숨이 아홉개라니, 그런 말 하는 애들은 고양이 혐오자일거야!',
			'요수는 꼬리가 많을 수록 강하다고 해! 근데 네코마타의 꼬리는 원래부터 두 개야...',
			'물에 젖는건 기분이 끔찍해! 비 오는 날엔 집에서 뒹굴고만 싶어.',
		],
		description:
			'요괴 고양이는 꼬리가 두 개 있는 것이 특징이야. 이 꼬리는 영력이 강해질수록 더 길게 자란다나봐. 귀여운 얼굴을 가졌지만, 그 뒤의 본성은 흉폭해. 환상향에선 야생 고양이조차도 식성이 까다롭다니까.',
		name: '요괴 고양이',
	},
	2: {
		chat: [
			'오늘 만난 무녀는 끔찍했지...',
			'그런 눈으로 보지 마. 이미 많이 마셨어.',
			'...나도 알아! 돈 대신 나뭇잎 내는 짓 따위 안 해.',
			'대장님께서 츠쿠모가미를 더 끌어모았지. 이걸로 우린 더 강해졌고 말야!',
			'달이 아름답지 않나? 근데, 저 달이 진짜 달이라고 생각해?',
		],
		description:
			'실력은 없으면서 능청스럽게 행동하는 성질 나쁜 요괴. 너구리 요괴는 변장을 잘 하니 주의해야 해. 계산서를 나뭇잎으로 지불할 수도 있어.',
		name: '요괴 너구리',
	},
	3: {
		chat: [
			'요즘 이자카야는 어떨지.. 한번 봐 볼까.',
			'어른을 공경하게나. 자네가 일평생 먹은 끼니보다 내가 떨어뜨린 [P]아이템이 더 많다네.',
			'요즘 것들은 와인에 물을 타 마신다니... 참으로 낭비가 아닐 수 없군.',
			'더 비싼 요리를 위해 더 고급진 재료를 사용하거라! 이 점 꼭 기억하거라!',
			'책은 휴대용 마법과 같지... 믿기 힘든 텐구의 신문에조차도 중요한 정보가 있을수 있다네.',
		],
		description:
			'요호들은 항상 강경한 어조로 대화해서, 노인 티를 내는 선생님 같아. 하지만 오래 산 만큼 가끔 도움 되는 말도 하지.',
		name: '요괴 여우',
	},
	4: {
		chat: [
			'요괴라면 당연지사 육식이지!',
			'저 참새도 맛있을 것 같은... 아, 점원은 먹으면 안 되겠구나.',
			'인간들은 요괴 짐승길에 얼씬도 못 하지. 좋은 일이야.',
			'여긴 꽤 옛날부터 장사하던 것 같은데 왜이리 초라해?',
			'짐승길에 보이는 멧돼지는 구우면 맛있겠지?',
		],
		description:
			'고대의 사나운 괴물이라고 생각되지만... 다 옛 이야기야. 실제로 만나보면 음식에 미쳐있다고 생각하게 될 걸? 그리고 음식의 품질에 대해 높은 기준을 갖고 있어.',
		name: '도철수',
	},
	5: {
		chat: [
			'앗싸! 드디어 놀기 충분한 돈을 모았어!',
			'학교 가기 싫은데... 결석하면 케이네 선생님이 찾으러 오실까?',
			'케이네 선생님의 수업은 지인짜 재미없어! 히에다님의 수업이었으면 달랐을텐데.',
			'꼬맹이라도 고민거리는 있어! 그래서 슬프지 않으려고 주스를 마시는 거야!',
			'얼마 전에 요정한테서 내 키만한 해바라기를 뺏어왔어!',
		],
		description:
			'시끄럽고 작은 인간. 예전 같았으면 이런 녀석들은... 하지만 지금은 제대로 친해진다면, 그 웃는 얼굴을 보는 것 만으로도 하루의 피로가 싹 다 날아가지. 정말 마법같은 일이야.',
		name: '인간 아이',
	},
	6: {
		chat: [
			'지친 하루를 위해 자극적인 녀석 하나!',
			'냄새 좋은데? 벌써 배고파졌어.',
			'딸이 향림당에서... 핸두폰? 을 사왔어. 참 현대적인 아이라니깐.',
			'끔찍해! 고참한테 또 괴롭힘을 당했다고... 그래도 술을 마시니 진정이 되네.',
			'주인장! 오리고기는 없어? ...왜...? 그런 눈으로 보지 마...',
		],
		description:
			'특별한 것 없는 인간 남성. 술에 취하면 항상 자기 얘기만 하고 징징대기 바쁘지. 그럼에도 불구하고, 남자들은 인간들 중에선 강하고 다른 사람들과 함께 의지하며 살아가지.',
		name: '인간 남성',
	},
	7: {
		chat: [
			'봄의 전령을 보면 복이 온다고 들어서, 한번 보고 싶네.',
			'내 이웃의 솜씨는 정말 굉장해. 여러가지 무늬를 간단하게 만들어낸다니까. 정말 부러워.',
			'요즘 내 작은아들이 말썽피워서 걱정이야. 언제는 집에 요정을 데려왔었는데, 다행히 아무일도 없었지뭐야.',
			'직접 만든 요리를 먹는게 아니면 부담이 덜하잖아~',
			'나는 도수가 약한 술이 좋아.',
		],
		description:
			'둘 이상이 만나면 대화가 끝이 나질 않아. 일상 얘기부터 옷, 장신구까지. 그래도 가끔 요리에 대해 이야기하는데, 그건 도움이 될 때도 있지.',
		name: '인간 여성',
	},
	8: {
		chat: [
			'참 좋은 날씨야... 안개가 끼고, 지진이 일고, 우박이 내렸었다고는 생각치도 못하겠구먼.',
			'마법의 숲 근처에선 습기때문에 관절이 아려와 살기가 곤란혀.',
			'오래 살다 보면 별의별 풍경도 다 볼수 있는 법이여. 매화꽃과 벚꽃이 동시에 만개한 여름... 정말 아름다웠었지..',
			'이곳에 눌러살려면 법을 따르는게 아니라, 적응을 해야 되는 것이여.',
			'올해의 사계절은 평범하구먼. 드문 일이여.',
		],
		description:
			'나이 든 인간은 불과 몇십 년 밖에 살지 못해. 우리 요괴와 비하면 눈 깜빡할 새에 지나가지. 하지만 어떤 노인들은 뭔가 신성한 영혼을 지니고 있는 것 같아. 그들의 충고를 듣는 건 나쁠 게 없어.',
		name: '인간 노인',
	},
	9: {
		chat: [
			'최고의 미식은 숨어있기 마련이죠. 그래서 제가 여기에 있는겁니다.',
			'가장 맛있는 음식은 사랑과 정성을 담은 요리라고들 합니다만... 저는 역시 고급스러운 요리가 좋습니다.',
			'여주인의 노래는 듣기 좋습니다. 자연의 변화를 들으려는 듯, 천국을 노래하죠.',
			'어째서 음악과 요리가 관련이 있는가?... 하하, 그것이 바로 자연의 아름다움이죠.',
		],
		description:
			'소문난 대식가라고 하던데, 미식을 쫓기 위해 여행도 마다하지 않고... 무사태평하게 사는게 쉽지 않은데, 대접을 잘 해줘야겠어.',
		name: '자에몬',
	},
	10: {
		chat: [
			'내 이름이 동자라고 해서 어린애는 아니거든!',
			'아무리 자시키와라시라도 가끔은 세계여행 해보고 싶달까~',
			'우리는 지박령과는 달라. 지박령은 한 곳에만 머물 수 있지.',
			'큭.. 체면을 구길 순 없어. 단골손님인척 해야겠다..',
			'누가 자시키와라시는 문 밖으로 나갈 수 없대? 우리도 바깥을 나돌아다닐 수 있다고... 잠깐, 말하는게 아니었는데!',
		],
		description:
			'자시키와라시는 집에 묶여 나갈 수 없는 줄 알았는데, 아닌 모양이네. 물건에 빙의하여 어디든 여행할 수 있는 것 같아. 그리고 자시키와라시는 주인에게 부를 가져다 준다는 소문도 있지. 그게 사실이었으면 좋겠네.',
		name: '자시키와라시',
	},
	11: {
		chat: [
			'오옷, 이건 무슨 종류의 식당일까나?',
			'한번도 해보지 않은 요리라면 망칠수도 있으니 천천히 해.',
			'최근에 안개의 호수에서 사고가 많이 일어났어. 또 요정들이 장난치는걸까?',
			'너는 동양파? 아니면 서양파? 뭐, 어느 쪽을 고르던 반대편은 불쾌해 하겠지만.',
			'향림당은 희귀한 물건들을 팔지만, 우린 좀더 효율적인 것들을 팔고 있다고.',
		],
		description:
			'캇파는 물을 다루는 기술로 알려져있어. 환상향에선 무역도 잘해서, 내 선생이 될 수 있을지도. 또 가끔 캇파들이 주판을 가지고 재빠르게 일하는건 넋놓고 바라볼 때가 있어.',
		name: '캇파',
	},
	12: {
		chat: [
			'환상향에서 산지도 오래 되었지만, 외출하면 역시 이목을 끄는군.',
			'인간은 곧장 외모만 보고 판단한다니까!',
			'나는 홍마관에 가면 잘먹고 잘살 수 있을 줄 알았는데, 해야할 일이 너무 많아.',
			'우리의 외견같은건 일의 효율에 관계 없어.',
			'잘생긴게 무슨 소용이야? 외모로 먹고 살수 있긴 해?',
		],
		description:
			'고블린들은 은근히 골머리를 썩혀. 고블린들 자체는 별거 없지만, 얼굴을 본 인간들이 겁에 질릴지도 몰라. 그런데 인간들은 다른 요괴들과는 잘 지내잖아. 이해가 안 돼.',
		name: '고블린',
	},
	13: {
		chat: [
			'요괴의 산에서 보이는 단풍잎은 정말 아름답네요.',
			'이상한 소문도 많지만... 하쿠레이의 무녀님은 존경하고 있어요.',
			'저는 지인들이 제 집에 방문할때 요리해 주는걸 좋아한답니다. 하지만 주인장, 당신은 잘 해야 겠죠?',
			'불가사의한 저택에 대한 이야기요? 북쪽 아니면 서쪽이요? 아시잖아요, 여긴 환상향이라는거.',
			'당신이 손님의 비위를 맞춰주신다면 나쁜 꼴은 면할 거에요.',
		],
		description:
			'카라스텐구들은 매너가 정말 좋지만, 결코 타협하진 않아. 접대하기 정말 힘들어도, 그래도 손님인걸. 최선을 다해야지.',
		name: '카라스텐구',
	},
	14: {
		chat: [
			'야호! 요정은 먹을 필요는 없지만, 놀기에 재밌는 곳이야!',
			'걱정하지마! 우린 장난치는걸 좋아하지만, 저런 부적이 붙어있어서야 못한다구.',
			'저기있는 건 뭐야? 우왓, 이상한 종이 부적이네...',
			'요괴랑 요정의 다른 점이 뭐냐고? 짧게 말해서, 우리가 더 귀엽지!',
			'요즘 안개의 호수에서 외부인을 봤어! 요괴긴 했지만... 행동이 수상하다구.',
		],
		description:
			'사실, 요정들은 먹을 필요가 없지만, 단순히 남들을 따라하는 것 뿐이야. 연회나 다른 사람들에게 장난 치는걸 좋아하지. 요정들의 장난에 주의해야 해!',
		name: '요정',
	},
	1000: {
		chat: [
			'우리는 낮은 수준의 심부름과 작업만 처리할 수 있어.',
			'오니가 뭔가를 꾸미고 있다며? 다시 돌아오진 않겠지?',
			'여기서 이자카야를 연다고? 이봐, 그건 우리 작업량을 증가시킬 뿐이야.',
			'고위 직급의 텐구는 우리보다 훨씬 강하지. 그런데 왜 경비원 같은게 필요한거야?',
		],
		description:
			'텐구 사회는 백랑 텐구가 경비원 역할을 하는 등 계급 체계가 이루어져 있어. 그들 대부분이 엄격한 성격을 가진 건 아마도 임무 때문이겠지. 하지만, 때때로 과음하기도 하고 수다스러워지기도 해.',
		name: '백랑 텐구',
	},
	1001: {
		chat: [
			'뭘 꼬라보나!? 당장 꺼지지 않으면 그 눈깔을 도려내주지!',
			'야만바는 고독한 늑대와도 같지. 서로를 거의 찾지 않아.',
			'산은 텐구만의 거처가 아냐.',
			'이런 식당이 존재한다고? 흠... 스스로 요리하는 습관을 들여야 하는데 말이지.',
		],
		description:
			'요괴의 산에 살고 있지만 그들끼리도 거의 소통하지 않고 사는 고독한 종족. 소문에 의하면 산에서 길을 잃은 아이들을 잡아간다고 하던데... 그건 오해야. 말이 거칠 수 있어도 단지 대화가 서툴러서 그럴 뿐이야. 사실 야만바들은 매우 솔직하고 친절하지.',
		name: '야만바',
	},
	1002: {
		chat: [
			'강? 에이, 그런 데는 이미 오래 전에 버렸어.',
			'전쟁 게임을 하다보니 엄청 배고파졌어! 우선 뭐 좀 먹어야겠다.',
			'강에서만 사는 캇파... 그녀석들은 산의 흥미를 전혀 알지 못해.',
			'인간 마을의 금융시장은 산 속의 금융시장과는 완전히 달라.',
		],
		description:
			'요괴의 산의 봉우리를 위해 강을 떠난 캇파. 산에 베이스 캠프를 설립한 전문가들이지. 특히 경제학 연구는 아주 진보했어. 인수합병이니 자본시장이니 그런 게 뭔지 전혀 모르겠지만...',
		name: '야마와로',
	},
	1003: {
		chat: [
			'마법은 초자연적인 현상이지. 하지만 본질적으로는 과학이야.',
			'인사라는 건 정말 큰 용기가 필요한 일이야...',
			'마법 연구는 정말 집중해야 하는 일이야. 그래서 거의 모든 마법사들은 혼자 살지.',
			'마법을 연구하다 보면 돈이 정말 많이 들어. 음식을 만들어내는 마법을 개발할 수 있다면 좋을텐데...',
		],
		description:
			'마법의 숲에서 나는 버섯은 마법의힘을 집중시키는데 쓸 수 있어서 많은마법사들이 마법의 숲에서 살고 있지.마법사들 대부분은 은둔자처럼 혼자살면서 연구에만 몰두해. 마법 연구는외로운 일인 것 같아.',
		name: '마법사',
	},
	1004: {
		chat: [
			'지하 동굴을 탐험하는 건 정말 재밌어! 추위를 싫어하는 요정들의 집이긴 하지만...',
			'뻐끔플라워한테 삼켜질 뻔 했어! 진짜 아슬아슬했다구!',
			'나무에서 자라는 수박을 본 적 있어? 머리 위로 떨어지면 정말 아프다고!',
			'내 친구가 독버섯을 먹고 쇠똥구리가 된 것 처럼 행동했어! 정말 웃겼다니까!',
		],
		description:
			'요정이 많을수록 자연은 더 생기가넘치지. 마법의 숲의 어떤 장소들은요정들 덕분에 자원이 아주 풍부해.게다가 거의 모든 나무는 요정들의집이라고 해. 몇몇 요정들은 장난을좋아하니까, 나무 주변에서는 항상조심하는게 좋아.',
		name: '숲 요정',
	},
	1005: {
		chat: [
			'숲속은 정말 습해. 곰팡이가 피는 것 같은 느낌이야...',
			'이름없는 언덕에 아름다운 꽃밭이 있다고 들었는데... 보고 싶네!',
			'인간이든 뭐든 충분해!',
			'숲속엔 범 무서운 줄 모르는 요정들이 정말 가득해. 날 좀 내버려 뒀으면 좋겠건만.',
		],
		description:
			'기원을 알 수 없는 인형. 츠쿠모가미인것 같은데... 어쨌든, 마법의 숲에는 인형을 조종하는 마법사가 살고 있으니까. 하지만, 이 인형은 조종당하고 있는 것 같진 않아. 츠쿠모가미가 맞겠지?',
		name: '잃어버린 인형',
	},
	2000: {
		chat: [
			'나도 야마메씨처럼 유명해지고 싶네~',
			'이렇게 밝은 동굴은 일평생 처음이야.',
			'가게에 벌레가 나타난다면, 내가 도와줄 수 있어.',
			'질병은 사실 조미료라구.',
		],
		description:
			'어둠의 풍혈 안에 잠복하고 있는 흙거미. 그들 대부분의 성격이 난해하지만, 건축에는 엄격하고 진지해. 동료들끼리도 자주 논의하지. 이건 배울만한 점이야.',
		name: '츠치구모',
	},
	2001: {
		chat: [
			'마실수 있는 곳은 많으면 많을수록 좋지~',
			'지상에 오니 퇴치 전문가가 아직도 있나?',
			'이곳의 활기는 옛날 선술집 못지 않네.',
			'참새야~ 여기 잔좀 채워줘~',
		],
		description:
			'먼 옛날부터 존재했던 환상향 최강의 종족! 환상향을 떠난 지 오래된 줄 알았지만, 지저에 살고 있었어. 오니들은 성격이 시원시원하지만 사나워서 절대로 거짓말을 해선 안 돼.',
		name: '오니',
	},
	2002: {
		chat: [
			'그 하시히메한테 매일밤 못 박는 소리가 나는데, 정말 무서워...',
			'피부가 아무리 아름다워도 사실은 허상일 뿐.',
			'내 자신의 이익이 가장 중요하지.',
			'속세놀이를 하기로 했는데 음식을 안 먹을리가 있나~',
		],
		description:
			'잘 차려입은 언니들의 말투는 부드러우면서도 성숙해. 손에는 늘 꽃들이 매달려 있어 지나가는 인간들을 현혹시킨다고 해. 실제로 동굴에서 마주칠 때 앞길을 밝혀주기도 하지.',
		name: '호네온나',
	},
	2003: {
		chat: [
			'작열지옥터를 지키던 까마귀는 발이 세 개라 이상해 보였어.',
			'네 사업은 지옥처럼 번창하고 있네.',
			'까마귀는 제단에서 숭배받던 신성한 영물이었지만... 내려오자마자 불행의 상징이 되어버렸어.',
			'언제부터 새대가리와 바보가 같은 말이 된 거야!?',
		],
		description:
			'옛 지옥의 가장 깊은 곳에 서식하는 까마귀. 옛 지옥에 살던 요괴는 원래 살던 곳이 폐허가 되어 이주시켰지만, 원래 지옥에 살던 최초의 주민이었대.',
		name: '지옥까마귀',
	},
	2004: {
		chat: [
			'고획조야, 아이를 거둬가렴~여름이 오면 아이를 돌려주렴~',
			'남는 손톱이 있으면 내게 줘도 좋아.',
			'고획조, 귀차조, 구두조, 셋이 각기 다른 요괴야.',
			'아이의 옷을 바깥에 걸어두는 게 암호란다.',
		],
		description:
			'깃털옷을 입으면 새가 되고, 깃털옷을 벗으면 소녀가 된다는 전설이 있는 요괴. 남의 손톱을 긁어모으다 보면 복을 알 수 있기 때문에 점쟁이들이 많아. 신비주의를 지키기 위해서인지 계속 신경질적으로 대화해.',
		name: '고획조',
	},
	2005: {
		chat: [
			'사냥도 좋지만 가끔은 이렇게 먹는것도 나쁘지 않네.',
			'이 가게의 주인은 참새라던데...',
			'직접 음식이 되고 싶은게 아니라면 요리를 잘 하라구~',
			'참새가 요리를 한다고? 어떤 음식이려나~',
		],
		description:
			'야성적인 동물형 요괴. 성격이 시원하고 제멋대로야. 종족때문에 무서웠는데... 표범 자체는 막강하지만, 요괴가 될 수 있는 숫자는 많지 않은 것 같아.',
		name: '요표',
	},
	3000: {
		chat: [
			'흔히 "술과 고기를 먹어도, 부처는 마음속에 남아있다" 고 하지.',
			'명련사는 낮엔 조용하고 엄숙하지만, 밤에는 아주 시끌벅적해.',
			'진행회는 정기적으로 사원에서 괴담 대회를 개최하는데, 상당히 짜릿해.',
			'불심전법, 성야뇌정.',
		],
		description:
			'인간들은 잘 몰라도, 난 알고 있어...... 명련사의 수행승은 대부분이 요괴야. 불교의 육묘문으로 수행한다는데, 정말로 효과가 있는지는 아무도 모르지만, 여전히 많은 요괴들이 수련을 벗어나서 자신만의 길을 걷고 있어.',
		name: '승려',
	},
	3001: {
		chat: [
			'인간 마을에서는 쥐약이 보편화되어 있으니, 안심할 수 없어.',
			'우리 대장은 숨겨진 보물들로 가득한 신비한 곳에 살고 있어.',
			'치즈의 구멍은 모두 쥐의 소행 이라는 헛소리는 대체 어떤 놈이 퍼뜨린 거야?',
			'이 세상에서 우리가 찾을 수 없는 건 없어.',
			'우리가 보물이라고 생각하는 건, 인간들은 항상 쓰레기라고 생각하지.',
		],
		description:
			'환상향 어디에서나 볼 수 있는 보물 찾기 전문가. 그들과 좋은 관계를 맺는다면, 앞으로 물건을 잃어버릴 걱정은 없을 거야. 하지만 음식을 찾아달라고 의뢰하면, 받기도 전에 다 먹어버릴지도 몰라.',
		name: '요괴 쥐',
	},
	3002: {
		chat: [
			'존재감이 없는 요괴는, 불치병에 걸린 인간과도 같아.',
			'키가 크고 살이 안 찐다는 게 꼭 좋은 것만은 아니야.',
			'우리가 살찌고 싶다고 생각하는 건, 기만이라고 생각하는데......',
			'우리의 상징과도 같은 옷을 잃어버리면, 과연 팔척귀신이라고 불릴 수 있을까?',
			'요괴의 개혁도 쉽지 않아.',
		],
		description:
			'몸 길이가 팔척이나 되는 이 귀신은, 항상 챙이 넓은 모자를 쓰고 있어서 피부가 하얘. 과거에는 흰색 원피스를 즐겨 입었는데, 낮이 되면 존재감이 없어져서, 거의 모든 종족이 굶주리다가 비쩍 말라버렸어. 지금은 더 많은 관심을 끌 수 있도록 다른 의상을 찾고 있는 팔척귀신도 있다고 해.',
		name: '팔척귀신',
	},
	3003: {
		chat: [
			'전설에 의하면, 절에 있는 주지스님은 한때 유명한 귀족이었다고 해.',
			'주지스님께선 오늘도 내 고민을 들어주시고, 인도해주셨어.',
			'도사 전용 헤드폰은 어디서 살 수 있을까?',
			'정말 순수하고 금욕적인 사람이라면, 선인이 되고 싶어하지 않겠지?',
			'선인의 길도, 결국 식후경이지!',
		],
		description:
			'신령묘에는 태자를 스승으로 모시면서 선술을 배우기를 바라는 제자들이 많아. 하지만 잡일만 하는 것 같았어. 근데 항상 의욕이 넘치고 야망이 있어 보였는데...... 혹시 잡일도 재밌는 게 아닐까?',
		name: '도사',
	},
	3004: {
		chat: [
			'접시......못 먹어......',
			'썩을 것 같아......',
			'누가 한 말이었더라...... 잘 먹어야 빨리 자란다고......',
			'잊어버린 기억이 너무 많아......',
			'잊지 마...... 접시 위에 있는 것만 먹을 수 있어......',
		],
		description:
			'사악한 선녀에게 조종을 받는 좀비. 시체지만 썩지 않고, 생전보다 더 강한 힘을 갖고 있어. 머리도 나쁘고, 말도 안 통하지만, 편식은 하지 않아. 인간이 물리면 일시적으로 동족이 된다고 하는데, 꽤 신기하더라. 마치 "좀비 체험권"같은 느낌?',
		name: '강시',
	},
	3005: {
		chat: [
			'선계에서 불과 연기를 느끼게 될 줄은 몰랐습니다.',
			'언제쯤 나만의 선계를 가질 수 있을까?',
			'그 귀찮게 구는 사신을 드디어 처리했는데......',
			'인간이 아주 조금 오래 사는 게 무슨 죄인가?',
			'오늘 외워야 할 진언을 모처럼 다 외웠는데......',
		],
		description:
			'오랜 수행으로 남들보다 뛰어난 능력을 얻은 인간은, 많은 요괴들에게 맛있는 음식으로서, 다사다난하게 살아간다고 해. 삶이 너무 힘든 나머지, 성격이 좀 이상해지기도......',
		name: '선인',
	},
	4000: {
		chat: [
			'음식이 대대손손 내려오기 위해선 까다로운 미식가가 필수지.',
			'지상에는 이런 가게들이 많은 건가.…',
			'슬슬 나가서 산책을 할 시간이구만.',
			'요즘은 어떤 종이든 이렇게 모일 수 있는 건가?',
		],
		description:
			'이 사람들은 몸집이 작은 전설의 스쿠나히코나의 후손이래. 일생을 성 안에만 있으니, 평범한 상식 같은 건 부족할 수 밖에 없으려나. 그래도 그들은 배우는 데에 최선을 다하고, 성 밖의 세계를 알고 싶어해.',
		name: '소인족',
	},
	4001: {
		chat: [
			'벌써부터 음식 냄새가 나는걸!',
			'향수병은 탐욕에서 나오는 거야.',
			'그 다음엔 뭘 할까…',
			'슬슬 내 미래도 생각해볼 시기인가…',
		],
		description:
			'세이자씨에게 속아서 온 소년들이야. 대부분 미래에 대한 확신도 없이 그저 세이자씨의 "위대한 사업"에 열과 성을 다하고 있는데, 그러면 그럴 수록 미래는 더 불투명해지지 않을까…',
		name: '불량 소년',
	},
	4002: {
		chat: [
			'그 다음엔 뭐하지…',
			'슬슬 내 미래가 걱정되는데…',
			'나도 열심히 일하면 이런 가게를 차릴 수 있으려나',
			'벌써부터 배가 따뜻해지는 느낌이야.',
		],
		description:
			'세이자씨에게 속아서 온 소녀들이야. 대부분 미래에 대한 확신도 없이 그저 세이자씨의 "위대한 사업"에 열과 성을 다하고 있는데, 그러면 그럴 수록 미래는 더 불투명해지지 않을까…',
		name: '불량 소녀',
	},
	4003: {
		chat: [
			'식사는 살아있음을 느낄 수 있어.',
			'인생이란 즐거움을 얻는 거고, 먹는 거는 즐거움의 과정이지.',
			'배고픈데 어떻게 경계임무를 해.',
			'나는 크리스마스에 가장 인기있는 선물 중 하나야~',
		],
		description:
			'요술 망치의 마력에 의해 삶을 얻은 장난감이야. 몸에 있던 마력이 원래 제자리를 찾아갔어야 했는데, 누군가의 의해 장난감 자신의 마력이 되었고, 덕분에 진정한 삶을 얻었다고 해.',
		name: '장난감 병정',
	},
	4004: {
		chat: [
			'방울이가 누구일까…',
			'이독치독이 보는 맛도 있어!',
			'은방울꽃 독이 신경독이란 거, 알고 있었어?',
			'저 랜턴은 은방울꽃처럼 생겼네~',
		],
		description:
			'은방울꽃 속에 사는 요정이야. "메디슨이 말하는 \'방울이\'는 대체 누구일까?"라며 온종일 물어보고 다니지. 질문에 대한 포상은 벌써 "세상에서 가장 둥근 돌" 99개가 됐지만, 아직도 풀리지 않는 미스터리라네.',
		name: '은방울꽃 요정',
	},
	4005: {
		chat: [
			'정원에서 하는 숨바꼭질만큼 재밌는게 없어!',
			'우리 노는 곳에 이런 식당이 생기다니…',
			'가게 덕분에 태양의 밭이 더 활기차졌어!',
			'정원엔 쓰레기를 버리면 안 돼!',
		],
		description:
			'해바라기 속에 사는 요정이야. 이 요정들이 몰래 해바라기 위치를 옮긴다는 소문이 있어. 해바라기가 항상 해를 바라보는 이유인 셈이지. 그렇게 갈고 닦은 속임수로 사람들을 속여왔고, 이 요정들은 그거에 대해 자랑스러워 해.',
		name: '해바라기 요정',
	},
	4006: {
		chat: [
			'저게 소행성 B612인가?',
			'여기 개인방 있나요?',
			'사실 제가 요정 미식가거든요~',
			'제가 까다로운 입맛은 아니고, 그냥 저런 맛을 별로 안 좋아해서요.',
		],
		description:
			'장미 속에서 사는 요정이야. 어느 행성에 장미꽃이 사방 천지에 널려있다고 들어서 이사를 가는게 잠시 대유행이 됐었어. 어느 누구도 성공한 적 없지만.',
		name: '장미꽃 요정',
	},
	4007: {
		chat: [
			'내 다리 내놔——',
			'머리로 눈을 살짝만 가려도 사람들은 훨씬 더 무서워한다구.',
			'이 원한과 증오...가 내 뱃속으로 들어오고 있어!',
			'빈 속에 어떻게 놀아.',
			'우울해 보여? 전부 연기라구~',
		],
		description:
			'원혼과 유령 사이에 있는 영혼이야. 죽을 때 품었던 원한 때문에, 인간에게 장난을 치는 것을 좋아하는 것 같아. 만약 아무도 없는데 그림자가 밤에 집 근처를 어슬렁거리는 느낌이 든다면, 보통 그건 카게온나가 한 짓이야. 평소엔 우울해 보이지만, 대부분은 연기라고 하네.',
		name: '카게온나',
	},
	5000: {
		chat: [
			'마지막으로 누가 "토끼굴"에 떨어지고나서 꽤 오랜 시간이 지났네.',
			'그 아가씨는 지상에선 어떻게 지내고 있을까...…',
			'우리 성격은 색깔과 모양별로 다 달라.',
			'우리의 왕은 항상 온화하시고 현명한 분이지.',
		],
		description:
			'마계의 창조자가 만든 카드 병사. 솔직하고 무뚜뚝한 성격에, 일을 시키지 않아도 알아서 순찰을 돌 정도로 일을 좋아해. 그리고 계속 누가 하늘에서 떨어지길 기대하던데, 토끼굴 이야기랑 관련된 걸까?',
		name: '트럼프 병사',
	},
	5001: {
		chat: [
			'솔직히 할 건 별로 없어~',
			'이거 그만두고 길거리 공연이라도 해볼까.',
			'여러 미식들을 먹어보고 싶은데.',
			'지상의 광대들은 어떻게 생겼을까?',
		],
		description:
			'마계의 창조자가 만든 카드 병사. 병사들의 지휘관급 자리를 맡고 있어. 겉보기엔 군인 같이 생기지도 않았고, 실제로도 일 같은 건 시키지도 않아. 그저 공연가의 모습으로 내내 길거리를 돌아다닐 뿐이지.',
		name: '광대',
	},
	5002: {
		chat: [
			'모자다 모자! 냄비에 던져야 돼!',
			'불이야, 모자에 불이 났다——!',
			'일에 열중하다 보면 밥 먹을 시간도 놓치네.',
			'빨리 먹고 모자를 만들러 가야지!',
		],
		description:
			'모자를 수선하고 만드는 장인이야. 모자를 만들 때 쓰는 펠트를 보관하기 위해서 수은을 썼는데, 그 수은에 중독되는 경우가 많았대. 그래서 이상증세를 보였고, 매드해터라는 별명이 생겼다네. 겉은 미쳤지만, 그래도 난 그 마음속에 있는 모자에 대한 열정과 끈기가 보여.',
		name: '매드 해터',
	},
	5003: {
		chat: [
			'야식을 먹는 건 조금 안 좋게 보이려나.',
			'식욕에 너무 얽매이면 안 돼.',
			'여기 사장은 새로운 달의 사자인가?',
			'토요히메님은 복숭아를 너무 많이 드시는 거 같은데…',
		],
		description:
			'달의 도시에 사는 사람이야. 수명을 포기하고, 죽음을 없애려고 더러움을 열심히 없애고 있어. 근데 불로불사는 아니고, 몸에 조금의 더러움이 남아 있어서 사고나 전투에서 죽을 수도 있대.',
		name: '월인',
	},
	5004: {
		chat: [
			'xx님이 너무 그리워...…',
			'XX님은 이걸 안 드셔봤겠지?',
			'지상의 토끼가 정말 떡을 찧는 게 맞지?',
			'토끼들은 불결함을 싫어하진 않는데…',
		],
		description:
			'약을 만들고 있는 토끼. 겉보기에는 떡을 찧는 것처럼 보이지만, 실제로는 약을 찧고 있어. 하지만 좋은 약을 만들기 위해서 찍는게 아니래. 누군가의 죄를 속죄하기 위해서라나... 그렇게 매일 똑같은 일을 계속 하다보니 피로가 꽤 쌓였겠지.',
		name: '약토끼',
	},
	5005: {
		chat: ['최근 훈련이 너무 많아진 거 같아...…', '근육이 좀 붙었나?'],
		description:
			'달의 도시를 지키는 역할을 맡은 달토끼들이야. 다른 달토끼의 일과 다르게 달의 사자 일은 엄청 엄격해. 중요한 순간에 지상 침략자와 싸워서 이겨야하니, 엄청 힘든 훈련들을 받는다던데, 고생이 많아 보여.',
		name: '달의 사자',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedGuestText>>>;
