import type { ILocalizedGuestText } from '@/domain/data/localization/types';

export const NORMAL_GUEST_LOCALIZATION_ZH_TW = {
	0: {
		chat: [
			'注重健康的生活才能長壽嗚撒！這就是妖怪兔的智慧嗚撒！',
			'一般來説遇到我們的boss可以獲得幸運嗚撒！不過如果是在這裏的話……',
			'竹林很漂亮的嗚撒！筍也很好吃嗚撒！但是外人不許進去嗚撒！',
			'滿月的時候，會有人變得奇怪嗚撒……和我們可沒關係哦！',
			'烏冬……？聽起來很有親切感嗚撒！會很好吃吧！',
		],
		description:
			'兔子就算變成了妖怪，也還是喜歡甘甜新鮮的味道呢，真是可愛。當然啦，已經成為了妖怪，不吃肉是不可能的。吃肉的樣子也很可愛~',
		name: '妖怪兔',
	},
	1: {
		chat: [
			'希望這家店的食材可以新鮮一點，貓的嘴可是很刁的。',
			'晚上有這麼大的紅燈籠的店鋪，乍一看還挺嚇人的呢~',
			'説貓有九條命的人，絕對是和貓有仇吧！',
			'聽説妖獸尾巴越多則越強，但一般妖怪貓都只有兩條尾巴。',
			'沾到水的感覺很討厭啊，下雨天就只想在家裏睡覺。',
		],
		description:
			'妖怪貓特徵是兩尾分岔成二股，據説妖力越大，分岔越明顯。明明長得那麼可愛，性格卻很兇！幻想鄉就連野貓的嘴巴也很刁呢。',
		name: '妖怪貓',
	},
	2: {
		chat: [
			'今天遇到的那個神社的巫女真的好可怕啊……',
			'別一直盯着我呀，酒都不好喝了。',
			'……知道啦！我不會拿葉子來付款的啦！',
			'老大最近又得到了很多付喪神，這下我們的力量就更強大了！',
			'月亮很漂亮吧？可是你看到的，是真正的月亮嗎？',
		],
		description:
			'性格暴躁，總是擺出一副老油條的樣子，其實也沒啥本事吧。不過，它們似乎很擅長變幻，要警惕它們用葉子來付賬！',
		name: '妖怪狸',
	},
	3: {
		chat: [
			'我倒要看看現在的年輕人的居酒屋搞得怎麼樣。',
			'對長者放尊重點，我掉過的P點比你吃過的米還多',
			'酒這東西，年輕人都喜歡兑水喝……不行，不行。',
			'如果加入某些高級的食材，料理的氛圍也會變得高級！給我好好記住啊！',
			'要多讀書多看報……就算天狗的報紙不太靠譜，但是偶爾也有稀有情報。',
		],
		description:
			'經常用一副過來人的口氣説話，有種倚老賣老的感覺。不過，可能是因為活得比較久，有時候也會説一些似乎挺有用的話。',
		name: '妖怪狐',
	},
	4: {
		chat: [
			'妖獸果然還是要吃肉啊！',
			'那裏的夜雀看起來很好吃的樣子……什麼，是店員不是吃的啊。',
			'雖然人類很害怕獸道，但是其實路上好東西很多。',
			'黑暗中的紅燈籠店，看到的一瞬間腳就已經踏進來了。',
			'説起來，獸道的野豬如果能拿來做料理的話，應該會很好吃吧。',
		],
		description:
			'似乎是上古的兇獸……曾經是這樣認為的。實際見了之後，才發現只是一隻饞怪而已。食量很大，而且對口感的要求很高。',
		name: '蟒蛇精',
	},
	5: {
		chat: [
			'耶——攢夠零花錢出來玩了！',
			'不想上課啊……偷偷跑出來不會被慧音老師發現吧？',
			'慧音老師的課真的好——無——聊！如果是阿求姐姐來上的話大概會不一樣吧？',
			'小孩子也有小孩子的煩惱，需要借果汁消愁！',
			'上次從一個妖精手裏搶到了和我一樣高的向日葵誒~',
		],
		description:
			'吵吵鬧鬧的人類小不點，這種傢伙要是在以前……現在好好接觸下來以後，偶爾看着他們親近自己的笑臉，會不知不覺地感到疲勞減少，真是奇怪啊。',
		name: '人類小孩',
	},
	6: {
		chat: [
			'幹了一天活過來喝一杯！',
			'餓死了餓死了，已經聞到食物的香氣了。',
			'我女兒讓我去香霖堂買什麼……手雞？現在的小孩子啊……',
			'真是麻煩啊，今天又被上面的人刁難了，還是喝酒開心啊！',
			'店主！為什麼沒有燒鳥啊！啊……別這麼看着我啊。',
		],
		description:
			'看着也不是多了不起的角色，卻總是自説自話。尤其是喝了酒就喜歡發牢騷。不過在人類這一種族中，似乎是體格最強的存在，常被依賴着。',
		name: '人類男性',
	},
	7: {
		chat: [
			'聽説看到報春精會帶來好運，我也想見一見呢。',
			'鄰居太太的手工很好，每次都能把衣裳裁出不同的花樣，真讓人羨慕啊。',
			'小兒子最近太淘了，上次還抓了一隻妖精回家，幸好最後沒出什麼事……',
			'不是自己做的飯吃起來就是沒有心理負擔呢~',
			'呼呼~比起那種大叔才會喜歡的烈酒，我還是更喜歡温和一點的飲料。',
		],
		description:
			'只要聚在一起就會有説不完的話，基本説的都是些生活瑣事，或者互相奉承衣服首飾什麼的。偶爾還能聽到關於料理的技巧，這點倒是挺好的。',
		name: '人類女性',
	},
	8: {
		chat: [
			'今天天氣不錯……不過以前有段時間天氣很糟糕，一會起霧一會地震一會冰雹的。',
			'我這把年紀了，實在是沒法住在魔法森林附近……太潮濕了，關節成天疼。',
			'活的久了，什麼都能看得到。梅花和櫻花一起盛開的夏日什麼的，還是挺好的。',
			'在這個地方活着啊，還是要順應時代，不能太墨守成規啊。',
			'今年的季節很正常呢，真是難得。',
		],
		description:
			'人類的長者充其量也不過活了幾十年罷了，對我們妖怪來説是很短的歲月。但是有些老人身上似乎有種仙人般的氣質……偶爾聽聽老人的話，應該也不會吃虧吧。',
		name: '人類長者',
	},
	9: {
		chat: [
			'極致的珍饈亦可能藏於市井之中是也，因而吾才會來到此處。',
			'只要用心，便是上等的料理……即使如此，吾依舊偏好高級料理是也。',
			'老闆娘唱歌很好聽，倘若去聆聽大自然的調律，更可以奏出天籟之音是也。',
			'為什麼音律與料理有關？……呵呵，這就是自然的奧妙了，是也。',
		],
		description:
			'據説是人類裏的有名的大胃王，為了追尋美味，甚至不惜離開村子到處旅行……能平安地活着真是不容易啊，就讓我來滿足你的胃吧~',
		name: '左衞門',
	},
	10: {
		chat: [
			'雖然名字是童子，但我已經不是小孩子了！',
			'就算是咱們座敷童子，偶爾也想要周遊世界呢~',
			'座敷童子其實並不是像地縛靈那樣，只能呆在固定的場所裏哦。',
			'可惡，不能輸在氣勢上，一定要裝作常來的樣子……',
			'誰説座敷童子不能出門，我們之前還去過外界呢……啊，這個好像不能説出來！',
		],
		description:
			'一直以為座敷童子是地縛靈的一種，沒想到這種認知是錯誤的。似乎只要依附在什麼東西上，就可以到處往來的樣子。對了，聽説座敷童子會給店家帶來好運，至少希望這個傳言是真的呢~',
		name: '座敷童子',
	},
	11: {
		chat: [
			'哦？原來也有這種店面啊。',
			'沒有學過的菜譜就算強行做出來也會奇奇怪怪的，還是循序漸進的好。',
			'區區住在林子裏的猴子，是不會明白河裏的樂趣。',
			'在幻想鄉裏你是東洋派還是西洋派？選哪邊都會得罪另一邊吧。',
			'雖然香霖堂會賣些奇怪的稀有玩意兒，但我覺得還是我們的商品更實用一些。',
		],
		description:
			'傳説中的河童只是擅於弄水，幻想鄉裏的河童卻還擅於經商，可以説是我的大前輩。那份遊刃有餘地撥着算盤的身姿，偶爾會讓我移不開眼睛呢~',
		name: '河童',
	},
	12: {
		chat: [
			'來了幻想鄉這麼久，還是一出門就會被盯着看。',
			'人類就是喜歡以貌取人的生物！',
			'還以為住進洋館就能過上好日子，結果還是有那麼多活要幹啊。',
			'我們雖然長得醜了那麼一點點，但幹活可是很麻利的。',
			'長得好看有什麼用，難道長得好看就可以不吃飯嗎？',
		],
		description:
			'讓人有點頭疼的客人。雖然性格挺沉穩的，但似乎因為長相，會嚇到一些人類客人。真是搞不懂，明明和其他妖怪同桌都沒問題啊……',
		name: '地精',
	},
	13: {
		chat: [
			'秋天的話，妖怪之山的楓葉會非常漂亮。',
			'雖然奇怪的傳聞很多……但是我還是很尊重博麗的巫女大人的。',
			'我很喜歡拜訪朋友的時候帶一些手作食物，不過老闆娘應該更擅長這個吧？見笑了。',
			'神秘的洋館的傳聞？你是説北邊的那個，還是西邊的那個呢？這可是幻想鄉。',
			'只要好好去完成客人的要求，就不會被特地刁難。',
		],
		description:
			'談吐雖然彬彬有禮，卻又感覺有點強勢。這是時常跑外勤的鴉天狗這一類天狗的通性，我實在有些不擅於應付。不過來者是客，我會努力照顧好的！',
		name: '鴉天狗',
	},
	14: {
		chat: [
			'譁~雖然妖精是不用吃東西的，但是還是來叨擾啦！',
			'放心吧！雖然我們喜歡惡作劇，但是有那種東西在的店還是不會幹什麼的譁。',
			'那種東西指的是？……譁，就是門口那張，品味獨特的符紙……',
			'妖精和妖怪的區別？簡單地説，我們更加可愛一點！',
			'霧之湖最近來了外人，明明是妖怪卻用着奇怪的東西進行可疑的作業……',
		],
		description:
			'妖精其實不用吃東西，它們看見人吃美味的東西就模仿着吃。喜歡熱鬧、也喜歡惡作劇，千萬要注意彆着了它們的道！',
		name: '妖精',
	},
	1000: {
		chat: [
			'我們跑腿的只能在山上做些低端基本的工作。',
			'聽説鬼又開始在幻想鄉行動了？該不會捲土重來吧？',
			'居然跑來這種地方開店，真是知道怎麼給我們增加工作量啊。',
			'那些高級天狗的實力比我們強多了，我們護衞的意義到底在哪裏？',
		],
		description:
			'天狗的社會有嚴密的等級制度，山中侍衞這一職務基本都是由白狼天狗擔當。大概是職責所在，他們多數的性格比較嚴肅，但有時候喝多了也會口無遮攔。',
		name: '白狼天狗',
	},
	1001: {
		chat: [
			'看什麼看！再看挖了你的眼睛哦！',
			'山姥是沒有集團和組織，喜歡單獨行動的種族。',
			'這座山可不僅僅是天狗的東西。',
			'這世間居然有食堂這種存在，這個時代的大家已經懶得連飯也不做了嗎？',
		],
		description:
			'住在妖怪山上的非常孤僻的種族，哪怕是同族之間也幾乎沒有交流。有傳言説她們會抓走在山中迷路的小孩……但這是誤會，雖然她們經常撂狠話，可她們只是不善言談，其實是非常直爽善良的妖怪。',
		name: '山姥',
	},
	1002: {
		chat: [
			'河流什麼的，我們早就不在意了。',
			'玩模擬戰爭的遊戲把我給玩餓了！等我吃飽了回去再戰個痛快！',
			'區區住在河裏的兩棲類，是不會明白山上的樂趣。',
			'村子裏的經濟和山中的經濟是兩個完全不同的系統。',
		],
		description:
			'捨棄了河的河童，跑到妖怪之山的深處建立了大本營，依然是山上的專家！在經濟方面的研究尤其先進，構築着複雜的金錢系統，是我完全無法理解的領域。',
		name: '山童',
	},
	1003: {
		chat: [
			'魔法是一種超自然力，但歸根結底，其本核還是科學。',
			'遇到認識但幾乎沒有來往的人的時候，上前打招呼真是需要勇氣啊。',
			'進行魔法研究的時候必須全神貫注，為了不被打擾，魔法使幾乎都是獨居。',
			'修行魔法是很費錢的。如果我能早點學會舍食魔法，就能把吃飯的錢省下來研究魔法了。',
		],
		description:
			'魔法森林裏生長着許多有助於魔法使提高魔力的蘑菇，因此這裏住着好多魔法使。她們大多獨居，性格比較孤僻，大概魔法修行本身就是一件寂寞的事情吧~',
		name: '魔法使',
	},
	1004: {
		chat: [
			'森林裏的地穴探險非常有意思！不過基本都是些怕寒妖精的家。',
			'剛剛來的路上差點被食人牽牛花吞了，好險好險！',
			'長在樹上的妖怪西瓜你見過嗎？被砸到真的很痛啊。',
			'我的朋友吃了致幻蘑菇以後，居然產生了自己變成屎殼郎的幻覺，笑死我了！',
		],
		description:
			'妖精越多，大自然就會越有生機。魔法森林的各種物資都非常豐富，這是因為森林中寄宿許多妖精。據説每棵樹都有妖精寄宿其中。妖精多惡作劇也多，要小心才行呢。',
		name: '森之妖精',
	},
	1005: {
		chat: [
			'森林太潮濕了，感覺自己身上都要發黴了。',
			'無名之丘有一片美麗的鈴蘭花田，真想去看看啊。',
			'人類什麼的，我真是受夠了。',
			'森林裏不長記性的妖精太多了，到底什麼時候才能別把我當玩具啊。',
		],
		description:
			'來歷不明的人偶。暫時還不確定是不是付喪神。畢竟森林裏住着一位能夠操縱人偶的魔法使……但這些人偶看起來實在不像是被操縱的，大概還是付喪神吧？',
		name: '迷之人形',
	},
	2000: {
		chat: [
			'我也想變得像山女小姐一樣受歡迎啊~',
			'這麼明亮的洞窟真是第一次見啊。',
			'店裏要是出現蟲子的話，我可以幫你解決哦。',
			'疾病其實是調味料哦。',
		],
		description:
			'潛伏在黑暗風穴內的土蜘蛛。雖然大多數性格讓人難以理解，但對待建築事業的態度十分認真虔誠，同伴之間也會經常探討建築學的問題。值得我學習呢。',
		name: '土蜘蛛',
	},
	2001: {
		chat: [
			'能喝酒的地方越多越好~',
			'地上現在還有能夠退治鬼的專家嗎？',
			'這兒的熱鬧程度完全不亞於舊地獄街道上的酒館啊。',
			'小麻雀——快把酒滿上吧——',
		],
		description:
			'遠古時期就已經存在、傳説中幻想鄉最強的妖怪種族！但其實已經離開幻想鄉很久了，沒想到原來是盤踞在地底世界。鬼族性格爽朗但兇猛，絕對不能對他們説謊哦！',
		name: '鬼',
	},
	2002: {
		chat: [
			'那個橋姬每個晚上都在釘稻草人，怪嚇人的。',
			'再美的皮相，其實都是浮雲。',
			'取悦自己才是最重要的。',
			'既然決定要遊戲人間，怎麼能沒有美食相伴~',
		],
		description:
			'非常擅長打扮的姐姐們，談吐温柔又成熟。手上總是執着一盞牡丹花燈，據説可以迷惑過路的人類。實際上在洞穴遇到時，會幫我照亮前面的路。',
		name: '骨女',
	},
	2003: {
		chat: [
			'看守灼熱地獄的那隻烏鴉變成了三隻足，看起來太奇怪了。',
			'你家的生意就像地獄一樣紅紅火火咧。',
			'烏鴉曾經也是被供奉的神鳥，一朝走下神壇就成了不祥之鳥。',
			'鳥腦袋是從什麼時候開始變成了笨蛋的代名詞？',
		],
		description:
			'棲息於舊地獄最深處的地獄鴉。住在舊地獄的妖怪基本上都是因為原住地成了廢墟，繼而遷居於此，但地獄鴉本來就住在地獄，是這裏最早的住民。',
		name: '地獄鴉',
	},
	2004: {
		chat: [
			'姑獲鳥，姑獲鳥抱走孩子；夏獲鳥，夏獲鳥收養孩子~',
			'不要的指甲可以給我哦。',
			'姑獲鳥、鬼車鳥、九頭鳥，這是三種妖怪啦。',
			'把孩子的衣服晾在外面就是暗號。',
		],
		description:
			'傳説中穿上羽毛就是鳥，脱下羽毛就會變成少女的妖怪。通過收集別人的指甲可以預知福禍，所以從事占卜業的很多。大概是為了保持神秘，説話總是神神叨叨的。',
		name: '姑獲鳥',
	},
	2005: {
		chat: [
			'捕獵雖然有趣，偶爾這樣吃吃飯也不錯。',
			'這家店的主人居然是麻雀——',
			'不想成為別人的盤中餐，就好好做好盤中餐吧~',
			'麻雀究竟能做出什麼樣的料理呢~',
		],
		description:
			'野性十足的妖獸。性格爽朗而任性。出於種族天性，我有點害怕她們……不過，雖然豹子本身的實力很強大，但能成為妖怪的數量似乎並不多。',
		name: '豹女',
	},
	3000: {
		chat: [
			'所謂“酒肉穿腸過，佛祖心中留”嘛。',
			'白天的命蓮寺非常安靜莊嚴，晚上卻很熱鬧。',
			'住持會定期在寺廟裏舉辦怪談大會，相當刺激哦。',
			'佛心傳法，聲若雷霆。',
		],
		description:
			'人類可能不太瞭解，但我知道……命蓮寺的修行僧幾乎都是妖怪。雖説也會進行什麼六個菠蘿蜜的修行，但誰也沒看出究竟有什麼效果，不少妖怪在修行之外依然我行我素。',
		name: '僧侶',
	},
	3001: {
		chat: [
			'村子裏關於耗子藥的使用已經普及，不能掉以輕心啊。',
			'我們的老大住在一個到處都埋着寶藏的神秘之地。',
			'“芝士上的洞都是被老鼠咬出來的”這種謠言究竟是誰傳出來的？',
			'這世上沒有我們找不到的東西。',
			'我們認為是寶藏的東西，人類總不這樣認為。',
		],
		description:
			'幻想鄉隨處可見的探寶者。要是能和它們打好關係，以後就不用擔心丟東西了。不過委託它們尋找食物的話，可能會在拿回來之前就被它們啃光。',
		name: '妖怪鼠',
	},
	3002: {
		chat: [
			'對妖怪來説，沒有存在感就和人類患上絕症一樣。',
			'光長個不長肉也不一定好啊。',
			'每次我們説想要增肥，都會被認為是在炫耀……',
			'如果失去標誌性的裝束，我們還會被稱為八尺大人嗎？',
			'妖怪的改革也是很艱難的。',
		],
		description:
			'身長八尺的鬼怪，總是戴着一頂寬檐帽所以皮膚很白。過去還喜歡穿白色連衣裙，結果白天的時候存在感很低，幾乎整個種族都餓瘦了。現在有些上進的也開始尋找其他更能增加注視的服飾了。',
		name: '八尺大人',
	},
	3003: {
		chat: [
			'傳説廟裏的那位聖人就是曾經名滿天下的貴人。',
			'聖人今天也傾聽了我的煩惱，為我指點迷津。',
			'在哪裏能買到聖人同款耳機呢？',
			'要是真的清心寡慾就不會想要成仙了吧？',
			'修仙路漫漫，還是先填飽肚子吧！',
		],
		description:
			'在神靈廟裏有不少拜神子為師，希望學習仙術的弟子。不過似乎只被支使用來打雜。看起來總是一副鬥志昂揚、雄心勃勃的樣子……説不定打雜也是一個很有趣的工作？',
		name: '道士',
	},
	3004: {
		chat: [
			'碟子……不許吃……',
			'要腐爛了……',
			'曾經有誰對我説過……要好好吃飯才能快高長大……',
			'有好多事都想不起來了……',
			'要記住……只能吃碟子上的東西……',
		],
		description:
			'受邪仙操縱的殭屍。雖然是屍體但是不會腐爛，擁有比生前更強勁的力量。腦子不太好使，想與之溝通也很困難，但勝在不挑食。據説人類要是被咬到會暫時變成它們的同類，感覺還挺有趣的。就像“殭屍體驗卡”？',
		name: '殭屍',
	},
	3005: {
		chat: [
			'沒想到在仙界也能感受到市井煙火氣。',
			'我什麼時候也能有自己的仙界呢？',
			'終於把那個纏人的死神甩掉了……',
			'人類長壽一些難道是什麼罪過嗎？',
			'好不容易把今日要誦讀的萬遍真言給唸完了……',
		],
		description:
			'通過長年累月的修行獲得超越常人能力的人類，對很多妖怪來説是上等佳餚，活得可謂是多災多厄了。大概是因為活得太艱難，所以他們的性格都有些古怪……',
		name: '仙人',
	},
	4000: {
		chat: [
			'美食的傳承離不開挑剔的美食家。',
			'地上是不是有很多這樣的店呢……',
			'差不多也該出去走走了。',
			'現在的社會無論什麼種族都能這樣歡聚一堂嗎？',
		],
		description:
			'傳説中是少彥名神的後裔一族，身長只有一寸左右。因為一直在城裏沒有出去過，所以普遍缺乏常識，但擁有很強的求知心，對外界十分嚮往。',
		name: '小人族',
	},
	4001: {
		chat: [
			'俺已經聞到飯香啦！',
			'所有的鄉愁都是因為饞。',
			'之後該怎麼辦呢……',
			'差不多也該考慮考慮以後了……',
		],
		description:
			'正邪從幻想鄉四處蠱惑來的各種族男性，幾乎都是對未來感到迷茫的年輕人，對於正邪提出的“宏圖偉業”感到熱血沸騰而追隨於她。但似乎現在更加迷茫了……',
		name: '不良少年',
	},
	4002: {
		chat: [
			'之後該怎麼辦呢……',
			'差不多也該考慮考慮以後了……',
			'要是我足夠努力也能開個這樣的店嗎？',
			'只是坐下來就已經覺得胃裏暖暖的。',
		],
		description:
			'正邪從幻想鄉四處蠱惑來的各種族女性，幾乎都是對未來感到迷茫的年輕人，對於正邪提出的“宏圖偉業”感到熱血沸騰而追隨於她。但似乎現在更加迷茫了……',
		name: '不良少女',
	},
	4003: {
		chat: [
			'最深刻體會到活着的快樂就是吃東西的時候。',
			'人生得意須盡歡，胡吃海塞需盡興。',
			'吃飽了才有力氣去守護。',
			'我可是聖誕節最受歡迎的禮物之一哦~',
		],
		description:
			'因為萬寶槌的力量而活過來的道具。似乎受哪位高人指點，將體內本該被回收的小槌魔力轉化成了自己的魔力，從此得到了真正的生命。',
		name: '玩具兵',
	},
	4004: {
		chat: [
			'鈴鈴到底是誰呢……',
			'以毒攻毒最美味了！',
			'鈴蘭的毒是神經的毒哦。',
			'那個燈籠和鈴蘭有點像呢~',
		],
		description:
			'寄宿在鈴蘭花中的妖精。每天都在致力於解開“梅蒂欣小姐説的鈴鈴究竟是誰”之謎，目前的懸賞已經高達九十九顆“史上最圓的石頭”，依然沒有人能解開謎題。',
		name: '鈴蘭花精',
	},
	4005: {
		chat: [
			'我最喜歡在花田玩捉迷藏遊戲了。',
			'居然在我們最愛的遊樂場裏建了一個食堂……',
			'託老闆娘的福，花田更熱鬧了！',
			'不要在花田裏留下垃圾哦！',
		],
		description:
			'寄宿在向日葵中的妖精。據説向日葵之所以一直向着太陽，就是因為她們偷偷躲在背後給花轉向。這一招把不少人類都騙倒了，是她們引以為傲的絕技。',
		name: '太陽花精',
	},
	4006: {
		chat: [
			'那顆星球，是叫B612嗎？',
			'這家店沒有包間嗎？',
			'我其實是個妖精美食家哦~',
			'我不是挑食，只是正好不愛吃那些口味。',
		],
		description:
			'寄宿在玫瑰花中的妖精。不知道她們從哪裏聽説，玫瑰是某顆星球上獨一份的、最嬌貴的花，於是掀起了要集體搬家的熱潮。不過還沒有妖精成功。',
		name: '玫瑰花精',
	},
	4007: {
		chat: [
			'我好恨吶——',
			'稍微用頭髮擋住眼睛，可以更輕鬆地把人嚇倒。',
			'這份怨恨，將流向……我的胃裏！',
			'吃飽了才好惡作劇。',
			'我只是裝得陰沉的樣子啦~',
		],
		description:
			'性質上介於幽靈和怨靈之間的靈。似乎因為離世的時候懷有怨恨，所以喜歡對人類惡作劇。夜晚在屋中看到一個人的影子來回走卻找不到人，就是影女搗的鬼。模樣看起來有些陰沉，其實都是裝出來的。',
		name: '影女',
	},
	5000: {
		chat: [
			'好久沒有人從“兔子洞”掉下來了。',
			'不知道那位小姐在地上過得怎麼樣呢……',
			'不同花色的我們性格其實也有點不同。',
			'我們的王總是温柔而睿智。',
		],
		description:
			'由魔界造物主的魔力所化的紙牌人。性格老實到木訥，即使沒有被安排工作也會非常自覺地去巡邏。另外總在期待着有什麼人從天而降的樣子，似乎和什麼兔子洞的故事有關？',
		name: '紙牌兵',
	},
	5001: {
		chat: [
			'沒什麼事可做呢～',
			'索性辭職去當個流浪藝人好了。',
			'真希望能品嚐更多美食吶。',
			'地上的小丑是怎麼樣的呢？',
		],
		description:
			'由魔界造物主的魔力所化的紙牌人，擔當着類似士兵長的職位。不僅沒有長官的架子，連能安排給士兵們的工作也沒有。整天在魔界各處遊蕩，比起士兵長，更像街頭藝人什麼的。',
		name: '小丑',
	},
	5002: {
		chat: [
			'帽子帽子扔鍋裏！',
			'帽子着火了——！',
			'沉迷工作時根本想不起來要吃飯。',
			'吃完再回去做帽子吧！',
		],
		description:
			'擅長制帽與剪裁的匠人。據説在保存制帽用的毛氈布時需要用到水銀，因此他們經常發生水銀中毒的抽搐現象，有時甚至會出現幻覺，所以被稱為瘋帽匠。但我知道，在瘋癲的外衣下是對自己作品的熱烈與執着。',
		name: '瘋帽匠',
	},
	5003: {
		chat: [
			'吃夜宵是不是有點不夠矜持啊？',
			'不能太耽於口腹之慾。',
			'老闆娘是新來的月之使者嗎？',
			'豐姬大人桃子吃得太多了……',
		],
		description:
			'居住在月之都的人。他們捨棄了壽命，致力於去除污穢以消除生死。但他們並非不老不死，也會因為事故和戰爭而死去，身上還是微微帶有一絲污穢。',
		name: '月人',
	},
	5004: {
		chat: [
			'好想念XX大人……',
			'XX大人應該沒有吃過這個吧？',
			'地上的兔子搗的確實是年糕吧？',
			'兔子們倒是不討厭污穢……',
		],
		description:
			'負責搗藥的月兔。看起來像是在搗年糕，但臼裏的東西其實是藥。搗藥的行為並不是為了產出有價值的藥，而是為了替某個人贖罪。因為一直重複着看起來毫無益處的勞動，積累了不少疲倦。',
		name: '搗藥兔',
	},
	5005: {
		chat: ['最近訓練強度是不是加大了呀……', '感覺我好像長出了肌肉。'],
		description:
			'負責月都警備工作的月兔。月之使者這個工作在月兔的一眾工作中相對紀律比較嚴格。為保證在關鍵時刻能與地上人進行交戰，它們需要接受非常嚴格的訓練，很不輕鬆。',
		name: '月之使者',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedGuestText>>>;
