import type { ILocalizedEffectText } from '@/domain/data/localization/types';

export const PARTNER_LOCALIZATION_JA = {
	14: {
		description:
			'古くから存在していた正直で元気な山彦。最近の人間たちは科学への迷信が深くなっているため、彼女はがっかりして僧侶になった。今は命蓮寺で修行をしているようで、ここ数年で知り合った音楽の同好でもある。',
		name: '幽谷響子',
	},
	18: {
		description:
			'人間の村にある古本屋「鈴奈庵」の店員で、店の主人の娘。彼女は妖怪に対して信じられないほどの情熱を持っており、かつ非常に積極的である。夜雀食堂に押しかけてパートタイムで働きたいと言う、実に奇妙な人間の女の子だ。',
		name: '本居小鈴',
	},
	19: {
		description:
			'神社を守っている狛犬。温厚でいつも笑顔でいて、見ているだけで疲れが取れる気がする。計算が得意なようだが、その優秀な特技が神社では活用されていないそうだ。それなら是非とも夜雀食堂に来てください！',
		effect: '【蘇我屠自古】の懲罰スペルカードのスタン効果を無効化する。',
		name: '高麗野あうん',
	},
	20: {
		description:
			'紅魔館で唯一の人間ではあるが、メイド長として屋敷のほぼすべての仕事を担当していると言われている……それでも、すべての仕事を完璧で瀟洒に行うことができる。そのご主人様が頼りないので、咲夜さんこそが紅魔館の代表であるという噂もある。',
		name: '十六夜咲夜',
	},
	21: {
		description:
			'月から来た妖怪兎。その気質は地上の妖獣とは大きく異なり、上品で背の高い姿をしている。性格は温厚だが、人間にはあまり近づかないようである。妖獣にしてはやや鈍いところがあり、よくてゐにいじめられている。',
		effect: '客からのチップが20%増加。パートナーとして出勤すると、レア客【レイセン】の懲罰スペルカードの持続時間を10秒に短縮する。',
		name: '鈴仙',
	},
	39: {
		description:
			'冥界の主に仕える庭師、警備、そして料理人…つまり、200由旬はある西行寺の庭を世話するだけでなく、西行寺家と主人の安全を守る必要もある。同時に食いしん坊である主人の食欲を満たさなければならない。どれを取っても重労働だし、夜雀食堂で癒せるといいな！',
		effect: 'まな板の料理が即座に完成する。',
		name: '魂魄妖夢',
	},
	1006: {
		description:
			'人間に厄が移らないように厄を集める厄神。神とあるが実は私と同じ妖怪である。妖怪なのに人間思いで不思議な方、そんな彼女が人間から排斥されるなんてかわいそうだ。最近は厄を抑える修行をするために、夜雀食堂でアルバイトをしている。',
		name: '鍵山雛',
	},
	1007: {
		description:
			'メイドの格好をしているがオーラが非常に強く、さすがは魔界の主が作った最上級の魔物だ。性格は率直で時に冷酷で凶暴な様子を見せているが、実はいい人である。アリスを理解しようと夜雀食堂にアルバイトに来た。心は優しい人なのだろう……',
		effect: '投げナイフで料理を運ぶ（飲み物も含む）。',
		name: '夢子',
	},
	2007: {
		description:
			'夜道を歩いていると突然真上から落ちてきて、頭にぶつかる古典的な妖怪。内向的な性格で狭いところが大好きなので、いつもバケツの中にいる。安心感があるのかな？口下手だがしっかりと修練に励んでいる。',
		effect: '【釣瓶落とし】で一般客を追い払っても悪影響はないが、お金はもらえない。',
		name: 'キスメ',
	},
	2008: {
		description:
			'三途の川の渡し人を務める死神で、幻想郷の人間の魂を渡すことを担当しているようだ。いつものんびり仕事をしていたため、修行として閻魔に旧地獄へ派遣され、今は夜雀食堂を手伝っている。怠惰だが性格はとてもさわやかで、おしゃべりも好きで付き合いやすい仲間だ。もう少し仕事に真剣になればいいのに。',
		effect: '【八重霧の渡り】仕事中はサボってしまうが、客が席に座ろうとすると即座にテーブルへ引き寄せる。【星熊勇儀】の所で温泉に入ると、その夜の仕事中はサボらなくなる。',
		name: '小野塚小町',
	},
	3006: {
		description:
			'入道を使役できる入道使い。命蓮寺の厨房担当で、頭脳明晰で沈着冷静な人物。元々は魔法修行をしていた人間らしいが、なぜか入道使いという珍しい妖怪になってしまっている。でも人間の心は一応残っているみたい。',
		effect: '【二人三脚】雲山を呼び出して一緒に働く。',
		name: '雲居一輪',
	},
	3008: {
		description:
			'死後邪仙に操られているキョンシー。防腐の呪文がかかっているから腐らない。性格は不明、自我はもうないのかな？よく誰にも分からないことをブツブツ言っているけれど、力仕事はとても上手！ちょっと大食いだけどね……',
		name: '宮古芳香',
	},
	4009: {
		description:
			'アゲハ蝶の妖精。普通の妖精よりは大人っぽいようで、なんだかミステリアスな感じも……気のせいかな？一見大人しくて優しいけれど根っからのイタズラ好き。仕事中はやらかさないようにしてほしい！',
		name: 'ラルバ',
	},
	4010: {
		description:
			'首を飛ばせるオーソドックスな妖怪ろくろ首！村で人間に混じって暮らしていて、プライドの高い性格から人間とも妖怪ともうまくやれず、危うく不良になるところだった……結局夜雀食堂に来ちゃった。決断力のある性格ですね。',
		effect: '【分頭行動】料理人として働くときは、赤蛮奇は頭を2つに分けて配膳と飲み物を担当する。配膳や飲み物担当のときは、頭を1つ分けて別の作業を行う。頭の数が減るほど移動速度は上がり、作業速度は下がる。また、【少名針妙丸】の“万宝槌の力”を受けると、移動速度が200%上昇する。',
		name: '赤蛮奇',
	},
	5006: {
		description:
			'夢の世界を支配する貘。普段は夢の世界に生息し、秩序を守るために生き物の夢を監視している。',
		effect: '【夢捕りの網】客の評価に応じて夢のエネルギーを生成し、ドレミーがそれを吸収すると、自身の調理速度と食材が返還される確率が上がる。',
		name: 'ドレミー',
	},
	5007: {
		description:
			'魔界の門番。魔界人の中ではあまり強くなく、気が弱くなりがちな気質のようだ。よく情に流されて魔界の住人を抜け出させていたとか。例えばエレン、ルイズ……アリスも当初はこっそり抜け出していたという。',
		effect: '【時めき商売繁盛】、「烈火衝天」状態のとき、サラは一般客の来店を阻止し、定期的に幻想郷中からランダムにレア客を招待する。',
		name: 'サラ',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedEffectText>>>;
