import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const PARTNER_LOCALIZATION_JA = {
	14: {
		description:
			'古くから存在していた正直で元気な山彦。最近の人間たちは科学への迷信が深くなっているため、彼女はがっかりして僧侶になった。今は命蓮寺で修行をしているようで、ここ数年で知り合った音楽の同好でもある。',
		name: '幽谷響子',
	},
	18: {
		description:
			'人間の村にある古本屋「鈴奈庵」の店員で、店の主人の娘。彼女は妖怪に対して信じられないほどの情熱を持っており、かつ非常に積極的である。夜雀食堂に押しかけてパートタイムで働きたいと言う、実に奇妙な人間の女の子だ。',
		name: '本居小鈴',
	},
	19: {
		description:
			'神社を守っている狛犬。温厚でいつも笑顔でいて、見ているだけで疲れが取れる気がする。計算が得意なようだが、その優秀な特技が神社では活用されていないそうだ。それなら是非とも夜雀食堂に来てください！',
		name: '高麗野あうん',
	},
	20: {
		description:
			'紅魔館で唯一の人間ではあるが、メイド長として屋敷のほぼすべての仕事を担当していると言われている……それでも、すべての仕事を完璧で瀟洒に行うことができる。そのご主人様が頼りないので、咲夜さんこそが紅魔館の代表であるという噂もある。',
		name: '十六夜咲夜',
	},
	21: {
		description:
			'月から来た妖怪兎。その気質は地上の妖獣とは大きく異なり、上品で背の高い姿をしている。性格は温厚だが、人間にはあまり近づかないようである。妖獣にしてはやや鈍いところがあり、よくてゐにいじめられている。',
		name: '鈴仙',
	},
	39: {
		description:
			'冥界の主に仕える庭師、警備、そして料理人…つまり、200由旬はある西行寺の庭を世話するだけでなく、西行寺家と主人の安全を守る必要もある。同時に食いしん坊である主人の食欲を満たさなければならない。どれを取っても重労働だし、夜雀食堂で癒せるといいな！',
		name: '魂魄妖夢',
	},
	1006: {
		description:
			'人間に厄が移らないように厄を集める厄神。神とあるが実は私と同じ妖怪である。妖怪なのに人間思いで不思議な方、そんな彼女が人間から排斥されるなんてかわいそうだ。最近は厄を抑える修行をするために、夜雀食堂でアルバイトをしている。',
		name: '鍵山雛',
	},
	1007: {
		description:
			'メイドの格好をしているがオーラが非常に強く、さすがは魔界の主が作った最上級の魔物だ。性格は率直で時に冷酷で凶暴な様子を見せているが、実はいい人である。アリスを理解しようと夜雀食堂にアルバイトに来た。心は優しい人なのだろう……',
		name: '夢子',
	},
	2007: {
		description:
			'夜道を歩いていると突然真上から落ちてきて、頭にぶつかる古典的な妖怪。内向的な性格で狭いところが大好きなので、いつもバケツの中にいる。安心感があるのかな？口下手だがしっかりと修練に励んでいる。',
		name: 'キスメ',
	},
	2008: {
		description:
			'三途の川の渡し人を務める死神で、幻想郷の人間の魂を渡すことを担当しているようだ。いつものんびり仕事をしていたため、修行として閻魔に旧地獄へ派遣され、今は夜雀食堂を手伝っている。怠惰だが性格はとてもさわやかで、おしゃべりも好きで付き合いやすい仲間だ。もう少し仕事に真剣になればいいのに。',
		name: '小野塚小町',
	},
	3006: {
		description:
			'入道を使役できる入道使い。命蓮寺の厨房担当で、頭脳明晰で沈着冷静な人物。元々は魔法修行をしていた人間らしいが、なぜか入道使いという珍しい妖怪になってしまっている。でも人間の心は一応残っているみたい。',
		name: '雲居一輪',
	},
	3008: {
		description:
			'死後邪仙に操られているキョンシー。防腐の呪文がかかっているから腐らない。性格は不明、自我はもうないのかな？よく誰にも分からないことをブツブツ言っているけれど、力仕事はとても上手！ちょっと大食いだけどね……',
		name: '宮古芳香',
	},
	4009: {
		description:
			'アゲハ蝶の妖精。普通の妖精よりは大人っぽいようで、なんだかミステリアスな感じも……気のせいかな？一見大人しくて優しいけれど根っからのイタズラ好き。仕事中はやらかさないようにしてほしい！',
		name: 'ラルバ',
	},
	4010: {
		description:
			'首を飛ばせるオーソドックスな妖怪ろくろ首！村で人間に混じって暮らしていて、プライドの高い性格から人間とも妖怪ともうまくやれず、危うく不良になるところだった……結局夜雀食堂に来ちゃった。決断力のある性格ですね。',
		name: '赤蛮奇',
	},
	5006: {
		description:
			'夢の世界を支配する貘。普段は夢の世界に生息し、秩序を守るために生き物の夢を監視している。',
		name: 'ドレミー',
	},
	5007: {
		description:
			'魔界の門番。魔界人の中ではあまり強くなく、気が弱くなりがちな気質のようだ。よく情に流されて魔界の住人を抜け出させていたとか。例えばエレン、ルイズ……アリスも当初はこっそり抜け出していたという。',
		name: 'サラ',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
