import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const PARTNER_LOCALIZATION_KO = {
	14: {
		description:
			'오래전부터 계곡에서 살아온 정직하고 낙천적인 야마비코. 인간들이 그녀에게서 과학으로 신앙심을 바꾼 것에 실망해서, 명련사에서 지내고 있지. 우리는 음악에 대해 관심이 맞아서, 벌써 친구가 된지 몇년이나 지났어.',
		name: '카소다니 쿄코',
	},
	18: {
		description:
			'영나암 대본소에서 일하는 주인의 딸. 요괴에 대해 믿을 수 없을 만한 열정과 견해를 가지고 있어. 내 가게에서도 일하고 싶어 하지. 정말 대단한 소녀야.',
		name: '모토오리 코스즈',
	},
	19: {
		description:
			'하쿠레이 신사를 지키는 코마이누. 항상 낙천적이고 웃고 있어서, 볼 때마다 내 피로가 사라지는 것 같아. 그리고 계산도 잘 하는것 같고. 이렇게 훌륭한 녀석이 신사에서 신앙받지 못한다면, 내 가게에서 빛나게 해주겠어!',
		name: '코마노 아운',
	},
	20: {
		description:
			'홍마관에서 메이드로 일하고 있는 유일한 인간. 거의 모든 일을 다 도맡아 한다고 하는데, 그럼에도 신속하고 정확하게 해낸대. 사쿠야씨가 저택의 공식 대리인이라는 말이 있는데, 그녀의 주인을 믿을 수 없기 때문이려나?',
		name: '이자요이 사쿠야',
	},
	21: {
		description:
			'달의 도시에서 온 달토끼. 우아하고 높은 자태로 지상의 토끼 요괴와는 많이 달라. 성격은 온화하지만, 인간과는 친하지 않은 것 같고, 요괴치고는 반응이 빠르지 않아 테위에게 늘 장난을 당하지.',
		name: '레이센 우동게인 이나바',
	},
	39: {
		description:
			'명계의 주인을 섬기는 정원사이자 경비원이자 요리사... 즉 넓디넓은 백옥루의 안뜰을 관리할 뿐만 아니라, 사이교우지 가문과 주인의 안전을 지킬 필요가 있고, 동시에 대식가인 주인님의 욕구도 채워야 해. 어떤것이든 힘들어 보여. 내 가게에서 약간의 치유라도 받을 수 있으면 좋겠네!',
		name: '콘파쿠 요우무',
	},
	1006: {
		description:
			'불운이 인간에게 전이되는 걸 막기 위해 불운을 모으는 액신. 그녀는 명목상으로만 여신일 뿐이고, 사실은 나 같은 요괴에 더 가까워. 그녀같은 영혼이 인간들에게 거부당했음에도 불구하고 인간들을 도우려고 한다니, 정말 믿을 수 없는 일이야. 최근 자신의 저주를 억누르기 위해 내 가게에서 일하기 시작했어.',
		name: '카기야마 히나',
	},
	1007: {
		description:
			'그녀는 메이드같은 복장을 하고 있지만, 사납고 위험해. 마계의 통치자가 창조한 가장 강력한 피조물이라는 칭호를 받을 만 하지. 솔직하고 때로는 차갑게 행동하지만 사실 마음씨는 따뜻해. 그녀는 앨리스에 대해 알기 위해 내 가게에 일하러 왔다고 해. 그녀는 정말 친절... 하겠지...?',
		name: '유메코',
	},
	2007: {
		description:
			'밤길을 걷다가 갑자기 떨어져 머리에 부딪히는 고전적인 요괴. 내성적이고 좁은 곳을 좋아해서 항상 통 안에 있는 것 같은데, 안정감이 있나? 말은 잘 못하지만 열심히 수련하고 있어.',
		name: '키스메',
	},
	2008: {
		description:
			'삼도천을 건너는 뱃사공을 맡은 사신은 인간의 영혼을 인도하는 일을 전담하는 것 같아. 일하는 태도가 언제나 나빠서 염마에 의해 지령전에 왔지만, 결국 내 야작식당을 전전긍긍하지. 게으른 성격이지만 시원시원하고 수다도 잘 해. 일을 조금만 더 열심히 했으면 좋겠어.',
		name: '오노즈카 코마치',
	},
	3006: {
		description:
			'명련사의 주방을 맡고 있는 뉴도사야. 이치린씨는 똑똑하고 침착하셔. 원래는 주술을 외우는 인간이셨다는데, 왜 뉴도사라는 흔하지 않은 요괴가 된 걸까. 그래도 인간의 마음은 여전히 그대로인 것 같아.',
		name: '쿠모이 이치린',
	},
	3008: {
		description:
			'죽은 뒤 사선에게 조종당하는 강시라니. 심지어 방부 스펠을 붙여서 썩지도 않는대. 성격을 알지도 못하겠어. 아마 자아가 없는 것 같은데... 아무도 알아들을 수 없는 말을 중얼거리기도 하지만, 힘이 넘쳐서 일에는 제격이지! 다만 많이 먹는다는 게 문제지만……',
		name: '미야코 요시카',
	},
	4009: {
		description:
			'나비의 요정이야. 다른 요정보다 더 철이 들었다고 해야하나, 그래서 뭔가 이상한 느낌이 드는데...착각이겠지? 겉으로는 얌전하고 상냥하지만, 속으로는 장난을 엄청 좋아해. 식당에서 문제만 안 일으켰으면 좋겠네!',
		name: '이터니티 라바',
	},
	4010: {
		description:
			'머리를 날릴 수 있는 로쿠로쿠비야! 인간 마을에서 살아왔는데, 높은 자존심 때문에 잘 지내지 못했어. 불량배가 될 뻔 했지만...결국엔 내 식당에서 일하기로 했어. 결단이 빠른 사람이네.',
		name: '세키반키',
	},
	5006: {
		description:
			'꿈의 세계를 지배하고 있는 맥 요괴. 보통은 꿈의 세계에 살면서 생명체들의 꿈을 감시하고 있대.',
		name: '도레미',
	},
	5007: {
		description:
			'마계의 문지기야. 마계 사람치고는 생각보다 강하지 않고, 마음이 여린 편이야. 종종 엘렌씨나 루이즈씨 같은 분들을 몰래 나갈 수 있게 해주시고......앨리스씨도 몰래 나가게 해주셨대.',
		name: '사라',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
