import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const PARTNER_LOCALIZATION_ZH_TW = {
	14: {
		description:
			'自古以來就存在於山谷中的、正直又開朗的山彥。似乎因為現在的人類越來越迷信科學，她有些心灰意冷就出家了，如今在命蓮寺修行。是我近幾年認識的音樂同好。',
		name: '幽谷響子',
	},
	18: {
		description:
			'人間之里古書店“鈴奈庵”的店員以及店主之女。對妖怪懷有不可思議的熱忱且很有主見，以強勢的態度跑到夜雀食堂來打工，是個奇怪的人類小女孩。',
		name: '本居小鈴',
	},
	19: {
		description:
			'守護神社的狛犬。性格温和，臉上總是洋溢着笑容，看到她就感覺自己的疲勞都被治癒了。似乎還很擅長算賬。這麼優秀的孩子卻沒有在神社得到重視，那就到我的夜雀食堂來發光發亮吧！',
		name: '高麗野阿吽',
	},
	20: {
		description:
			'紅魔館中唯一的人類，擔任着女僕長一職，據説負責了館內幾乎所有的工作……即便如此，她也能把每件事都做得完美而瀟灑。因為主人不太可靠，有着咲夜小姐是紅魔館代言人的説法。',
		name: '十六夜咲夜',
	},
	21: {
		description:
			'來自月亮的妖怪兔，有着優雅而挺拔的身姿，和地上的妖獸的氣質大不相同。性格温和但似乎不太親近人類，以妖獸來説反應也不算快，總是被帝欺負。',
		name: '鈴仙',
	},
	39: {
		description:
			'侍奉着冥界之主的庭師兼侍衞、廚師……也就是説，她不僅要一個人照顧兩百由旬的西行寺庭院，還要守衞西行寺家以及主人的安危，同時還要照顧大胃王主人的飲食需求！無論哪一個都是重擔呢，希望她能在夜雀食堂得到一些治癒吧！',
		name: '魂魄妖夢',
	},
	1006: {
		description:
			'為了不讓厄運轉移到人類身上而收集厄運的厄神。雖然名字裏有個神，但其實和我一樣是妖怪。明明是妖怪卻滿心滿意為人類着想，真不可思議。這樣的她還要遭受人類的排斥，實在太可憐了。最近為了進行抑制厄的修行而到夜雀食堂打工。',
		name: '鍵山雛',
	},
	1007: {
		description:
			'雖然是女僕打扮，但氣勢非常強，不愧是魔界之主創造的最高級的魔物。性格直爽，有時候表現出一副冷酷兇狠的樣子，其實是刀子嘴豆腐心。因為想要理解愛麗絲，所以來到夜雀食堂打工。內心應該是一個很温柔的人吧……',
		name: '夢子',
	},
	2007: {
		description:
			'走在夜路上的時候突然從正上方掉落，撞在頭頂上的古典的妖怪。性格內向，非常喜歡狹窄的地方所以一直都在桶裏，似乎是這樣比較有安全感？雖然不善言辭，但確實在努力地修煉着呢。',
		name: '琪斯美',
	},
	2008: {
		description:
			'擔任三途之河的擺渡人一職的死神，似乎專門負責引渡幻想鄉中人類的靈魂。因為工作態度總是不緊不慢的樣子，被閻魔派來舊地獄歷練，最後輾轉來到了夜雀食堂。雖然懶惰成性，不過性格非常爽朗，也愛聊天，是個很好相處的夥伴。如果工作能再認真一點就好了。',
		name: '小野塚小町',
	},
	3006: {
		description:
			'能夠使役入道的入道使，命蓮寺的後廚擔當。一輪小姐頭腦明晰，沉着冷靜。據説原本是個修煉魔法的人類，不知道為什麼變成了入道使這種少見的妖怪，但似乎依然保留着人類的心。',
		name: '雲居一輪',
	},
	3008: {
		description:
			'死後被邪仙操縱着的殭屍，因為被施加了防腐的咒語所以不會腐爛。性格不明，大概已經沒有自我了吧？經常唸叨一些誰也聽不懂的話，不過幹活的力氣很大！就是吃得有點多……',
		name: '宮古芳香',
	},
	4009: {
		description:
			'鳳蝶的妖精。性格似乎比一般的妖精要成熟，而且有種迷霧重重的感覺……應該是錯覺吧？雖然看起來嫺靜温厚，不過骨子裏還是喜歡惡作劇，希望她工作的時候不會搗蛋吧！',
		name: '拉爾瓦',
	},
	4010: {
		description:
			'能讓頭飛出去的古典妖怪轆轤首！在村落裏混在人類當中生活，性格方面自尊心有點高，與人類和妖怪都沒法打成一片，差點就去當不良少女了……結果卻來了夜雀食堂，真是個果決的性格呢。',
		name: '赤蠻奇',
	},
	5006: {
		description:
			'支配着夢境世界的夢貘。平時棲息於夢境世界，為了維護秩序而監視着生物的夢。',
		name: '哆來咪',
	},
	5007: {
		description:
			'魔界的守門人。在魔界人之中實力不太強，性格很容易心軟。經常作順水人情放走偷溜出來的魔界住民，比如愛蓮、露易茲……據説愛麗絲當初也是她偷偷放出去的。',
		name: '薩拉',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
