import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const CLOTHES_LOCALIZATION_JA = {
	23: {
		description:
			'闇に生きる妖怪らしい風格のコーディネート、とはいうが、実際は元々の衣装を黒く染めただけのシロモノ。眼帯がイイ感じだ。自宅のクローゼットで着替えることができる。',
		name: 'まっくろコーディネート',
	},
	24: {
		description:
			'上白沢慧音が生徒たちの古着や余った布で作った衣装。中国のある時代の、登校したての頃の女子が着る服装に似ている。自宅のクローゼットで着替えることができる。',
		name: 'チャイナ風制服',
	},
	25: {
		description:
			'博麗霊夢が物置きを掃除していたら見つけた、少し色あせた古い巫女装束。身につけるだけで巫女という身分の重みを感じられるが、だからといって絶対に巫女を名乗ってはいけない。自宅のクローゼットで着替えることができる。',
		name: '色あせた巫女装束',
	},
	26: {
		description:
			'パチュリー・ノーレッジがくれた暖かく着心地の良い部屋着。着ると二度と脱ぎたくなくなる。自宅のクローゼットで着替えることができる。',
		name: 'パジャマ',
	},
	27: {
		description:
			'蓬莱山輝夜がくれたフォーマルな訪問用の着物。着付けがなかなか大変。自宅のクローゼットで着替えることができる。',
		name: '着物',
	},
	31: {
		description:
			'博麗神社にある守矢神社の分社からなぜか手に入った衣装。外の世界で流行っているらしい。自宅のクローゼットで着替えることができる。',
		name: 'セーラー服',
	},
	54: {
		description:
			'2021年のハロウィンシーズンにログインするともらえる限定コスチューム。ハロウィンらしく、可愛くもおどろおどろしい雰囲気が演出されている。また、この服に着替えている間は、店舗の夜間の外装もハロウィン風になる。',
		name: 'ハロウィン特典コスチューム',
	},
	56: {
		description:
			'コンサートのために特注した「鳥獣伎楽」のコスチューム。自宅のクローゼットで着替えることができる。',
		name: 'アイドルコスチューム',
	},
	57: {
		description:
			'2022年春節のイベント期間中に配布された限定ドレス。赤と黄の配色が喜びと富を象徴しており、春が大地に戻り、自然が芽生えるこの日に思いを載せて祝福を収穫しよう。この服装に着替えた時、店の装飾も春節風になる。',
		name: '錦繍中華人形',
	},
	58: {
		description:
			'『東方夜雀食堂』は2021年に中国発ゲームで売上17位を獲得しました。プレイヤーの皆様のご支援に感謝し、格好いい執事服を作ってお礼を申し上げます。',
		name: '執事服',
	},
	59: {
		description:
			'2021年のクリスマスシーズンにログインするともらえる限定コスチューム。モコモコで暖かいうえに可愛さも確保。寒い冬にこんな色味を目にすれば、心までウキウキしちゃうね。この服に着替えている間は、店舗の夜間の外装もクリスマス風になる。',
		name: 'クリスマス特典コスチューム',
	},
	60: {
		description:
			'2023年ミスティアの日のイベント期間中にゲームにログインして獲得した限定ドレス。ふんわりかわいいスカートは純情かつ幻想的で、ミスティアの日や『東方夜雀食堂』Nintendo Switchプロジェクトの始動を祝して、記念の思いが込められている。',
		name: 'ふわふわスカート',
	},
	61: {
		description:
			'『東方妖精武踏祭』コラボ衣装。妖精風の可愛らしいスカートは、活気に満ちたデザイン。着用すれば悩みも吹き飛び、まるで自由気ままで無憂の妖精になったかのよう！着替えの際、店内の夜景は幻想的な雰囲気へと変化する。',
		name: '妖精服',
	},
	1001: {
		description:
			'外の世界で冬に着るセーラー服だそうですが、冬の冷たい空気に対抗するために、袖やスカートを長くしたり、濃い色のデザインをしたりして暖かくしています……。でも、どうして冬にセーラー服を着るの！？',
		name: '冬セーラー服',
	},
	1002: {
		description:
			'魔理沙さんが余暇を使ってデザインした服で、最近少し羽振りがいいので随分派手なデザインとなっています。次の異変の時には、これを着て霊夢さんに自慢すると言っていました。',
		name: '魔女服',
	},
	2001: {
		description:
			'花魁コンテストの戦利品。地底は強さを尊ぶので、花魁は地底で最も力の強い人を指す。それを着ることは最強に認められることを象徴しており、旧都ではかなり注目されていた。',
		name: '花魁浴衣',
	},
	2002: {
		description:
			'外側から見ると平凡だが、内側には点々とした星があり、非常に不思議で中二病たっぷりなマント！妖怪として、夜空に包まれると妙に安心感があります。',
		name: 'スターダストマント',
	},
	2500: {
		description:
			'パンク魂満載のライブ衣装！鳥獣伎楽の原点でもあります。いつかまた思う存分に歌って叫ぶ機会があるといいな！',
		name: 'パンクライブ衣装',
	},
	3001: {
		description:
			'村紗と共に旅をしていた船長の服。村紗の海上の人生の証明であり、船長としての名誉の表れでもある。自宅の更衣室で変更できる。',
		name: '船長服',
	},
	3002: {
		description:
			'仙人の雰囲気を醸し出しているスカート。薄く軽いシルクの質感が蝉の羽のようで、今にも蝶に化して飛んでいくように見える。自宅の更衣室で変更できる。',
		name: '仙女の服',
	},
	4003: {
		description:
			'花で編まれたドレス。 花にフラワーマスターの魔力が宿っていて、決して色あせない。',
		name: '花の恩返し',
	},
	4004: {
		description:
			'正邪が副番長のために用意した服。夜雀と音楽の要素を巧みに調和し、かっこいいだけでなく、個性もアピールできる。作り手の思い入れが伝わってくる。',
		name: '番長服',
	},
	5009: {
		description:
			'月の使者の軍楽隊のドレスは、身にまとうと威風堂々とした感じ！組み合わせた楽器はトランペットで、私の得意な楽器の一つでもありますよ！',
		name: '軍楽隊のドレス',
	},
	5010: {
		description:
			'ルイズさんが手がけたビーチでの休暇にふさわしい服装。日焼け止めや涼しさを考慮しながら、クラゲのようにふわふわとしたデザインを増やし、水に溶け込むと本当にクラゲになったような気分になります。',
		name: 'ビーチリゾートウェア',
	},
	9000: { description: null, name: null },
	9003: { description: null, name: null },
	[-1]: {
		description:
			'ミスティアがいつも着ている服。自宅のクローゼットで着替えることができる。',
		name: '夜雀の服',
	},
	[-2]: {
		description:
			'ミスティアの仕事着。逆にいえば、普段なら仕事外では着ない。自宅のクローゼットで着替えることができる。',
		name: '雀酒屋の従業員制服',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
