import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const CLOTHES_LOCALIZATION_KO = {
	23: {
		description:
			'어둠 속에 사는 요괴 풍의 옷입니다. 그냥 원래 입던 옷을 검게 염색한 것 뿐이지만, 안대는 꽤 괜찮은 것 같습니다. 집의 옷장에서 의상을 변경할 수 있습니다.',
		name: '검은 옷',
	},
	24: {
		description:
			'케이네가 학생들에게 교복을 만들어주고 남은 옷감을 모아 짠 교복입니다. 중국의 어느 시대에 있던 여자 교복 디자인을 차용한 것 같습니다. 집의 옷장에서 의상을 변경할 수 있습니다.',
		name: '중화풍 교복',
	},
	25: {
		description:
			'무녀가 창고를 청소하다가 발견한 낡은 무녀복입니다. 색이 약간 바랜 것 같습니다. 입기만 해도 무녀의 중압감이 몰려오는 것 같습니다. 집의 옷장에서 의상을 변경할 수 있습니다.',
		name: '빛바랜 무녀복',
	},
	26: {
		description:
			'파츄리에게서 받은 편안한 실내복입니다. 한 번 입으면 다시는 벗기 싫어질 정도로 편안합니다. 집의 옷장에서 의상을 변경할 수 있습니다.',
		name: '잠옷',
	},
	27: {
		description:
			'카구야에게서 받은 정갈한 기모노입니다. 한번 입고 벗는데만 해도 꽤 시간이 걸립니다. 집의 옷장에서 의상을 변경할 수 있습니다.',
		name: '손님용 기모노',
	},
	31: {
		description:
			'하쿠레이 신사에 있는 모리야 신사의 분사에서 주운 옷입니다. 바깥 세계에서 꽤 인기가 있는 스타일 같습니다. 집의 옷장에서 의상을 변경할 수 있습니다.',
		name: '세일러복',
	},
	54: {
		description:
			'2021년 할로윈에 게임을 플레이해서 얻을 수 있습니다. 할로윈풍으로 특별히 디자인되었으며, 귀엽고 무서운 분위기를 연출합니다. 집의 옷장에서 의상을 변경할 수 있습니다.',
		name: '할로윈 특별 복장',
	},
	56: {
		description:
			'콘서트를 위해 특별히 주문한 조수기악 코스튬입니다. 집의 옷장에서 의상을 변경할 수 있습니다.',
		name: '아이돌 의상',
	},
	57: {
		description:
			'2022년 춘절 이벤트 중 게임에 접속해 얻을 수 있는 한정 드레스로, 기쁨과 재물을 상징하는 빨강과 노란색의 배색과 함께 만물이 새로이 바뀌는 계절인 봄을 충분히 느껴봅시다. 이 옷을 입을 시, 가게 장식도 설날 분위기로 변경됩니다.',
		name: '비단 치파오',
	},
	58: {
		description:
			'이 2021년 중국 게임 중 매출 17위를 기록했습니다. 여러분의 성원에 감사드리며, 멋있는 집사복으로 감사의 마음을 전합니다! 앞으로도 잘 부탁드립니다!',
		name: '집사복',
	},
	59: {
		description:
			'2021년 크리스마스에 게임을 플레이해서 얻을 수 있습니다. 두텁고 푹신푹신한 옷으로, 따듯함과 동시에 귀여워보이기까지 합니다. 추운 겨울에 이런 밝은 색 옷을 입고 있으면 손님들 마음도 좋아지겠죠? 집의 옷장에서 의상을 변경할 수 있습니다.',
		name: '성탄절 특별 복장',
	},
	60: {
		description:
			'2023년 미스티아 캐릭터 기념일 이벤트 기간동안 접속해 얻은 옷입니다. 폭신한 케이크 드레스는 청순하면서 몽환적인 분위기를 자아내며, 미스티아의 캐릭터 기념일과 동방야작식당의 닌텐도 스위치 버전 출시를 기념하기 위해 만들어졌습니다.',
		name: '케이크 드레스',
	},
	61: {
		description:
			'《동방요정무도회》 콜라보 선물. 활력 넘치는 디자인에 요정 스타일이 물씬 풍기는 귀여운 드레스로, 입으면 모든 고민이 사라질 것만 같습니다. 마치 자유분방하고 아무 걱정이 없는 작은 요정이 된 것 처럼요! 착용 시 점포 내 야경이 환상적인 분위기로 바뀝니다.',
		name: '요정 옷',
	},
	1001: {
		description:
			'이 세일러복은 바깥세계의 추위에도 견딜 수 있도록 설계되었습니다. 당연히 따뜻하겠지만... 굳이 겨울에 세일러복을 입어야 할까요?',
		name: '겨울용 세일러복',
	},
	1002: {
		description:
			'마리사가 만든 맞춤 드레스입니다. 최근 많은 돈을 벌어서 그런지, 값이 비싸 보입니다. 다음 이변에 이걸 입고 나가 레이무에게 자랑할 거라고 합니다.',
		name: '마녀복',
	},
	2001: {
		description:
			'오이란 경기의 전리품. 지저는 힘을 존귀하게 여기므로 지저의 오이란은 힘이 가장 강한 자를 가리킵니다. 최강자로 인정받았음을 상징해, 옛 도시에선 눈에 띄네요.',
		name: '오이란 목욕 가운',
	},
	2002: {
		description:
			'겉은 밋밋해 보이지만 안쪽엔 별들이 줄지어 있어 신기하고 중2감이 물씬 풍기는 망토! 요괴에겐 밤하늘에 쌓여 묘한 안도감을 느낄 수 있는 기분을 줍니다.',
		name: '별무리 망토',
	},
	2500: {
		description:
			'펑크 소울이 충만하게 담긴 옷! 조수기악의 시작이나 다름 없으며, 기회가 된다면 계속 소리치고 노래하고 싶어!',
		name: '펑크 복장',
	},
	3001: {
		description:
			'과거 무라사와 함께 세계를 떠돌던 해적옷입니다. 무라사의 항해 경력을 보여주는 증거이자, 선장으로서의 생애를 보여주는 상징이 되기도 합니다. 지하실에 있는 옷장에서 갈아입을 수 있습니다.',
		name: '해적 선원복',
	},
	3002: {
		description:
			'선력이 은은하게 감도는 옷입니다. 매미의 날개처럼 얇고 가벼운 비단은 언제라도 나비처럼 날아갈 듯 합니다. 지하실에 있는 옷장에서 갈아입을 수 있습니다.',
		name: '선녀의 깃옷',
	},
	4003: {
		description:
			'예쁜 꽃들로 짜여진 치마. 꽃의 주인의 마법이 깃들어 있어서 절대 시들지를 않습니다.',
		name: '꽃의 보은',
	},
	4004: {
		description:
			'세이자가 그녀의 오른팔을 위해 준비한 옷. 불량하면서도 노래에 소질이 있는 밤참새의 요소를 절묘히 조합해냈습니다. 입으면 멋져 보일 뿐만 아니라 내재된 자아 또한 드러냅니다. 이 옷을 만든 사람이 엄청 공을 들였다는 걸 알 수 있습니다.',
		name: '반쵸 복장',
	},
	5009: {
		description:
			'달의 사자 군악대가 선물로 준 복장으로, 입기만 해도 위풍당당해지는 기분이 들어! 트럼펫을 담당하는 복장인데, 내게 딱 맞아!',
		name: '군악대 의복',
	},
	5010: {
		description:
			'루이즈씨가 직접 만들어준, 해변가에서 한가로운 휴일을 보낼 때 입기 좋은 옷. 자외선 차단과 개방감을 고려해, 해파리같이 하늘하늘한 디자인이 늘어났습니다. 물 속에서는 진짜로 해파리가 된 것 같네요.',
		name: '비치웨어',
	},
	9000: { description: null, name: null },
	9003: { description: null, name: null },
	[-1]: {
		description:
			'미스티아가 평소에 입는 옷입니다. 집의 옷장에서 의상을 변경할 수 있습니다.',
		name: '요스즈메복',
	},
	[-2]: {
		description:
			'미스티아가 작업할 때 입는 옷입니다. 보통 일하다가 갈아입습니다. 집의 옷장에서 의상을 변경할 수 있습니다.',
		name: '참새술 작업복',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
