import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const CLOTHES_LOCALIZATION_ZH_TW = {
	23: {
		description:
			'有着宵暗妖怪風格的服飾套裝。但其實只是把原來的衣服染黑了而已，眼罩倒是很有趣。可以在家裏的換衣間進行更換。',
		name: '黑色套裝',
	},
	24: {
		description:
			'上白澤慧音利用學童們用剩下的布料縫製而成的衣裳。似乎是中國某個時代，女孩子開始讀書時候穿的衣服。可以在家裏的換衣間進行更換。',
		name: '中華風校服',
	},
	25: {
		description:
			'博麗靈夢收拾倉庫時找到的有點褪色的舊巫女服。穿上後感覺自己多少能體會到巫女的身份之重，但絕不可以自稱巫女。可以在家裏的換衣間進行更換。',
		name: '褪色的巫女服',
	},
	26: {
		description:
			'帕秋莉·諾蕾姬送的舒服又保暖的家居服，穿上就不想脱下來了。可以在家裏的換衣間進行更換。',
		name: '睡衣',
	},
	27: {
		description:
			'蓬萊山輝夜送的制式嚴謹的訪問着，穿起來有點費勁。可以在家裏的換衣間進行更換。',
		name: '訪問着和服',
	},
	31: {
		description:
			'從位於博麗神社的守矢分社中離奇獲得的服飾，似乎在外界很流行。可以在家裏的換衣間進行更換。',
		name: '水手服',
	},
	54: {
		description:
			'在2021年萬聖節期間登錄遊戲獲得的限定晚裝，結合萬聖節的氣氛做了特別的設計，可愛又精怪，更換該服裝時，店鋪的夜間裝潢也會變成萬聖節風格。',
		name: '萬聖節特典晚裝',
	},
	56: {
		description:
			'為了演唱會特意趕製的“鳥獸伎樂”樂隊演出服。可以在家裏的換衣間進行更換。',
		name: '偶像服',
	},
	57: {
		description:
			'在2022年春節活動期間登陸遊戲獲得的限定禮服，紅黃配色象徵着喜氣與財富，在春回大地、萬象更新的這一天盡情收穫祝福吧。更換該服裝時，店鋪的夜間裝潢也會變成春節風格。',
		name: '錦繡中華娃娃',
	},
	58: {
		description:
			'《東方夜雀食堂》在2021年獲得國產遊戲銷量榜第17名，為感謝各位玩家的支持，特意製作了帥氣的執事服以表謝意！未來還請多多指教！',
		name: '執事服',
	},
	59: {
		description:
			'在2021年聖誕節活動期間登陸遊戲獲得的限定禮服，毛茸茸的非常暖和，在注重保暖的同時也沒有捨棄可愛。在冬日裏看到這樣一抹亮色，會讓人心情變得很好吧？更換該服裝時，店鋪的夜間裝潢也會變成聖誕節風格。',
		name: '聖誕節特典晚裝',
	},
	60: {
		description:
			'在2023年米斯蒂婭角色日活動期間登陸遊戲獲得的限定禮服。蓬鬆可愛的蛋糕裙既純真又夢幻，寄寓着希冀之情，為慶賀米斯蒂婭角色日及《東方夜雀食堂》Nintendo Switch企劃啓動，而特意製作的紀念物。',
		name: '蛋糕裙',
	},
	61: {
		description:
			'《東方妖精武踏會》的聯動禮物。洋溢着妖精風格的可愛小裙子，是充滿了活力的設計。穿上後能讓人一掃煩惱，彷彿自己也變成了自由自在、無憂無慮的小妖精！更換該服裝時，店鋪的夜間裝潢也會變成妖精風格。',
		name: '妖精服',
	},
	1001: {
		description:
			'聽説是外面世界冬季穿的水手服，為了對抗冬天的冷空氣，特意加長了袖子和裙子的長度，以及進行了深色的設計，看起來保暖多了……但是等等為什麼冬季還要穿水手服！？',
		name: '冬季水手服',
	},
	1002: {
		description:
			'魔理沙小姐用業餘的時間設計出來的衣服，因為她最近有了點錢，設計的方面就張揚了很多。她説如果下次異變的時候，就穿這個出去讓靈夢羨慕羨慕。',
		name: '魔女服',
	},
	2001: {
		description:
			'花魁比賽的戰利品。地底以強為尊，所以花魁在地底指的是力量最強大之人。穿上它象徵着得到最強者的認可，在舊都相當惹人注目。',
		name: '花魁浴衣',
	},
	2002: {
		description:
			'從外側看平平無奇，但是內側卻有着點點星辰，非常神奇甚至中二感滿滿的披風！作為妖怪，被夜空包裹會有種奇妙的安心感。',
		name: '星塵披風套裝',
	},
	2500: {
		description:
			'充滿朋克靈魂的演出裝束！是鳥獸伎樂的起點，真希望有機會可以繼續盡情的咆哮和歌唱啊！',
		name: '朋克演出服',
	},
	3001: {
		description:
			'曾經隨著村紗東飄西泊的船長服，是村紗海上生涯的重要見證，同時也是船長榮耀的象徵。可以在家裏的換衣間進行更換。',
		name: '海盜服',
	},
	3002: {
		description:
			'散發着縷縷仙氣的紗裙。輕盈的絲紗質感，薄如蟬翼，似乎隨時將化蝶飛去。可以在家裏的換衣間進行更換。',
		name: '仙女服',
	},
	4003: {
		description:
			'用鮮花編織的小裙子。鮮花上附着了花之主的魔力，故而永不凋謝。',
		name: '花的報恩',
	},
	4004: {
		description:
			'正邪為二把手準備的隊服。巧妙地融合了不良與夜雀、音樂的元素，穿起來帥氣非凡的同時還能彰顯自我。可以看出製作者花了不少心思。',
		name: '番長服',
	},
	5009: {
		description:
			'月之使者中軍樂隊的禮服，穿在身上有種威風凜凜的感覺！搭配的樂器是小號，也是我擅長的樂器之一哦！',
		name: '軍樂隊禮服',
	},
	5010: {
		description:
			'露易茲小姐親手設計的適合在海灘度假時穿的服裝。考慮了防曬和清涼的同時，還增加了許多像水母一樣輕飄飄的設計，融入水中就像真的變成了水母一樣。',
		name: '海灘度假裝',
	},
	9000: { description: null, name: null },
	9003: { description: null, name: null },
	[-1]: {
		description: '米斯蒂婭平常穿的衣服。可以在家裏的換衣間進行更換。',
		name: '夜雀服',
	},
	[-2]: {
		description:
			'米斯蒂婭工作時穿的衣服。一般情況下會在工作時換上。可以在家裏的換衣間進行更換。',
		name: '雀酒屋工作裝',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
