import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const INGREDIENT_LOCALIZATION_JA = {
	0: {
		description: '人間の里で育てられている鶏の卵。わりとよく見かける。',
		name: '卵',
	},
	1: {
		description: '人間の里で育てられた豚の肉。わりとよく見かける。',
		name: '豚肉',
	},
	2: {
		description: '人間の里で育てられた牛の肉。わりとよく見かける。',
		name: '牛肉',
	},
	3: { description: '山で狩られた鹿の肉。少し珍しい。', name: '鹿肉' },
	4: {
		description: '山で仕留められたイノシシの肉。野性溢れた味がする。',
		name: 'イノシシ肉',
	},
	5: {
		description: '人間の里の豆腐屋で売られている。わりとよく見かける。',
		name: '豆腐',
	},
	6: { description: 'どこにもあるような普通の馬鈴薯。', name: 'じゃがいも' },
	7: {
		description: '人間の里の畑で植えられている。わりとよく見かける',
		name: '玉ねぎ',
	},
	8: {
		description: '人間の里の畑で植えられている。わりとよく見かける',
		name: 'かぼちゃ',
	},
	9: {
		description: '人間の里の畑で植えられている。わりとよく見かける',
		name: '大根',
	},
	10: {
		description:
			'どこから流れ着いたのかよく分からない食材。わりとよく見かける。',
		name: '昆布',
	},
	11: { description: '淡水に生息する魚。わりとよく見かける。', name: 'マス' },
	12: {
		description:
			'幻想郷の川や湖で生息する海洋から回遊する魚。なぜかわりとよく見かける。',
		name: '八目鳗',
	},
	13: {
		description: '幻想郷の川や湖で生息する、海から回遊する魚。少し珍しい。',
		name: '鮭',
	},
	14: {
		description: '幻想郷の川や湖で何故か生息する海魚。少し珍しい。',
		name: 'マグロ',
	},
	15: {
		description: '高い山の奥で育てられている豚。非常に高級。',
		name: '黒豚肉',
	},
	16: {
		description:
			'世界最高峰の牛肉で、またの名を霜降り肉という。非常に高級。',
		name: '和牛',
	},
	17: {
		description:
			'魔法の森で採取されたキノコ。人工的に栽培できないため、とても珍しい。',
		name: 'キノコ',
	},
	18: {
		description:
			'魔法の森で採取されたトリュフ。人工的に栽培できないため、とても珍しい。',
		name: 'トリュフ',
	},
	19: { description: '最上級のマグロ。とても珍しい。', name: '特上マグロ' },
	20: {
		description:
			'高級な魚。毒があるため、気を付けて処理をしないといけない。',
		name: 'フグ',
	},
	21: { description: '桃の果実。わりとよく見かける。', name: '桃' },
	22: { description: '銀杏の果実。わりとよく見かける。', name: '銀杏' },
	23: {
		description: '霧の湖と玄武の沢に生息しているエビ。わりとよく見かける。',
		name: 'エビ',
	},
	24: {
		description: '木の上の蜂の巣から取れる蜂蜜。わりとよく見かける。',
		name: '蜂蜜',
	},
	25: {
		description: '木の上から採取できるセミの抜け殻。わりとよく見かける。',
		name: '蝉退',
	},
	26: { description: '湿原に育つ奇跡の花。とても珍しい。', name: '雲華' },
	27: { description: '明け方に採集された露。少し珍しい。', name: '露' },
	28: { description: '野外で採られた筍。わりとよく見かける。', name: '筍' },
	29: {
		description:
			'洋食でよく使う食材。抗えなくなるような、魅惑の香りを料理にもたらす。',
		name: 'バター',
	},
	30: {
		description: '様々な用途で使える便利な粉。わりとよく見かける。',
		name: '小麦粉',
	},
	31: {
		description:
			'迷いの竹林から採れる、緑滴る新鮮な竹。清涼感のある香りをもたらす。',
		name: '竹',
	},
	32: {
		description:
			'もちもちした米。噛みごたえのある料理のみならず、柔らかい口触りの料理を作ることもできる。',
		name: 'もち米',
	},
	33: {
		description:
			'永遠亭の特産品。満月の夜の月光を凝縮して作られる。とても珍しい。',
		name: '月光草',
	},
	34: {
		description:
			'氷精が作った氷。きらきらと輝いている。食材の保温にも使う。',
		name: '氷',
	},
	35: {
		description: '辛くしたいときに使う食材。その評価が両極端に分かれる。',
		name: '唐辛子',
	},
	36: {
		description: '紅魔館でワイン醸造用に栽培されている葡萄。',
		name: 'ぶどう',
	},
	1000: {
		description:
			'河童の嗜好品。料理に使う分には普通の野菜と変わらないが、河童を夢中にさせることができる。一体どんな成分が働いているのか……',
		name: 'きゅうり',
	},
	1001: {
		description:
			'柔らかくてかわいい海の生き物ですが、幻想郷には海がない……その足は圧倒的な歯ごたえがあり、一番簡単な直火焼きであっても、その弾力とおいしさが楽しめる！',
		name: 'タコ',
	},
	1002: {
		description:
			'外では伝説的な食材と言われているそうで、一つで海のおいしさ全てを感じさせるというのは本当だろうか。変な見た目をしているけど……',
		name: 'ウニ',
	},
	1003: {
		description:
			'何千万年も蓄積された火山のエネルギーは、あなたの魂を浄化する……と広告に書いてありますが、普通の岩塩である。',
		name: '黒塩',
	},
	1004: {
		description:
			'特殊な方法で処理された乳製品。これでどんな甘党もイチコロだ！',
		name: 'クリーム',
	},
	1005: {
		description:
			'カブトがあれば暴れられると思っていたお馬鹿さん。簡単な蒸しだけでも究極のおいしさになる！ハサミには気をつけて……',
		name: 'カニ',
	},
	2000: {
		description:
			'橋の近くに根茎が生え、成熟すると水面から花が顔を出す。淡紅色で淡い香りがする高級食材であり、地底人の祭りの飾りにもなる。',
		name: '共生の蓮',
	},
	2001: {
		description:
			'橋の近くの特別な木でしか産出しない奇妙な果実で、無表情で丸ごと食べられる人はいないという。強い「酸」の味がして、その果汁を取って味付けにするしかない。',
		name: 'レモン',
	},
	2002: {
		description:
			'濃厚なクリームを熟成させた貴重な食材は、一つ取って溶かすことで料理が香り豊かになり、美味しくなります。',
		name: 'チーズ',
	},
	3000: {
		description:
			'歴史の長い水生植物である蓮の種。蓮の実は苦いから、料理に混ぜないでうまく扱ってね。',
		name: '蓮の実',
	},
	3001: {
		description:
			'この世で一番実用的な食材！甘くて柔らかいだけじゃなくて、腹持ちも良く、さらに冬には手を温めてくれる。',
		name: 'さつまいも',
	},
	3002: {
		description:
			'外界では絶滅危惧種にされているが、幻想郷ではまだ普通と言われる赤松の種。松の実には寿命を伸ばす効果があるという伝説があり、古代の道士が断食するときによく使われていた。',
		name: '松の実',
	},
	3003: {
		description:
			'道教の開祖は修行中、肉が嫌いだったため、食事の代わりに栗を食べようと、栗の木をたくさん植えたという。栗は脂肪分が多く栄養価が高いため、道士たちに好かれているだけでなく、農民に食料の代わりとして使われることも多い。',
		name: '板栗',
	},
	4000: {
		description:
			'梅の実は塩漬けにも干し梅にもできる。 梅干しにすると、特別な塩味と酸味があり、食欲を大いに刺激し、唇や歯に甘い後味が残り、長い余韻を残すことができる。',
		name: '梅',
	},
	4001: {
		description:
			'赤豆とも呼ばれ、免疫力を高めることができる適応性の高い薬草である。 古人は、脳卒中や病気はすべて疫病のお化けの祟りだと考えていたため、「赤豆で鬼を払う」伝説がある。',
		name: '小豆',
	},
	4002: {
		description:
			'豪華絢爛な花々を束ねた花束。 花の命の上で成し遂げた生花に敬意を！',
		name: '生花',
	},
	4003: {
		description:
			'どこでもある山菜。有毒であるため、過剰摂取は推奨されず、食べる前に湯通しして調理する必要がある。',
		name: '香椿',
	},
	4004: {
		description:
			'色鮮やかな果実は、あまりの鮮やかさからかつては「キツネの実」とみなされ、猛毒があるとされていた。そのため、観賞用としてのみ利用されていた。 食べられることが分かってからは、大規模に栽培されるようになった。',
		name: 'トマト',
	},
	5000: {
		description:
			'カカオの木の実は、地域によって異なる風味があると言われている。果物の香りがしたり、スモークの風味がしたりする。粉にして食べることができ、チョコレートを作るための基本的な原料。',
		name: 'カカオ豆',
	},
	5001: {
		description:
			'魔界の土壌で育てられたブロッコリーは、光が足りず植物が徒長で、色も地上とは少し違う。',
		name: 'ブロッコリー',
	},
	5002: {
		description:
			'魔界のあちこちで見られる奇妙な果実。食べる人のタイプによって異なる食用効果が生じるようで、非常に奇妙だ。',
		name: 'ぷぷよ果実',
	},
	5003: {
		description:
			'薬食両用植物。オオイタビの種を浸して汁をこすり、冷蔵すると透き通った状体に固まる。ゼリーやところてんなどを作ることができ、暑さ対策の神品だ。',
		name: 'オオイタビ',
	},
	5004: {
		description:
			'花のように美しい菌類。歴代の王族貴族はシロキクラゲを延命の品と見ていたそうだが、月の都にはよく見られるようだ。この埃ひとつ落ちていないように見える純白さは、月の都の雰囲気とよくマッチしている。',
		name: 'シロキクラゲ',
	},
	5005: {
		description:
			'月の科学技術を使った極・辛口は、食べる人に恐怖の思い出を残すことができる。本当に唐辛子で作ったのかどうかははっきり言えませんが……',
		name: '唐辛子エキス',
	},
	11000: { description: null, name: null },
	11001: { description: null, name: null },
	11002: { description: null, name: null },
	11003: { description: null, name: null },
	11004: { description: null, name: null },
	11005: { description: null, name: null },
	11006: { description: null, name: null },
	11007: { description: null, name: null },
	[-1]: { description: '私はどこ？ここは誰？？なんで？？？', name: '鈴仙' },
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
