import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const INGREDIENT_LOCALIZATION_KO = {
	0: {
		description:
			'인간 마을의 잡화점에서 구할 수 있는 달걀입니다. 매우 흔합니다.',
		name: '계란',
	},
	1: {
		description: '인간 마을에서 기르는 가축의 고기입니다. 매우 흔합니다.',
		name: '돼지고기',
	},
	2: {
		description: '인간 마을에서 기르는 가축의 고기입니다. 매우 흔합니다.',
		name: '소고기',
	},
	3: {
		description: '산에서 잡은 사슴 고기입니다. 꽤 귀합니다.',
		name: '사슴 고기',
	},
	4: {
		description: '산에서 잡은 돼지 고기입니다. 야생의 맛이 느껴집니다.',
		name: '멧돼지 고기',
	},
	5: {
		description: '인간 마을의 두부가게에서 팝니다. 매우 흔합니다.',
		name: '두부',
	},
	6: {
		description: '인간 마을의 채소가게에서 팝니다. 매우 흔합니다.',
		name: '감자',
	},
	7: {
		description: '인간 마을의 채소가게에서 팝니다. 매우 흔합니다.',
		name: '양파',
	},
	8: {
		description: '인간 마을의 채소가게에서 팝니다. 매우 흔합니다.',
		name: '호박',
	},
	9: {
		description: '인간 마을의 채소가게에서 팝니다. 매우 흔합니다.',
		name: '무',
	},
	10: {
		description: '어디서 왔는지 모르는 이색적인 식재료입니다. 꽤 흔합니다.',
		name: '해초',
	},
	11: {
		description: '민물에 사는 물고기입니다. 매우 흔합니다.',
		name: '송어',
	},
	12: {
		description:
			'강이나 호수에 주로 사는 회유종 물고기입니다. 매우 흔합니다.',
		name: '칠성장어',
	},
	13: {
		description:
			'강이나 호수에 주로 사는 회유종 물고기입니다. 꽤 귀합니다.',
		name: '연어',
	},
	14: {
		description:
			'강이나 호수에 주로 사는 회유종 물고기입니다. 꽤 귀합니다.',
		name: '참치',
	},
	15: {
		description:
			'고지대의 산자락에서 자라는 돼지입니다. 굉장히 고급집니다.',
		name: '흑돼지 고기',
	},
	16: {
		description:
			'세계적으로 인정받은 최상급 품종의 소입니다. 굉장히 고급집니다.',
		name: '와규 소고기',
	},
	17: {
		description:
			'마법의 숲에서 채집한 상급의 버섯들입니다. 인위적으로 양식할 수 없어 매우 귀합니다.',
		name: '버섯',
	},
	18: {
		description:
			'마법의 숲에서 채집한 송로버섯입니다. 인위적으로 양식할 수 없어 매우 귀합니다.',
		name: '송로버섯',
	},
	19: {
		description: '최상급의 참치입니다. 매우 귀합니다.',
		name: '특상급 참치',
	},
	20: {
		description:
			'고급진 물고기입니다. 안에 독이 들어있습니다. 주의깊게 조리해야 합니다.',
		name: '복어',
	},
	21: {
		description: '인간 마을의 채소가게에서 팝니다. 매우 흔합니다.',
		name: '복숭아',
	},
	22: {
		description: '인간 마을의 채소가게에서 팝니다. 매우 흔합니다.',
		name: '은행',
	},
	23: {
		description:
			'안개 낀 호수와 현무의 계곡에 서식하는 민물새우입니다. 매우 흔합니다.',
		name: '새우',
	},
	24: {
		description: '인간 마을의 식료품점에서 팝니다. 매우 흔합니다.',
		name: '벌꿀',
	},
	25: {
		description: '인간 마을의 식료품점에서 팝니다. 매우 흔합니다.',
		name: '매미 허물',
	},
	26: {
		description: '늪 깊은 곳에서 자라는 기적의 꽃으로, 매우 귀합니다.',
		name: '우담바라',
	},
	27: {
		description:
			'이른 아침에만 채집할 수 있는 맑은 이슬입니다. 약간 귀합니다.',
		name: '이슬',
	},
	28: {
		description:
			'밖에서 쉬이 채집할 수 있는 죽순입니다. 마법의 숲과 미혹의 죽림 모두에서 자라며, 약간 흔합니다.',
		name: '죽순',
	},
	29: {
		description:
			'서양 요리에 자주 쓰이는 식재료입니다. 음식에 참기 힘들 정도로 맛있는 향미를 더해줍니다.',
		name: '버터',
	},
	30: {
		description: '여러 방면으로 사용할 수 있는 식재료입니다.',
		name: '밀가루',
	},
	31: {
		description:
			'미혹의 죽림에서 찾아볼 수 있는 녹색의 신선한 대나무입니다. 음식에 청량감을 더합니다.',
		name: '대나무',
	},
	32: {
		description:
			'쫀득쫀득한 쌀입니다. 쫄깃한 음식 뿐만 아니라 부드럽고 감칠맛 나는 음식을 만드는데도 사용됩니다.',
		name: '찹쌀',
	},
	33: {
		description:
			'영원정의 특산품입니다. 만월의 밤에 뜬 달빛을 한데 모았습니다. 매우 귀합니다.',
		name: '월광초',
	},
	34: {
		description: '얼음 요정이 만들어낸 얼음입니다. 반짝반짝 빛납니다.',
		name: '얼음',
	},
	35: {
		description:
			'매운 맛을 더하는데 사용되는 식재료입니다. 이 재료에 대한 사람들의 평은 엇갈립니다.',
		name: '고추',
	},
	36: {
		description: '홍마관에서 와인 양조용으로 재배하는 포도입니다.',
		name: '포도',
	},
	1000: {
		description:
			'캇파가 좋아합니다. 같은 채소인데... 왜 그렇게 집착할까요...?',
		name: '오이',
	},
	1001: {
		description:
			'흐물흐물하고 귀여운 바다 생물입니다. 환상향엔 바다가 없긴 하지만요... 문어발은 쫄깃한 식감을 가지고 있습니다. 그냥 굽기만 해도 식감을 느낄 수 있습니다.',
		name: '문어',
	},
	1002: {
		description:
			'바깥세계에서는 전설의 식재료로 여겨집니다. 단 하나로도 바다의 깊은 맛을 느낄 수 있다고 하지만... 과연 사실일까요? 좀 이상하게 생겼습니다...',
		name: '성게',
	},
	1003: {
		description:
			'수천 년간 쌓여온 화산의 기운으로 만들어져 더러워진 마음을 정화한다... 소개 문구엔 그렇게 적혀있지만, 사실 그저 평범한 화산 암염입니다.',
		name: '블랙솔트',
	},
	1004: {
		description:
			'특별한 방법으로 가공된 유제품입니다. 단 맛을 좋아하는 사람들에게 특히나 사랑받고 있습니다.',
		name: '크림',
	},
	1005: {
		description:
			'단단한 껍질과 8개의 다리를 가진 귀여운 생물입니다. 그저 찌기만 해도 맛있는 음식이 됩니다! 그래도 집게발은 조심해야겠네요...',
		name: '게',
	},
	2000: {
		description:
			'연근은 다리 근처에서 자라고, 꽃은 물 위에서 익어 아름답게 핍니다. 연한 붉은색이며 은은한 향기가 감돌아 고급 식재료로 쓰이고, 때로는 축제 장식으로도 사용합니다.',
		name: '쌍연꽃',
	},
	2001: {
		description:
			'다리 근처 특별한 나무에서만 나는 열매입니다. 그냥 먹으면 얼굴이 찌푸려질 정도로 신맛이 강해, 주로 과즙으로 간을 하는 용도로 사용합니다.',
		name: '레몬',
	},
	2002: {
		description:
			'크림을 숙성시켜 만든 귀한 식재료입니다. 향과 맛이 풍부해 한 조각으로도 깊은 맛을 낼 수 있습니다.',
		name: '치즈',
	},
	3000: {
		description:
			'아주 오래된 수생 식물—— 연꽃의 씨앗. 연밥의 속은 매우 쓰니, 조리하지 않은 채로 손님에게 대접하지 마세요.',
		name: '연밥',
	},
	3001: {
		description:
			'세상에서 가장 실속 있는 식재료입니다! 달콤하고 부드러울 뿐만 아니라, 배고픔도 해결할 수 있고, 겨울에는 손도 따뜻하게 해주죠.',
		name: '고구마',
	},
	3002: {
		description:
			'소나무의 씨앗은 바깥 세계에선 멸종 위기종으로 분류되었지만, 환상향에서는 여전히 흔한 종입니다. 잣은 장수하는 효능이 있어, 고대 도사들이 항상 구비해둔 물건이었다고 합니다.',
		name: '잣',
	},
	3003: {
		description:
			'도교의 창시자는 수련할 때 고기를 싫어했기 때문에, 그 대신 밤나무를 심었다고 합니다. 쌀 대신 밤을 사용할 정도였다고 하죠. 밤은 알이 크고, 영양가도 풍부하여 많은 도교인들에게 극찬을 받았을 뿐 아니라, 농민들의 식량으로도 자주 활용됩니다.',
		name: '약밤',
	},
	4000: {
		description:
			'매실나무의 열매는 소금에 절이거나 말려서 매실만의 특별한 짠 맛과 신 맛으로 식욕을 크게 자극시킬 수 있습니다. 한 입 먹고 나면 입 겉과 속 모두 단 맛의 여운이 끊기지를 않죠.',
		name: '매실',
	},
	4001: {
		description:
			'적응력이 강하고, 면역력이 향상되는 효과가 있는 식물입니다. 옛날 사람들은 병, 특히 뇌졸중이 모두 마귀의 짓이라고 생각했기 때문에, 팥이 귀신을 물리친다는 전설이 있었습니다.',
		name: '팥',
	},
	4002: {
		description:
			'한 송이 화려한 꽃들로 엮은 꽃다발. 꽃들이 목숨 걸고 해내는 일들은 반드시 경의를 표해야겠죠!',
		name: '꽃',
	},
	4003: {
		description:
			'흔히 볼 수 있는 산나물. 어느 정도 독성이 함유되어 있어 과도하게 섭취하는 것은 권장하지 않으며, 먹기 전에 데쳐 조리해야 합니다.',
		name: '참죽',
	},
	4004: {
		description:
			'밝은 색을 띄는 이 과실은 한때 너무 밝아 "늑대의 복숭아"라고도 불렸고, 치명적인 독을 품고 있다 느껴 관상용으로만 재배했었습니다. 그러다 식용이 가능한 것으로 밝혀지고, 대규모 재배가 시작되었죠.',
		name: '토마토',
	},
	5000: {
		description:
			'카카오 나무의 열매로, 어떤 곳에서 자란 건 과일향이 짙다거나, 어떤 곳에선 스모키하다거나 하는 식으로 원산지에 따라 풍미가 다르다는 특징을 갖고 있습니다. 가루를 내어 먹을 수 있고, 초콜릿의 기본 원료가 됩니다.',
		name: '코코아',
	},
	5001: {
		description:
			'마계의 흙에서 자라나는 브로콜리는 빛을 잘 받지 못해 지상의 것과 비교하면 크기가 더 크고 꽃의 색깔이 다르다는 특징을 지니고 있습니다.',
		name: '브로콜리',
	},
	5002: {
		description:
			'마계 아무 곳에서나 자라는 괴이한 과일로, 먹는 사람에 따라 서로 다른 섭취 효과가 나타나는 것 같습니다. 신기하죠?',
		name: '뿌요뿌요',
	},
	5003: {
		description:
			'식용 및 약재로도 쓰이는 식물로, 벽려의 씨를 물에 불린 뒤 즙을 내서 차갑게 굳히면 수정같이 투명한 젤의 형태가 됩니다. 젤리나 우무 등을 만드는 데 사용되며, 더위를 식히는 데에도 적합한 신의 물질입니다.',
		name: '벽려',
	},
	5004: {
		description:
			'꽃처럼 아름다운 균류로, 예로부터 황족들이 장수 식품으로 여겼다고 하는 전설이 있습니다. 그렇기에 달의 도시에서도 쉬이 찾아볼 수 있으며, 더러움 하나 없는 순백색이 달의 도시와도 어울립니다.',
		name: '흰목이버섯',
	},
	5005: {
		description:
			'달의 기술로 만든 극도로 매운 물건으로, 먹으면 끔찍한 시간을 보내게 됩니다. 실제로 고추가 사용되었는지는 아무도 모릅니다……',
		name: '캡사이신',
	},
	11000: { description: null, name: null },
	11001: { description: null, name: null },
	11002: { description: null, name: null },
	11003: { description: null, name: null },
	11004: { description: null, name: null },
	11005: { description: null, name: null },
	11006: { description: null, name: null },
	11007: { description: null, name: null },
	[-1]: {
		description: '어... 여긴 어디? 나는 누구...? 어째서 이런 곳에...?',
		name: '레이센 우동게인 이나바',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
