import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const INGREDIENT_LOCALIZATION_ZH_TW = {
	0: { description: '人裏供應的雞蛋，較為常見', name: '雞蛋' },
	1: { description: '人裏圈養的家豬肉，較為常見', name: '豬肉' },
	2: { description: '人裏圈養的肉牛肉，較為常見', name: '牛肉' },
	3: { description: '獵人們在山間獵回來的鹿肉，有點珍貴', name: '鹿肉' },
	4: { description: '獵人們在山間獵回來的野豬肉，充滿野性', name: '野豬肉' },
	5: { description: '人裏有賣的豆腐，較為常見', name: '豆腐' },
	6: { description: '隨處可見的那種普通土豆', name: '土豆' },
	7: { description: '人裏農田產的洋蔥，較為常見', name: '洋蔥' },
	8: { description: '人裏農田產的南瓜，較為常見', name: '南瓜' },
	9: { description: '人裏農田產的蘿蔔，較為常見', name: '蘿蔔' },
	10: { description: '不知道從哪裏流入的外來食材，還挺常見', name: '海苔' },
	11: { description: '棲息於淡水中的冷水魚，較為常見', name: '鱒魚' },
	12: {
		description: '一種洄遊性海魚但卻在幻想鄉的河流湖泊隨處可見，較為常見',
		name: '八目鰻',
	},
	13: {
		description: '一種高度洄遊海魚但在幻想鄉的河流湖泊可見，有點珍貴',
		name: '三文魚',
	},
	14: {
		description: '一種大洋性洄遊海魚但在幻想鄉的河流湖泊可見，有點珍貴',
		name: '金槍魚',
	},
	15: {
		description: '在高海拔深山中圈養的黑毛豬肉，非常高級',
		name: '黑毛豬肉',
	},
	16: {
		description: '傳聞是超優質的肉牛品種，又稱雪花肉，非常高級',
		name: '和牛',
	},
	17: {
		description: '從魔法之森採回來的品相良好的蘑菇，無法人工種植，非常珍貴',
		name: '蘑菇',
	},
	18: {
		description: '從魔法之森採回來的品相良好的松露，無法人工種植，非常珍貴',
		name: '松露',
	},
	19: { description: '金槍魚中的頂級品種，非常珍貴', name: '極上金槍魚' },
	20: { description: '高級水產品，但體內含毒素，需小心處理。', name: '河豚' },
	21: { description: '桃子樹的果實，較為常見', name: '桃子' },
	22: { description: '白果樹的果實，較為常見', name: '白果' },
	23: { description: '分佈在霧之湖和玄武澤的淡水蝦，較為常見', name: '蝦' },
	24: { description: '能從樹上蜂巢採到的野生蜂蜜，較為常見', name: '蜂蜜' },
	25: {
		description: '在樹幹上常常可以採集的昆蟲外殼，較為常見',
		name: '蟬蜕',
	},
	26: { description: '生長在沼澤中的奇迹之花，非常珍貴', name: '幻曇華' },
	27: { description: '清晨採回來的露水，有點珍貴', name: '露水' },
	28: { description: '從野外採回來的竹筍，較為常見', name: '竹筍' },
	29: {
		description: '西餐常用的食材，可以輕鬆地給食物增加難以抗拒的香味',
		name: '黃油',
	},
	30: { description: '有多種用途，較為常見', name: '麵粉' },
	31: {
		description: '鮮翠欲滴的迷途竹林鮮切竹子，散發着清冽的竹香',
		name: '竹子',
	},
	32: {
		description: '很有粘性的米，製作出來的料理或綿軟適口，或鮮嫩彈牙',
		name: '糯米',
	},
	33: {
		description: '永遠亭的特產，由滿月之夜的月光凝聚，非常珍貴',
		name: '月光草',
	},
	34: { description: '水的固體形態，幫助食材保温，晶瑩剔透', name: '冰塊' },
	35: { description: '用於增加辣味的食材，評價非常兩極', name: '辣椒' },
	36: { description: '在紅魔館種植的用於釀酒的葡萄', name: '葡萄' },
	1000: {
		description:
			'河童的嗜好物。雖然用來做菜和普通蔬菜沒有區別，但卻能讓河童無比上癮。究竟是其中的什麼成分在起作用……',
		name: '黃瓜',
	},
	1001: {
		description:
			'鮮嫩可愛的海洋生物，但幻想鄉沒有海……它的腳是寶貝，有壓倒性的肉質感，而且只要用最簡單的火烤，就能享受彈牙的美味！',
		name: '章魚',
	},
	1002: {
		description:
			'據説在外界被稱作傳説級的食材，只要一小顆就能讓人感受到整個海洋的美味，會是真的嗎？樣子長得倒是挺奇怪的……',
		name: '海膽',
	},
	1003: {
		description:
			'火山能量，累積上千萬年；只為淨化，你靈魂的塵埃……廣告詞這樣寫着，其實就是普通的火山岩鹽。',
		name: '黑鹽',
	},
	1004: {
		description:
			'用非常特殊的方法處理的奶製品，無論什麼時候都能秒殺甜食嗜好者的味蕾！',
		name: '奶油',
	},
	1005: {
		description:
			'以為有了盔甲就可以橫行霸道的八腳笨蛋，只需最簡單的清蒸就能成為究極美味！不過要小心它的鉗子……',
		name: '螃蟹',
	},
	2000: {
		description:
			'根莖生長在橋的附近，花朵成熟後會破水而出，淡紅色並有淡香味，高級食材，也是地底人的節日裝飾。',
		name: '並蒂蓮',
	},
	2001: {
		description:
			'僅在橋附近特別的樹上產出的奇怪果實，據説沒有人能夠無表情板着臉吃完一整顆，有着強大的“酸”味，只能取其果汁來調味。',
		name: '檸檬',
	},
	2002: {
		description:
			'濃郁的奶油熟成後的珍貴食材，取一片加熱融化就能讓料理變得奶香濃郁，美味十足。',
		name: '芝士',
	},
	3000: {
		description:
			'非常古老的水生植物——蓮的種子。蓮子的芯很苦，千萬得處理好，別混到料理給客人吃了。',
		name: '蓮子',
	},
	3001: {
		description:
			'世上最實在的食材！不僅香甜軟糯，而且能強效地應對飢餓，在冬天還有暖手的效果。',
		name: '地瓜',
	},
	3002: {
		description:
			'紅松樹的種子，據説在外界已經被列為瀕危物種，但在幻想鄉仍然很常見。傳説松子有延年益壽的功能，是古代道士辟穀時的常備之物。',
		name: '松子',
	},
	3003: {
		description:
			'相傳道教創始人修煉時，由於不愛葷腥，便栽了許多板慄樹，以慄代飯。栗子種仁肥厚，營養豐富，不僅受到許多道教人士的推崇，也經常被農民用來代替糧食。',
		name: '板栗',
	},
	4000: {
		description:
			'果梅樹結的果實，可以鹽漬或乾製。做成梅幹後有種鹹中帶酸的特殊口感，能夠大大激起食慾，且品嚐後唇齒留甘，讓人回味無窮。',
		name: '梅子',
	},
	4001: {
		description:
			'又稱赤豆，是適應能力較強的草本植物，食用能夠起到增強自身免疫力和抗病能力的效果。古代人覺得中風得病都是疫鬼作祟，所以有“赤豆打鬼”的傳説。',
		name: '紅豆',
	},
	4002: {
		description:
			'一朵朵絢麗爛漫的鮮花紮成的花束。花兒們以生命為代價也要完成的事，必須要對此付出敬意！',
		name: '鮮花',
	},
	4003: {
		description:
			'一種常見的野菜。具有一定的毒性，不建議過量食用，並且食用前須焯水烹飪。',
		name: '香椿',
	},
	4004: {
		description:
			'顏色鮮豔的漿果，曾經還因為太鮮豔被視為“狐狸的果實”，覺得它具有劇毒，所以只用來觀賞。在發現可以食用以後就開始大面積種植了。',
		name: '西紅柿',
	},
	5000: {
		description:
			'可可樹的果實，據説在不同地區有不同的風味，有的會帶點果香，有的帶有煙燻的風味。可以磨成粉食用，是製作巧克力的基本原料。',
		name: '可可豆',
	},
	5001: {
		description:
			'魔界土壤培育出來的西藍花，因為光照不足植株徒長，花球顏色和地上也略微有些不同。',
		name: '西藍花',
	},
	5002: {
		description:
			'魔界裏到處可見的怪異果子。似乎會根據食用者的類型產生不同的食用效果，十分奇特。',
		name: '噗噗呦果',
	},
	5003: {
		description:
			'一種藥食兩用植物。將薜荔籽浸泡後搓汁，冷藏後會凝固成晶瑩剔透的膠狀物，可以用來製作果凍和涼粉等，是消暑神品。',
		name: '薜荔',
	},
	5004: {
		description:
			'一種像花兒一樣美麗的菌類。據説歷代皇家貴族把銀耳看作延年益壽之品，但在月都似乎很常見。這種看起來一塵不染的潔白，和月都的感覺很相稱。',
		name: '銀耳',
	},
	5005: {
		description:
			'使用了月之科技製作的極•辣品，能讓食用者留下恐怖的回憶。是不是真的用辣椒做的就説不清了……',
		name: '強效辣椒素',
	},
	11000: { description: null, name: null },
	11001: { description: null, name: null },
	11002: { description: null, name: null },
	11003: { description: null, name: null },
	11004: { description: null, name: null },
	11005: { description: null, name: null },
	11006: { description: null, name: null },
	11007: { description: null, name: null },
	[-1]: {
		description: '我是誰 ？？？我在哪 ？？？我為什麼會在這裏？？？',
		name: '鈴仙',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
