import type { ILocalizedSpecialGuestText } from '@/domain/data/localization/types';

export const SPECIAL_GUEST_LOCALIZATION_JA = {
	0: {
		chat: [
			'ご近所だし様子見に来たよ、女将さん！',
			'……そんな目で見るなって！私がいるからってお店はフケツにならないってば！',
			'あんたの所に出る虫がどうかしたって……？いや私は関係ないって！',
			'虫族の再興のために！今ここで「蟲の知らせサービス」を…なんで黙らせるんだよ！',
			'夜の蛍ってなんだかロマンチックだよね。たまには足を止めてみたら？',
		],
		description: [
			'蟲が大好きな友人。彼女と知り合ってずいぶん長くなるが、やっぱり彼女を囲っている蟲の群れには耐えられない。',
			'表面上はただの蛍妖怪だが、実際には強大な古き蟲の末裔である。だからか、いつも偉そうな素振りを見せている。',
			'私は彼女のことをよく知っているよ、性格が少し悪そうに見えるけど、実はいつも友達のことを考えているの！　そんな小さな蛍が自分の弱々しい光で、衰退した一族の道を照らすことを望んでいるなんて、誰が想像できるだろう？',
		],
		evaluation: {
			bad: 'お！ありがとう。',
			exbad: '蟲の凄さを見せてやる！',
			exgood: 'こんなに好みに合う料理に会えるなんて……何か返さないと！',
			good: '蟲の好みをよくわかっているな！',
			lackmoneyangry: '私から巻き上げるなんて、いい度胸だ！',
			lackmoneynormal: '今回は借りを作ったね～何があったら私を呼んで！',
			norm: '悪くない！',
			repell: '蛍様を追い払うと！？',
			seenRepell: 'つまんない。',
		},
		name: 'リグル',
		spellCards: {
			negative: [
				{
					description:
						'嫌な虫を呼び、店にいる全ての顧客を追い払う。食事のお店にとってはひどいスキルだ！',
					name: '蠢符「ナイトバグトルネード」',
				},
			],
			positive: [
				{
					description:
						'たくさんの蛍を呼び、お店の雰囲気をより美しく演出する。顧客の更新時間-30%、60秒間持続。',
					name: '灯符「ファイヤフライフェノメノン」',
				},
			],
		},
	},
	1: {
		chat: [
			'人間の目は、きっと暗闇を見るためにあるんでしょ～ね〜',
			'「十字架に磔られました」っていっているように見える？',
			'ここは明るいね。目がぐるぐる回っちゃった…',
			'私のことを紅魔館のお嬢様って呼ぶ人がいるんだ。なんで間違われるかなー？',
			'ここでご飯を食べるために、周りの闇をちょっとだけ弱めてきたんだー',
		],
		description: [
			'暗闇が好きな古い友人、なんだか頭の中は空っぽな気がする。でも、なんだかんだで彼女とは波長が合うよね。私も暗闇が好きで、それに頭も…',
			'いつもあっちこっち漂っていて、何をしているのか全然分からない。少し見ない間に彼女の口から新しい言葉が出てくるし……一体どこへ行ってたの？',
			'彼女と知り合って長ければ長いほど、彼女の過去について何も知らないと感じてしまう。本人に聞いても覚えていないと言うだけだ。まあ、それでも私たちは仲良しで、これからもずっと仲良くしていきたいな～。',
		],
		evaluation: {
			bad: 'へえーーそうなのかーー',
			exbad: 'これは所謂ダークマター？',
			exgood: 'お肉が輝いているみたい！',
			good: '美味しい！',
			lackmoneyangry: '二進法じゃなかったのかー！',
			lackmoneynormal: '持っているお金はこれしかないよ……',
			norm: 'けっこう美味いよ～',
			repell: 'なんで追い出すのー？',
			seenRepell: '私も追い払われるのかー？',
		},
		name: 'ルーミア',
		spellCards: {
			negative: [
				{
					description:
						'黒い霧をキッチンに放出し、調理器具や保温ボックスが見えなくなる。20秒間持続。',
					name: '闇符「ディマーケイション」',
				},
			],
			positive: [
				{
					description:
						'ランダムに記録されている三種類の肉類食材を獲得する（記録されている肉類食材が二種類しかない場合は、二種類の食材を獲得する）。どうして月明かりから肉が生まれるのか、どうして肉が大好きなルーミアがそれをくれるのか、そんなことは考えない方がいい。',
					name: '月符「ムーンライトレイ」',
				},
			],
		},
	},
	2: {
		chat: [
			'お腹が空いたとかじゃなくて、見張りに来たのよ',
			'しっかり働いて期日までに完済しなさいよ！',
			'どんなにおいしくっても、返済額は引き下げないからね',
			'今度はウチの子猫たちも連れてこようかな？',
			'食べきれなかった分はおみやげにしてもいい？ウチの子猫たちにもあげたいな',
		],
		description: [
			'凶兆の黒猫と言うより、むしろ凶暴な黒猫と言ったほうがいい……',
			'いつも私たちを監視すると言ってはばからない。夜逃げなんてするわけないのに！いつも時間通りに返済してきたのに！',
			'やっぱり何か人には言えない目的があるのかな？何かを隠してるようだ……でも彼女の性格はとても率直で、悪意はないことは分かる！だから、隠し事が何であれ、素直に接していきたいな〜。',
		],
		evaluation: {
			bad: 'この程度か。',
			exbad: 'このもの野良猫でも食わないよ！',
			exgood: 'お、おいじい！違う！美味しい！',
			good: '美味しい料理に免じて、褒めてあげる！',
			lackmoneyangry: '融资の金利を減らした方がいいかな……',
			lackmoneynormal:
				'か、金が足りないから、次の借金でサービスしてあげる',
			norm: 'まあまあってとこかな！',
			repell: '別に気にしてないからな！',
			seenRepell: '借金を返すためにお客さんを逃がすなよ！',
		},
		name: '橙',
		spellCards: {
			negative: [
				{
					description:
						'顧客に猫と遊ぶ場面を想起させ、穏やかな気持にする。顧客の出現率が下がる。',
					name: '方符「奇門遁甲」',
				},
			],
			positive: [
				{
					description:
						'ランダムに三種類の魚類食材を獲得する。まれに高級な魚が手に入る。どうして魚が出てくるのか、どうして魚が大好きな橙がそれをくれるのか、そんなことは考えない方がいい。',
					name: '仙符「鳳凰卵」',
				},
			],
		},
	},
	3: {
		chat: [
			'まさか妖怪のお店に足を踏み入れる日が来るなんて…',
			'滅多に来れないから、こういう機会はありがたいですね',
			'こういう場所ならではの色々な話が聞けそうですね',
			'稗田家の九代目当主というのは、なかなか責任重大な立場ですよ',
			'今となってはなんの為に幻想郷縁起を記しているのか……',
		],
		description: [
			'人間の里の名門「稗田家」の当主であり、幻想郷縁起の編著者でもある立派なお嬢さんだ。',
			'才気溢れるお嬢様なのに、彼女の体は非常に悪い。そんな体でも、お客さんとして来店することもあり、嬉しいけど心配でもある。',
			'華奢なお嬢様に見えるけど、実は芯の強いタイプだそうだ。輪廻転生か……それでも、今の彼女は確かに子どもなんだよね？',
		],
		evaluation: {
			bad: 'ごちそうさまです。',
			exbad: '……言いにくい味ですね……',
			exgood: '何度生まれ変わっても、こんなに美味しい料理は初めて！',
			good: 'こんな美味しい料理を食べれて、来てよかったですね。',
			lackmoneyangry: '悪徳商人だと記しますよ！',
			lackmoneynormal:
				'使用人が同行せず、私の手持ちでは足りません…すみませんでした。',
			norm: 'ごちそうさまでした。',
			repell: '必ず「幻想郷縁起」に書き記します！',
			seenRepell: 'あなたなら他の妖怪と違うと思ったのに……',
		},
		name: '稗田阿求',
		spellCards: {
			negative: [
				{
					description:
						'阿求にフェイクニュースで誹謗され、店の雰囲気が悪くなる。顧客の機嫌も悪くなる。',
					name: '口授「この店の悪事」',
				},
			],
			positive: [
				{
					description:
						'人気小説家の「サイン色紙」を獲得する。特別な物と交換できそう！',
					name: '撰書「これも全部妖怪の仕業か」',
				},
			],
		},
	},
	4: {
		chat: [
			'食べ物の歴史というのも奥深いものだ。',
			'よく思うのだが、どうも満月の日は記憶が曖昧になるな……',
			'ただ何かが起きただけでは、歴史とは言わない。記録されてこその歴史なのだ。',
			'近頃は子どもたちが授業に集中していないな。コマ数を増やすべきか？',
			'料理に込められるのは味だけではない。人への思いもまた然り、だ',
		],
		description: [
			'人間の里で寺子屋を開いている妖怪。なんだか、妖怪より人間に似ているよね。',
			'妖怪なのに、人間たちから厚く信頼されている。信仰でも集めているのかな？村人の中には、彼女は巫女よりも信頼できるという人もいる。里で巫女の代理もしているそうだ。',
			'人間たちのことを心配しながら、妖怪のことも心配しているなんて、なんて偉い人だろう。いわゆる「賢者」とはこのような存在なのだろうか？彼女はもう一つの形態があるといい、そちらはまだ見たことがないはずだけど、いつか見たような気もする…',
		],
		evaluation: {
			bad: '頑張ればもっと上手くできるはずだ',
			exbad: '食られた物じゃないな',
			exgood: '非常に美味しい！歴史が凝縮された一皿だ！',
			good: '素晴らしい味だ、努力しているな',
			lackmoneyangry:
				'この価格は、幻想郷の住民にはあっていないだろうな。',
			lackmoneynormal: '申し訳ない、今度は気をつける',
			norm: 'いい味だが、ここで止まってはいけないぞ',
			repell: 'もしお前が生徒なら、もう頭突いてるぞ',
			seenRepell: '教養がない行為だ',
		},
		name: '上白沢慧音',
		spellCards: {
			negative: [
				{
					description:
						'頭突きを食らえ！　慧音に頭突きをされ、20秒間移動不能状態になる。移動操作を行うことで、移動不能時間を減らせる。',
					name: '国符「秘技―頭突き」',
				},
			],
			positive: [
				{
					description:
						'三種の神器―剣ランダムな野菜を二種類獲得する。三種の神器―鏡15秒間、調理は材料を消費しなくなる。三種の神器―曲玉心の鎖を外して、ランダムなレア客の情報を一つ獲得する。三種の神器―郷お店を称賛した慧音は、新聞で店を宣伝し、大勢の顧客が来店する。——三種の神器は四種持つのが常識だろう？',
					name: '国符「三種の神器」',
				},
			],
		},
	},
	5: {
		chat: [
			'仙人だって霞しか食べないってワケじゃないのよ',
			'最近里に動物愛護団体ができたみたいね。いいことよ',
			'しばらく見ないうちに幻想郷も様変わりしちゃったわね。慣れていかないと',
			'はぁ。なんでこう、そそっかしい人が多いのかしら',
			'最近の巫女はどう？もっと努力してもらわないとね',
		],
		description: [
			'真面目くさった謎の仙人。彼女は普通の仙人とは違うような感じがするけど……とはいえ他の仙人を見たこともないし。',
			'仙人は皆こんな真面目な口調で話をするのかな？彼女と対話するとなんだか諭されているような気持ちになる……主食が霞である仙人が常連になってくれるのはかなりの達成感だよね〜',
			'少しうるさいが、実はとても熱心な人だ。やや厳し目の、隣のお姉さんぽい感じかな？最初と比べたら気質が随分変わったようで、前より柔らかくなったかな？',
		],
		evaluation: {
			bad: '修業が足りない！',
			exbad: '食べれた物じゃない！',
			exgood: '無欲の仙人でもたまらない味ね！',
			good: '素晴らしい味ね！',
			lackmoneyangry: '非常識な価格ね、醜い欲望が透けて見えるわ！',
			lackmoneynormal: '予算不足……償いとして修業を付けましょう',
			norm: 'いい味だったけど、これで満足しちゃダメよ',
			repell: '知らざりき腐鼠、滋味と成るとは、鴛雛を猜意して竟に未だ休めず',
			seenRepell: '驊騮拳跼し食う能わず、蹇驢志を得て春風に鳴く',
		},
		name: '茨木華扇',
		spellCards: {
			negative: [
				{
					description:
						'顧客が仙人に無理矢理に修行に連れて行かれ、欲望が消える。30秒間、顧客は一番安い料理と「緑茶」しか注文しなくなる。',
					name: '「断悪修善の試練」',
				},
			],
			positive: [
				{
					description:
						'料理を気に入った華扇が、虎に曲芸を演じさせる。結果として、顧客からの収入が増える…！　定期的に、全ての顧客からそれぞれ1~30円を貰える。',
					name: '「猛獣のアート的な使い方」',
				},
			],
		},
	},
	6: {
		chat: [
			'経営といえば僕は先輩にあたるわけで……ってなんて目でコッチを見るんだい！',
			'理解できないことを無理に分かろうとしちゃいけない。幻想郷で生きる術だよ',
			'人に物を尋ねるには、まず自分でよく考えて、その思考をちゃんと言葉にするんだ',
			'僕は力に物を言わせるタイプじゃないんだ。おかげでここまで生きてこれてるよ',
			'色々とガタがきてるんじゃないかい？ウチで何か買っていきなよ。お安くするよ',
		],
		description: [
			'普通の商人を自称しているが、売買はすべて興味次第なんてむちゃくちゃだ。経営者の先輩として、彼は良い反面教師だよね？ただし、彼の店で便利なものが見つかることもたまにある。',
			null,
			null,
		],
		evaluation: {
			bad: '普通って感じだなあ。',
			exbad: 'こんなレベルで店を開くんじゃない',
			exgood: '美味い！夜雀ってもしかして料理の天才！？',
			good: 'ここまで美味しくできるなんて！',
			lackmoneyangry: '私より無茶苦茶な店があるとは？！',
			lackmoneynormal:
				'金がちょっと足りないな……次の来店で1％割引してあげるから……',
			norm: 'たまにはこんな料理も悪くない。',
			repell: '二度と私の店に来るな！',
			seenRepell: '経営者としての自覚がないのか！？',
		},
		name: '森近霖之助',
		spellCards: {
			negative: [
				{
					description: '既に判明しているレア客の好みが隠される。',
					name: '「偽りの情報」',
				},
			],
			positive: [
				{
					description:
						'「香霖堂の割引券」を獲得する、使用期限は明日まで。',
					name: '「香霖堂販売促進祭り」',
				},
			],
		},
	},
	7: {
		chat: [
			'妖怪がやってる店のクセに、どうして神社より人が多いのよ！？',
			'人間に対しても商売するのなら、衛生面には気をつけなさいよ',
			'今日も何も起きなかった？なんかあったらすぐ私に言いなさいよ',
			'妖怪と人間が一緒に食事してるなんて、巫女としては変な気分ね',
			'儲かってるみたいねぇ。私もなにか始めようかしら？',
		],
		description: [
			'貧乏、そして凶悪な巫女さん……本当に人間なのか？と疑いたくなるわね。とにかく、絶対怒らせないように注意しよう。',
			'霊夢さんは本当に遠慮なんかしないよね……でも、いつの間にかたくさんお世話になっている。なぜこんなにたくさんの妖怪が彼女の周りに集まるのか、ちょっと理解できた気がする。',
			'口は悪いが気は優しいとは、霊夢さんのような人のことだろう。一見思慮がなさそうに見えるが、その目はいつもまっすぐ前を見すえている。博麗の巫女が霊夢さんで本当に良かった。',
		],
		evaluation: {
			bad: '私の料理より美味しくない。',
			exbad: 'こんな物を出すんですか！？',
			exgood: '有金全部持っていかれても食べたい味ね！',
			good: '美味しい！わざわざ溜め込んだ甲斐があった！',
			lackmoneyangry: '私を欺きたいって？退治するよ！',
			lackmoneynormal:
				'宴会じゃお金を取ってないし、割引があっても良いんじゃないの？',
			norm: '悪くない味ね。',
			repell: '私は退治しなかったのに、あんたが追い払うの！？',
			seenRepell: '後で訴えられても知らないからね。',
		},
		name: '博麗霊夢',
		spellCards: {
			negative: [
				{
					description:
						'三色の弾幕を召喚し、メニューにある料理を三つ封印する。封印された料理は30秒間、調理できなくなる。',
					name: '霊符「夢想封印」',
				},
			],
			positive: [
				{
					description:
						'保護の結界を展開し、レア客の懲罰スペルカードを一回無効化する。',
					name: '夢符「二重結界」',
				},
			],
		},
	},
	8: {
		chat: [
			'最近どうも宴会が少ないな。裏でなにか起きてるのかね？',
			'アンタのことはよく知ってるよ。ずっと見てるからね。',
			'酒は人を酔はさずして人自ずと酔ふ…ってね',
			'こういう喧しい所で呑んでこそ酒がウマいってもんだよ',
			'そろそろプレッシャーをほぐすべきじゃない？',
		],
		description: [
			'今の幻想郷には鬼がいるとは思っていなかったので、初めて見た時は本当にショックだった！でも…本当に鬼なのかな？',
			'間違いなく鬼だ。普段は体格が小さく、ぼんやりとした様子だが、話すと山のような気迫で潰されそうになることもある。さすが伝説の山の王者だ。',
			'鬼は非常に恐ろしい種族だが、友達になると、最も信頼できるパートナーにもなる。萃香さんはいつも酔っているが、心は透き通っている。かっこよくて本当に憧れる！',
		],
		evaluation: {
			bad: '美味しいお酒と一緒なら、食べれなくもないかな。',
			exbad: 'こんな料理、私の貴重な酒が台無しだよ！',
			exgood: 'この世に酒よりも気を引く料理があるなんて！',
			good: '美味しい料理と酒、酔うまで一杯飲むぞ～！',
			lackmoneyangry: '残念な宴会だ……',
			lackmoneynormal: 'お金が足りないなぁ。次はお酒を奢るよ！',
			norm: 'ちょうどいいおつまみだ～！',
			repell: '鬼が居ぬ間に、恐怖まで忘れたのか？',
			seenRepell: '宴会の客を追い払うなんて、本当に退屈なヤツ。',
		},
		name: '伊吹萃香',
		spellCards: {
			negative: [
				{
					description:
						'可愛い豆萃香に店の最高級の飲み物を三つ盗まれる。可愛い子だったのになんでこんなひどいことを！？',
					name: '「百万鬼夜行」',
				},
			],
			positive: [
				{
					description:
						'可愛い豆萃香が高級飲料をくれる。たまに超高級な飲み物もくれる。どうして自分が大好きなお酒をくれるのか？　お酒は友達と一緒に飲むと決まっているからだ！',
					name: '酒呑奥義「鬼飲酒」',
				},
			],
		},
	},
	9: {
		chat: [
			'私にとっちゃボロい店だけど、まあ地上にしてはマシな方じゃない？',
			'天界の長老たちは頑固者ばっか。ちょっとくらいいいじゃない！',
			'天界の豊かさに比べたら地上なんて。まあ少しくらい我慢してあげる',
			'天人サマ御用達なんて知ったら、みんな我先にと押しかけてくるでしょうね',
			'地上にはトンチキなものが多いわね。大したものはないけれど、キライじゃないわ',
		],
		description: [
			'噂の傲慢で人を見下す不良天人、できればそんなお客さんは接待したくない…',
			'前に言ったことを謝らなければならない。客人であれば、どんな人でも接待しなくちゃダメだ。たとえ傲慢で、人を見下し、ベラベラ喋って人を傷つけ、常識のかけらもない彼女でも、私は頑張っておもてなしする！まぁ、できるだけ……',
			'実際、それほど迷惑な人でもなさそうだ。口が少し悪いが（非常に悪い）、もしかしたら……彼女はかなり純真な人なのかもしれない。天界での生活はあまり快適でないようで、地上でストレスを発散できたらいいと思う。',
		],
		evaluation: {
			bad: '地上のはこんなもんか。',
			exbad: '食べられないほど塩辛い！',
			exgood: 'やるな！こんなやせこけた土地でもこんな料理ができるなんて。',
			good: 'これだけ美味しければ、天界でも通用するわよ。',
			lackmoneyangry: '私が来店しただけでも光栄に思え！',
			lackmoneynormal: 'ふん、元々この程度にしか値しない。',
			norm: '地上のくせに、悪くないわね。',
			repell: '蚍蜉大樹を撼かす、笑うべし自ずから量らざるを！',
			seenRepell: '斗筲の人、何ぞ算うるに足らん。',
		},
		name: '比那名居天子',
		spellCards: {
			negative: [
				{
					description:
						'空から降ってきた要石にテーブルが破壊され、顧客は恐れて逃げ出す。壊されたテーブルは60秒間「使用不能」状態になる。',
					name: '「天罰の石柱」',
				},
			],
			positive: [
				{
					description:
						'天界の天人が放つ強大な力によって、食事中の全顧客の満足度が85%まで増える。',
					name: '「全人類の緋想天」',
				},
			],
		},
	},
	10: {
		chat: [
			'大丈夫だ。私が盗……借りるのは本だけだぜ。メシ代はちゃんと払う方だ',
			'くそう、今日も霊夢のヤツに負けちまった！',
			'こんなに人が見てるなかで食い逃げなんてしないぜ！',
			'魔法はつまるとこパワーだぜ。料理だってそんなもんだろ？',
			null,
		],
		description: [
			'とても陽気でおしゃべりな人間の魔法使い。彼女を見ているだけだと、魔法の森で一人暮らしをしているとは想像しがたい。本当に変わった人だ。キノコについては相当詳しいみたい！',
			'何もしていないように見えるが、実は「霧雨魔法店」を経営している。彼女は収集が好きで整理整頓しない性格なので、この店はよくゴミ回収所だと誤解されている。お客さんも居ないんじゃないかな。',
			'性格的に悪いところもあるけど、根は正直で、彼女と一緒にいるのは楽しいね！彼女は努力している姿を他人に見せたくないみたいだけど、実はみんな知っている……幼い頃から家を出て修行をしている彼女だけど、もっと人に頼っても良いんじゃないかな。',
		],
		evaluation: {
			bad: 'まあまあだな。',
			exbad: '何だこれ、野生のキノコよりもマズいぜ！',
			exgood: '何かの魔法か？こんな美味しい料理が作れるなんて！',
			good: '宴会の主役になりそうな一品だ！',
			lackmoneyangry: 'お金を借りてから戻るぜ！',
			lackmoneynormal: '金は払ったよ。レジの金が消えた？知らんな――',
			norm: 'うっま！作り方教えて～',
			repell: '信じろって！今回はお金を持って来てるから！',
			seenRepell: '嫌な奴――',
		},
		name: '霧雨魔理沙',
		spellCards: {
			negative: [
				{
					description:
						'ランダムな物が二つ盗まれる。食材？料理？それとも飲み物？高級な物じゃなかったらいいな。物を盗んだ上に無銭飲食だって？！　頭の良い人が泥棒わけがないでしょう（たぶん）。',
					name: '魔符「私のものだ」',
				},
			],
			positive: [
				{
					description:
						'ランダムに三種類のキノコ類食材を獲得する。まれに高級なキノコが手に入る。どうして星からキノコが生まれるのか？　どうしてキノコが大好きな魔理沙がそれをくれるのか。そんなことは考えない方がいい。',
					name: '流星「スーパーペルセイド」',
				},
			],
		},
	},
	15: {
		chat: [
			'サボりじゃないですよう！こっそり抜け出しはしましたけど',
			'咲夜さんの投げナイフは目でもついてるのかってぐらい当たりますよね',
			'お嬢様ったら、あの漫画の後編、いつになったら返してくれるんでしょう',
			'メイド長に見つかる前に早く帰らないとっ',
			'食前食後は運動禁止。一服するくらいがちょうどいいですね〜',
		],
		description: [
			'悪魔の洋館の門番はなんと、情熱的で優しいお姉さんだ！彼女と話をしたいときはいつも、居眠りしているのが残念なポイント。',
			'美鈴さんは一人でその大きな邸宅を警備していて、勤務を交替する人もいないし、寝不足になるのも当然だろう。私の力になれる範囲で、彼女を少しでも助けられたらいいな。',
			'美鈴さんの故郷がまさか海の向こう側にあるなんて。でも幻想郷には海がないし、もう帰れなくなってしまったの？故郷には有名な料理がたくさんあるみたい。それを作ることができれば、彼女のホームシックを和らげることができるかも〜',
		],
		evaluation: {
			bad: '……食えるならいいか。',
			exbad: 'ひどい！こんなものでごまかすなんて！',
			exgood: 'こんな料理が食べられるなんて、ナイフがいっぱい刺さっても悔いはない！',
			good: 'さすが、ナイフ刺しのリスクを冒してまで食べに来た料理だ。',
			lackmoneyangry: '門番の身でそんなお金は持ってないです！',
			lackmoneynormal: '私の給料はこれだけしか残っていなくて…',
			norm: 'うーん……まあまあ美味しかったかな？',
			repell: 'おかみさん、ひどい！',
			seenRepell: 'おかみさん、こんな人でしたか……',
		},
		name: '紅美鈴',
		spellCards: {
			negative: [
				{
					description:
						'暴力パンダを召喚してテーブルを壊す。テーブルに顧客がいる場合は怖くて逃げ出す。更に店の雰囲気が10減る。壊されたテーブルは90秒間「使用不能」状態になる。',
					name: '「NOver say no to pOnda」',
				},
			],
			positive: [
				{
					description:
						'盛り上がってきた美鈴が曲芸を演じ始める。30秒間、2秒ごとに店の雰囲気が1増える。',
					name: '華符「芳華絢爛」',
				},
			],
		},
	},
	24: {
		chat: [
			'不老不死とはすなわち、贖われることのない永遠の孤独ってこと…',
			'炭火が足りないならいつでも私を呼びな！',
			'もし月に行く方法が見つかったら、アイツも帰っちゃうのかな…',
			'尽きない炎より生まれるものこそが、何度でも蘇る不死鳥さ',
			'タバコのポイ捨てはするんじゃないぞ',
		],
		description: [
			'竹林で隠者生活を送っている不思議な人間。欲は非常に薄く、世の人が求めるすべてのものに興味がない。何か変なものを食べたから不死身になったようだ（食べものには気をつけよう）。',
			'妹紅さんは本当にカッコいい。人間だけど凄く強くて、性格も豪快である。辛いもの好きは大らかだというが、彼女以上の辛党はいないだろう。',
			'私が想像していたよりも思慮深く、想像を絶する苦しみを経験してきたようである。それでも彼女は優しい心を持っており、密かに他人を助けている。彼女の日々が幸せで満たされますように！',
		],
		evaluation: {
			bad: 'もっと工夫した方がいいよ。',
			exbad: '硬くて歯が痛い、あんたの肝臓よりも歯ごたえがあるかも！',
			exgood: '生きていることが……なんて素晴らしいんだ！',
			good: '長い人生の中でも、めったに食べられない味だ。',
			lackmoneyangry: '時代の変化は、ここの値上げほど早くないよ！',
			lackmoneynormal: 'ずっと身一つだから、これだけしかない……',
			norm: 'もっと上手くできるはずだ。',
			repell: '……まあいい、もう慣れたから',
			seenRepell: '己の欲せざる所は人に施す勿れ',
		},
		name: '藤原妹紅',
		spellCards: {
			negative: [
				{
					description:
						'料理の品質にかかわらず、顧客からの評判が「普通」になる。30秒間持続。',
					name: '藤原「滅罪寺院傷」',
				},
			],
			positive: [
				{
					description:
						'妹紅の炎は調理速度を速くする。20秒間、全ての調理器具の調理速度が50％増加する。',
					name: '不死「火の鳥　-鳳翼天翔-」',
				},
			],
		},
	},
	25: {
		chat: [
			'働かざる者食うべからず。私もそろそろ何かするべきかしら？',
			'かの美しき五つの難題。解けるかどうかなんて、もうどうでもよくなっちゃった',
			'ニートじゃないわよ。永琳がガミガミうるさいせいで、外に出る気にならないだけよ',
			'幻想郷の雨はpH6。ほとんど酸性じゃないってことよ',
			'七色の優曇華は綺麗だけど、七色の料理ってすっごくマズそうね',
		],
		description: [
			'永遠亭に住んでいるお姫様で、月から来たと言われている。一体何のために月の姫をやめ、幻想郷に来て引き篭もり生活を送ることにしたのか？',
			'優雅なお姫様に見えるが、悪党のように振る舞う時もある……なぜ彼女があの腹黒ウサギの主人になれたか理解してきた……',
			'まさか高貴なお姫様も普通の人と同じように、仕事の心配をしているなんて。輝夜さんも私と違いはないよね。数年働いてきた先輩として、迷う後輩を応援しなければ！',
		],
		evaluation: {
			bad: 'こんな物のために出かけるんじゃなかったわ。',
			exbad: 'こんな穢れた物を私に出すなんて！',
			exgood: '地上はこんなにおいしい食べ物があるのに、誰が月に戻りたいと思うの？',
			good: '料理とは珠玉の逸品を食すこと、その味わい窮まりなし',
			lackmoneyangry: '地上の人はいつもこうやってぼったくりをするの！？',
			lackmoneynormal: 'うーん、月と地上の物価はすこし違うのかも。',
			norm: '地上の食べ物は昔から良いわよね。',
			repell: '無礼な地上の妖怪ね！',
			seenRepell: 'ふん、別に興味ないわよ。',
		},
		name: '蓬莱山輝夜',
		spellCards: {
			negative: [
				{
					description:
						'現実時間で30秒にあたる営業時間を減らす。残り時間がない場合は営業を終了する。',
					name: '神宝「蓬莱の玉の枝　-夢色の郷-」',
				},
			],
			positive: [
				{
					description: '現実時間で30秒にあたる営業時間を増やす。',
					name: '「永夜返し　-世明け-」',
				},
			],
		},
	},
	27: {
		chat: [
			'「人生は魔法とパスタが絡みあったようなものだ」、よ',
			'館の中だとなにかとウルサイから、気晴らしに出てきちゃったわ',
			'私の本は散らかってないの。全てあるべき場所にあるのよ',
			'魔法のチカラって、本質は科学となんら変わらないのよ',
			'料理と魔法の融合。きっと面白いわね',
		],
		description: [
			'いつもパジャマ姿で日陰に隠れている不思議な魔法使い。他人の目を気にしないようで、トレンドなどに興味がない。頭が良いが、体の方は弱く見える。頭脳より健康な体のほうが重要だ。',
			'パチュリーさんはいつも本を肌身離さず持っている、ずっと読書していて眼が疲れないのかな？それに本の内容が真実とは限らないし。あんなに本ばかり読んで外出しないと、知識が豊富であっても、常識が少し欠けるようになってしまうよ。',
			'師匠は今まで貧血と喘息に苦しんできたようで、本当に心配だ。（ここなら「師匠」と呼んでもいいよね？）長い間お世話になってきたけれど、それでも師匠は私にあまり親切ではない。それでも彼女はたくさんの知識を教えてくれたのだから、その期待に応えられるようにがんばろう。',
		],
		evaluation: {
			bad: '食らうに語らず、寝ぬるには言わず',
			exbad: '話にならないわ！こんな腕前でも店を開けるの？',
			exgood: '数多の本を読んでも、ここまで料理を極めるのは難しいでしょうね',
			good: '心に沁みる食感ね。いったいどうやって作ったのかしら',
			lackmoneyangry:
				'雀の米は宝玉より高く、薪は桂よりも高いっていうの？',
			lackmoneynormal: 'ちょっと気分が悪いから、一度出直すわ…',
			norm: '本を少し読めば、もっとよくできるはずよ',
			repell: '無礼な妖怪ね！',
			seenRepell: '朽ちた木よりも救いようがないわね',
		},
		name: 'パチュリー',
		spellCards: {
			negative: [
				{
					description:
						'作る料理は50％の確率で「ダークマター」になる。30秒間持続。',
					name: '金＆水符「マーキュリポイズン」',
				},
			],
			positive: [
				{
					description:
						'顧客に「伝統的」タグが付いた料理を提供すると、必ず最高評価を得る。30秒間持続。',
					name: '知識的奇妙な冒険「文化の風」',
				},
			],
		},
	},
	28: {
		chat: [
			'アタイったらさいきょーね！',
			'アタイの氷は文字通り飛ぶ鳥を落とせるのよ！',
			'アタイをそこらの妖精と一緒にしないでよね？',
			'漬物は漬ける前が食べ頃派よ',
			'ひとやすみ！お腹いっぱい食べたらかくれんぼしよっと！',
		],
		description: [
			'氷の翼を持つ自称最強の妖精、そんな翼で飛べるのは本当に驚くべきことだ。もちろん、彼女の頭の中も驚くべきことだ。いつもみんなと真逆の選択をするし、とにかく彼女が言ったことに対して深く追究しないように。',
			'氷の妖精だが、熱いやつだ！特にその勇気と勢いと、徹底的に失敗を恐れないところを見ると、本当に最強の妖精かもしれない。偉い偉い！',
			'一緒にいると、知らず知らずのうちに彼女の勢いに振り回されてしまう。これぞリーダーの気質なのか？ ！でも、不思議と楽しくなるし、案外うまくいくかもしれない。これってもしかして私もバカだっていうこと？なんて、ただの冗談だけど〜',
		],
		evaluation: {
			bad: 'これで私を追い払えると思わないでよ！',
			exbad: 'こんなもんは、英吉利牛と一緒に氷漬けよ！',
			exgood: '舌がとろける！',
			good: 'おいしい！これからあたいについてまいれ！',
			lackmoneyangry: 'あたい！おかね！ない！',
			lackmoneynormal: '妖精はそんなお金持ってないよ。',
			norm: '食事中の会話は舌を噛むわね。',
			repell: '最強のあたいを追い払うなんてーー',
			seenRepell: '面白くないなぁ。',
		},
		name: 'チルノ',
		spellCards: {
			negative: [
				{
					description:
						'ランダムに三つの調理器具が凍る。未完成の料理は粉々になる。30秒間持続。――あたいったら最強ね！',
					name: '凍符「パーフェクトフリーズ」',
				},
			],
			positive: [
				{
					description:
						'ランダムに三つの「ロック」タグが付いたお酒を獲得する。更に2~5個の「氷」を獲得する。',
					name: '「甘い氷霧の妖精」',
				},
			],
		},
	},
	29: {
		chat: [
			'人間が私に出会えるだけで、一生分の運を使い果たしてるのさ',
			'鳥頭でもちゃんとそれっぽく商売できるもんだねぇ',
			'おぉ！盛り上がってるね！ぼちぼちショバ代でもいただこうかねぇ',
			'まだまだ甘いね。私が本当の経営ってヤツを教えてあげよっか',
			'私に会えたら幸運になれる！けれども、私に会えるのは幸運な人だけさ',
		],
		description: [
			'突然店に現れた妖怪ウサギ、いつもニヤニヤして因縁をつけようとする。そのウサギ耳が見える度に嫌な思い出が浮かんでくる。',
			'いつも高い値段で押し売りするし、その上に抱き合わせ販売なんて……でも、いくつか確かに役に立つものもあるかも……',
			'いつも霊夢さんに退治されるのもかわいそうかも……とにかく、お金に余裕があれば来店されても悪くない。彼女がいれば、思わぬ幸運が訪れることもあるかも？',
		],
		evaluation: {
			bad: 'ウサギたちが作った餅の方がずっといい。',
			exbad: 'お金払ったのにこんなものを食べさせるの？弁償しなよ！',
			exgood: 'この味はいったい…女将さん！お金持ちになれるよ！！',
			good: '雀ちゃんいい腕じゃない。うちのうさぎにも教えてね～',
			lackmoneyangry:
				'私は注文なんかしていない。自分で出した料理は自分で払って。',
			lackmoneynormal: 'これだけしか持ってないし、好きにして～',
			norm: 'こんなんで私にお金を出させるの…まあ、いいわ。',
			repell: '雀のくせに……覚えてなさい！',
			seenRepell: 'こんな悪質な店、願い下げよ。',
		},
		name: '因幡てゐ',
		spellCards: {
			negative: [
				{
					description:
						'こんなに「特別」扱いしてあげたのに、まだ恐れ知らずのままなんてね。押売の恐怖を思い知らせてあげる。これでも分からないなら、スペルカード発動——凶報 「コンボ消失術」コンボが中断される。更に30秒間、コンボができなくなる。',
					name: '記憶「素菟への恐怖」',
				},
			],
			positive: [
				{
					description:
						'全ての食材採集点をリセットする。更に次の日に採集する際の入手量が増える。',
					name: '生気「四十葉クローバーのような奇跡」',
				},
			],
		},
	},
	30: {
		chat: [
			'この世界は何を食べさせてくれるのかな？楽しみだね',
			'この世界の人たちは私たちのとこほど「角が立って」ないんだね',
			'この世界にいる人はみーんな可愛いね。私まで可愛くなっちゃったし！',
		],
		description: [
			'MC幻想郷の看板娘、「コラボの扉」を通してこちらに来た異世界の住民、そして向こうの世界を代表するイメージキャラクターでもある。夜雀食堂の世界の住民を常にMC幻想郷に招き、両方の環境向上を積極的に推進している。',
			null,
			null,
		],
		evaluation: {
			bad: 'わざわざ遠いところから来たのに……',
			exbad: '異世界の旅人をこんな物で招待するの？！',
			exgood: '美味かった！私の世界のすべての人に紹介しよう！',
			good: '美味しい！通路を通り抜けて来たがいがあった！',
			lackmoneyangry: 'もしかしてこの世界ではぼったくりが常識なの？',
			lackmoneynormal: 'ああ、予算が……',
			norm: '楽しみだったのに、まぁこんなものか。',
			repell: '開発者に訴えてやる！',
			seenRepell: 'わぁ――この世界のおかみさんってひどいです！',
		},
		name: '萌澄果',
		spellCards: {},
	},
	31: {
		chat: [
			'サニー「ふふふ、今日はどうやってもてなしてくれるのかしら？」',
			'ルナ「私たちだけピクセル数がなんだか違わない……？」',
			'スター「三人で一席に座ると……正直かなり窮屈ね…」',
			'サニー「女将！早く一番良いものを出してちょうだい！」',
			'ルナ「多少はお金持ってるからよかったけど…考えて頼みなよ？」',
			'スター「こっそり厨房に忍び込んで、ワザを盗みたいわね〜」',
		],
		description: [
			'「三妖精のぴょこぴょこ討伐大作戦」の主人公たち、「コラボの扉」を通してこちらに来た異世界の妖精。絶え間ない好奇心と行動力のおかげで、本世界の人々から歓迎された。彼女たちを見ると元気いっぱいになります。',
			null,
			null,
		],
		evaluation: {
			bad: 'こんなので妖精を騙すなんて！心が痛まないの？',
			exbad: 'こんな物！犬も食べないわ！',
			exgood: 'お、美味しい！盛り上がってきた！',
			good: 'いったい何が入ってたの？！なんでこんなに美味しいの！？',
			lackmoneyangry: '悪徳商人だ！おかみさんは悪徳商人だ！',
			lackmoneynormal: 'お金が払えなくて瓶に閉じ込められるところだった……',
			norm: '普通って感じかな。',
			repell: 'わぁ――この世界は弱々しい妖精ちゃんをいじめる！',
			seenRepell: '腹黒おかみだ！いい勉強だったね！',
		},
		name: 'ぴょこぴょこ三妖精',
		spellCards: {},
	},
	36: {
		chat: [
			'私の麟は麒麟の麟ですよ！スゴイでしょ！',
			'私たちの病院よりも遥かにお客さんが多いですね',
			'今日は注射のときに力を入れすぎて…危うく訴えられそうになった…',
			'竹林のとこのヤブ医者ってどこから現れたんですかね？',
			'私、せっかちなんですよ。あんまり待たせないでくださいね！',
		],
		description: [
			'村の病院で看護師として働く人間。素直で純粋な気質を持っており、医療に細心の注意を払っている。入院してもまだ自分の体を大切にしない患者に対しては、注射するときにいつも以上に力を入れているようだ…',
			null,
			null,
		],
		evaluation: {
			bad: '薬と同じレベルの味かな……',
			exbad: '私があんまり登場しないからって、いじめやすいと思うなよ！',
			exgood: '一日の疲れが癒された！',
			good: 'お、美味しい！妖怪の料理でさえ私より美味しいのか……',
			lackmoneyangry: 'でたらめなことを言うな！本当に払うと思ってる？',
			lackmoneynormal: 'これしかもってない……',
			norm: '悪くないでしょう',
			repell: '私を追い出すの？もう医館に来るなよ！',
			seenRepell: '差別する人は最低だ。',
		},
		name: '冴月麟',
		spellCards: {
			negative: [
				{
					description:
						'ご飯はよく噛んでゆっくり食べなさい！　列に並んでいる顧客を含む、全ての顧客の食事時間は200%に増加する。このスキル効果の優先度は即時完食系のbuffより低い。',
					name: '「食事はゆっくりするもの！」',
				},
			],
			positive: [
				{
					description:
						'冴月麟の力で、食べ物は完璧な健康食品になる。並んでいる顧客を含めて、全ての顧客は30％の確率で一回追加注文する。確率は顧客毎に計算する。顧客の追加注文は予算制限がなくなる。',
					name: '「私はまだ食べられる！」',
				},
			],
		},
	},
	37: {
		chat: [
			'生きてるうちに徳を積んどかないと、死後アタシに虐められちゃうよ',
			'善因善果、悪因悪果、因果応報ってね',
			'アタシが残虐だって？ふふ、自業自得よ',
			'同情なんて必要のない感情よ',
			'生きている幸せを噛み締めなさい。',
		],
		description: [
			'八寒地獄からの鬼卒。鬼卒の仕事は地獄に落ちた罪人を辱めることだと言われているので怖い！身なりも性格も喧嘩上等のようで、この時代のギャングと違う口癖を使うことが多い。攻撃的で強い。毎日喧嘩をしているか売っているのどちらかである。いつかお店を壊されないか本当に心配……',
			null,
			null,
		],
		evaluation: {
			bad: '地上の食べ物ってこんなレベル？',
			exbad: '地獄に落ちたいの！？',
			exgood: '八寒地狱に来て料理人をやりな！',
			good: '地上の食べ物はやっぱり面白い！',
			lackmoneyangry: '私を騙そうと？度胸がありゃ地獄まで取りに来な！',
			lackmoneynormal: 'どうして君が金額を決めるのだ？私が決める！',
			norm: 'この程度か。',
			repell: 'くそ！ゆめゆめ忘れるなよ……',
			seenRepell: 'ふん、地上も世の末だな。',
		},
		name: '立空汐',
		spellCards: {
			negative: [
				{
					description:
						'「あっさり」か「野菜」タグが付いた料理を作ると、「ダークマター」になる。120秒間持続。',
					name: '拷問「頞部陀」',
				},
			],
			positive: [
				{
					description:
						'空間の能力で全ての顧客を閉じ込める。顧客がお金を持っている間は、ここから逃げられない。顧客が予算の70%を消費するまではテーブルから離れられない。60秒間持続。',
					name: '「楽しまないと帰れない？！」',
				},
			],
		},
	},
	38: {
		chat: [
			'地獄の改革か。激しい戦いが待っているだろうな……',
			'今日の執着が、明日の後悔を生むのだ',
			'一切の悪法、本より是れ虚妄なり',
			'無尽の未来には、無数の可能性が待っているのだ',
			'あの妖怪の賢者……ふふ、成る程な',
		],
		description: [
			'新地獄の上級管理者、八寒地獄の鬼神長。新地獄のマネージメントおよび司法の上級顧問でもあるようだ。なんでこんな大物が私の店に来るのか……この店は地獄で有名なの？',
			null,
			null,
		],
		evaluation: {
			bad: '常に精進しなければ、その場に留まるどころか退くばかりである',
			exbad: '苦痛はいつも一番の経験である。',
			exgood: '地上にこんな珍味があるとは、帰りたくなくなるな。',
			good: '悪くない。往きに道を違えたら、帰りはより順調になる',
			lackmoneyangry: '不正な商人はいつか地獄に落ちよう',
			lackmoneynormal: '価格の不正も罪である、私は公平な額を払うまでだ',
			norm: '私が見たところ……あなたはもっと出来るはずだ',
			repell: '幻想郷でも地獄の来客は受け入れられないのか？',
			seenRepell: '誰しも簡単に時空から消されてはならない。',
		},
		name: '時焉侑',
		spellCards: {
			negative: [
				{
					description:
						'料理の品質にかかわらず、顧客からの評判がランダムになる。60秒間持続。',
					name: '律符「因果混乱」',
				},
			],
			positive: [
				{
					description:
						'力を使って、顧客の残り予算と注文回数を見抜く。120秒間持続。',
					name: '因果「推理と判断の目」',
				},
			],
		},
	},
	39: {
		chat: [
			'やっと気軽に来れる日がきた！',
			'以前は本当に失礼しました、女将さんが気にされてないようで有り難い',
			'ふー、幽々子様にご奉仕するのも骨が折れる',
			'女将さん、もし手伝えることがあったら何でも頼ってください！',
			'冥界にも一軒くらい食堂があれば、だいぶ楽になるんだけど',
		],
		description: [
			'冥界の主に仕える庭師、警備、そして料理人…つまり、200由旬はある西行寺の庭を世話するだけでなく、西行寺家と主人の安全を守る必要もある。同時に食いしん坊である主人の食欲を満たさなければならない。どれを取っても重労働だし、夜雀食堂で癒せるといいな！',
			null,
			null,
		],
		evaluation: {
			bad: 'えっと――こんな味じゃないはずだけど？',
			exbad: '悪ふざけが過ぎる！',
			exgood: 'あぁ！これが私が辿り着けなかった味！',
			good: '嗚呼、私もこんな料理ができたら…！',
			lackmoneyangry:
				'騙されたときには直帰せよと、おじいさまが言ってました！',
			lackmoneynormal: 'すみません！これしか払えなくて……',
			norm: 'これ程度なら、私でも出来るが？',
			repell: 'な……なんで……',
			seenRepell: '追い出された人も可哀想だ……',
		},
		name: '魂魄妖夢',
		spellCards: {
			negative: [
				{
					description:
						'顧客の辛抱力が二倍速で低下する。更に2秒ごとに店の雰囲気が1減る。60秒間持続。',
					name: '天上剣「天人の五衰」',
				},
			],
			positive: [
				{
					description:
						'凄まじい剣術を身につけ、まな板を使った調理を一瞬で完成させる。60秒間持続。',
					name: '獄界剣「二百由旬の一閃」',
				},
			],
		},
	},
	40: {
		chat: [
			'夢で食べた味が忘れられなくて、ついつい来ちゃった',
			'うーん、スズメは小骨が多いかしらね…',
			'ここの女将さんって、本当に食べちゃダメなの？残念……',
			'気にしないでね。普通のお客さんだと思ってくれればいいのよ',
			'食事中にそんなに見つめられると、さすがの私でも気が引けちゃうわ〜',
		],
		description: [
			'大魔王である。危うく幻想郷ごと食い尽されるところだった。正気を取り戻したあとも世界が平和になると思いきや、出会い頭に私を食べたいなんて！？今は時々店に来て食事をするけれど、ヨダレを垂らしながらこちらをじっと見るのはやめてほしい…二度と会いたくない亡霊だ。',
			null,
			null,
		],
		evaluation: {
			bad: '私が夢見た味じゃないわ。',
			exbad: '女将さんのほうが美味しそうだけどーー',
			exgood: 'あの忘れられない味よ！',
			good: 'たまには外で美味しい料理を食べなきゃね～',
			lackmoneyangry: 'あら、お金を忘れちゃった～',
			lackmoneynormal: 'お会計するの？どれどれ、これで十分かしら～',
			norm: 'あの時とは、ちょっと違う気がする。',
			repell: 'あなたのお店を潰すつもりはないわよ～',
			seenRepell: 'えっ？雀ちゃんってつまらない……',
		},
		name: '西行寺幽々子',
		spellCards: {
			negative: [
				{
					description:
						'料理に食材を五つ使わなかった場合、悪い評価を受ける。営業終了まで持続。',
					name: '「多い部分は奢り」',
				},
			],
			positive: [
				{
					description:
						'営業終了まで、顧客は料理を瞬時に食べ終わる。再使用時は以下に変化する。「墨染浮桜化酔蝶」幽々子は1/3/5/8（使用回数に応じて上昇）匹の蝶を召喚し、保温ボックスに保存された料理を飲み込み、料理の4倍の価格のお金に変換する（チップの倍率加算を受ける）。',
					name: '「食べ物消失術」',
				},
			],
		},
	},
	41: {
		chat: [
			'ここも夢の世界なのだろうか？',
			'新しい希望の面か……あまり付けたい気はしないな。',
			'皆と熱い感情の戦いを経て、私は多くのことを学んだ。',
			'夜雀食堂……人気を集めるのにぴったりの場所だ。',
		],
		description: [
			'同時に六十六の面で構成された付喪神は、普段はほとんど笑顔を見せない。偶然目が合うと、すぐに目をそらしてしまうこともある。最初は冷淡な性格に見えるかもしれないが、実はお面に依存する習慣があるため、感情を理解できないだけなのだ。ある意味、赤ん坊のように純粋で、実際、妖怪の中でも生まれて間もない存在だと言える。今は感情を理解できるよう、一生懸命修行中で、きっと最後には自分らしい笑顔を見せられるようになると信じている！',
			null,
			null,
		],
		evaluation: {
			bad: 'いまいち……これは「哀」の表情だ。',
			exbad: 'まずい……これは「怒」の表情だ。',
			exgood: '最高に完璧だ！これは「大満足」の表情だ。',
			good: '美味しい！これは「楽」の表情だ。',
			lackmoneyangry: 'ぼったくられた！これは「怒」の表情だ。',
			lackmoneynormal: '財布が空っぽだ……これは「恥ずかしい」の表情だ。',
			norm: 'まあまあかな。これは「平静」の表情だ。',
			repell: '追い出された……これは「呆れ」の表情だ。',
			seenRepell:
				'どうして客にそんなことができるの？これは「驚きと怒り」の表情だ。',
		},
		name: '秦こころ',
		spellCards: {
			negative: [
				{
					description:
						'秦こころが暗黑能楽を演奏すると、場内の全ての客の感情に影響を与え、チップ率を0にし、66秒間持続する。',
					name: '喪心「七情六欲の解憂」',
				},
			],
			positive: [
				{
					description:
						'場に感情マスクが存在しない場合、当日の対応する感情マスクを召喚し、30秒間持続。場に感情マスクが存在する場合は、30秒間その感情マスクの効果を強化する。',
					name: '華心「喜怒哀楽の変幻」',
				},
			],
		},
	},
	1000: {
		chat: [
			'勘の鋭い商人だけが、情報の価値を見極めることができるのさ。',
			'成功すると決めなければ、失敗するに決まってる。',
			'船は港で一番安全だが、そこにいるのが役割じゃない。',
			'顧客はあんたの都合を気にしないし、自分と関係のない言い訳も聞きたくないのさ。',
			'企業経営とは、できるだけ安いコストで、できるだけ良い製品を作り、できるだけ高く売ることさ。',
			'河童も料理のビジネスに参入すべきじゃないかな……',
		],
		description: [
			'河童が利己的な商人ばかりだとすれば、小さな頭目の彼女はその筆頭だ！商人が利に走っても非難することはないが、もう少し人間味があってもいいのではないか。',
			'にとりさんは頭がいい、ビジネスと技術の天才だ！河童は元々利を重んじるものと思っていたけれど、実際には技術のために大金を掛けようとしていて、すこし理解できなかった……',
			'あらゆるチャンスをつかみ、危機をビジネスチャンスに変える能力には、本当に感服した。彼女から学んだことは、私が一生かけて実践すべきだ！',
		],
		evaluation: {
			bad: '余計な工夫はプラスじゃなくて、マイナスだよ。',
			exbad: 'これで幻想郷を風靡したのか。広告詐欺だろ！',
			exgood: '契約以上のサービスを受けた。お礼しないとね！',
			good: 'あんたを山に誘って良かった！',
			lackmoneyangry: '最近は実入りがいいとは言え、こんなの払えないよ！',
			lackmoneynormal: 'この値段、商売というより強盗だよ！',
			norm: '食とは深いものだ、もっと知識を身につけないと。',
			repell: 'こんな商売じゃ長続きしないね。',
			seenRepell: '女将さん、商売をまだわかってないようだね。',
		},
		name: '河城にとり',
		spellCards: {
			negative: [
				{
					description:
						'洪水を招き、巨大な波がランダムに3~5人の顧客を押し流す。',
					name: '水符「河童のフラッシュフラッド」',
				},
			],
			positive: [
				{
					description:
						'仲間が遠隔で配膳できるようになる。120秒間持続。',
					name: '河童「のびーるアーム」',
				},
			],
		},
	},
	1001: {
		chat: [
			'今日の対局相手はまさに好敵手です、面白い！',
			'侵入者がいなくても、決して油断してはいけません。',
			'河童は天才だと言うけど、武力も棋力も私には及びませんよ。',
			'組織の規模が大きいほど、必要なルールが多くって。',
			'あの鴉天狗はまた、何を考えているのか……',
		],
		description: [
			'妖怪の山をパトロールすることが多い白狼天狗は、山の千里眼と呼ばれ、嗅覚、聴覚が非常に鋭く、侵入者を迅速に発見することができる。このような守衛がいるからこそ、私たちのような小さな妖怪は普段山に登ることができない。',
			'妖怪の山にはほとんど侵入者がいないので、守衛の仕事はとても暇らしい。夜雀食堂がオープンしてから、彼女は仕事の後に行ける場所が増えてとても喜んでいるようだ。顔にはあまり出ていなかったけど、しっぽから気持ちがバレバレ。',
			'性格はもともと真面目だが、慣れてくると彼女の愚痴を聞いたり、時折ドジな一面も見ることができる。思っていたよりいい性格で……もっと早く山に来ればよかった！',
		],
		evaluation: {
			bad: '酒だけ頼めばよかった。',
			exbad: '労働者の財布から搾り取って、こんなものしか食べさせられないの！？',
			exgood: 'さすが幻想郷を風靡した食堂、ごちそうさまでした！',
			good: 'おいしい食べ物は、一日の疲れが吹っ飛びます！',
			lackmoneyangry:
				'食事も満足に食べられないとは、守衛の給料はさすがに安すぎないか……',
			lackmoneynormal: 'この価格は山の秩序を乱すものですよ！',
			norm: '酒が飲めるだけいいとしますか。',
			repell: '底辺の天狗は食事もさせてもらえないんですか？',
			seenRepell: '山の団結を乱すことですよ！',
		},
		name: '犬走椛',
		spellCards: {
			negative: [
				{
					description:
						'食堂への道を封鎖し、顧客が来ることを禁止する。30秒間持続。',
					name: '「戒厳令」',
				},
			],
			positive: [
				{
					description: '大量の白狼天狗が訪れる。120秒間持続。',
					name: '「勤務後の一杯」',
				},
			],
		},
	},
	1002: {
		chat: [
			'たまには帰省したほうがいいのかしら……',
			'最近人形の痛みがひどいから、帰ったらちゃんと直してあげないと。',
			'明日は何の人形劇をやろうかしら……',
			'こんなに魔法使いがいるなんて……店に来て初めてわかったわ。',
		],
		description: [
			'魔法の森に住む魔法使いは金色の髪と白い肌を持ち、人形のように精緻な外見をしている。彼女の家も人形だらけだという。彼女に操られている人形たちは生き生きとしていて、少し……怖いような気もする。',
			'この人形は本当に操られているのだろうか？　誰が見てもそんな疑問が浮かぶだろう。彼女は他人に無関心なように見えるが、人に接する時は非常に気配り上手である。それが都会派ということだろうか？',
			'彼女の心に近づくのは大変だ。性格は控えめだけど客好きで、優しいながらも距離を感じる。こんなにたくさんの人形を作ったのは、孤独のせいではないだろうか？',
		],
		evaluation: {
			bad: '人形が作った方が美味しいわね……',
			exbad: '魔力で食事をしなくてもいいのに、なんでこれを食べないといけないの？！',
			exgood: '夢のような美味しさよ！',
			good: 'こういうグルメがあるから、人間の食習慣は捨てられないわ～',
			lackmoneyangry: '最近材料にお金がかかって予算が……',
			lackmoneynormal: '新しい詐欺？絶対にぼったくりでしょ！？',
			norm: 'まあまあね。',
			repell: '……もともと食べるつもりないわよ。',
			seenRepell: '雰囲気が悪いと食べ物も不味くなるわね。',
		},
		name: 'アリス',
		spellCards: {
			negative: [
				{
					description:
						'キッチンに魔法の瓶を投げ、調理器具を1つ吹き飛ばす。60秒間持続。',
					name: '魔符「アーティフルサクリファイス」',
				},
			],
			positive: [
				{
					description:
						'アリスの人形が客に化け、残りの席をすべて埋める。',
					name: '「人形と遊ぶ子供」',
				},
			],
		},
	},
	1003: {
		chat: [
			'この世をなめていると痛い目に遭うぞ？',
			'血の池の恐怖、悲喜、憎悪、恨みも美味しい。',
			'信条は「漁夫の利を得る」こと。',
			'同盟のメンバーは身勝手な奴ばかりだな。',
			'このスズメを食べたら、私もこんなにおいしい料理ができるのではないか――',
		],
		description: [
			'畜生界のナントカ同盟の盟主。伝説の饕餮の動物霊は、何でも吸い込むとんでもない大食いだ！飲み込んだものに影響される性格で、今は美食を求めているようで、たまにお店に来る……体型も姿も子供っぽいので、空気が読めない妖怪になめられないようにしたいですね……',
			null,
			null,
		],
		evaluation: {
			bad: 'こんなもののために地上に出てきたのではない——！',
			exbad: '血の池の恐怖を憎悪、お前も感じてみたいか！？',
			exgood: 'この美味しさだけが、私の無限の胃袋に合う！',
			good: '出てきた甲斐があった！',
			lackmoneyangry: 'ここのカツアゲ具合は畜生界といい勝負だな。',
			lackmoneynormal:
				'私の金をゆすりたいのか？　やれるもんならやってみろ！',
			norm: '黒水とあまり変わらないな。',
			repell: '本当に手を出さないと思っているのか？',
			seenRepell: '地上も畜生界もなんら変わらないな。',
		},
		name: '饕餮尤魔',
		spellCards: {
			negative: [
				{
					description:
						'暴走した尤魔はランダムに3~5の食材、1~3の酒を飲み込む。更に1つの調理器具を飲み込み、今夜はそれが使えなくなる。血の池地獄チャレンジでは、追加でHPを5%回復する。',
					name: '「剛欲な獣神トウテツの夕餉」',
				},
			],
			positive: [
				{
					description:
						'すべての顧客は、最も高価な食べ物とお酒だけを注文する。これらの注文は予算を消費しない。30秒間持続。',
					name: '「饕餮の宴」',
				},
			],
		},
	},
	1004: {
		chat: [
			'浮世の美しさこそ、凡人の心を癒せる。',
			'満腹ということは、虚ではないこと。',
			'すべての味、すべての食事に心を込める価値がある。',
			'食事は、人間の花火にすぎない。',
			'本来東も西もなく、いずこにか南北あらん。',
		],
		description: [
			'もともと魔法の森に置かれていた地蔵で、森の魔力によって命を得た——存在そのものを変化させる魔力が秘められているなんて、どうりであれだけの魔法使いが森に住んでいるわけだ！',
			'地蔵像だからもう少し落ち着いているのかと思ったら、知り合ったらものすごくおしゃべりだった。とても素直な女の子である。',
			'せっかく自我を持つ生命体になったのに、森に引きこもるのはもったいないのでは！？なんとか彼女に活気を与えたい！',
		],
		evaluation: {
			bad: '賞味期限が切れてませんか？',
			exbad: '下手な人は下手な料理と同じ、吐き気がします。',
			exgood: '満足です！　修行よりもお腹いっぱいがいいですね～',
			good: 'せっかく出かけたから、無駄足じゃなくて良かった！',
			lackmoneyangry: '足りないお金は今度托鉢して返しますから。',
			lackmoneynormal:
				'地蔵にお金を要求するのってみっともないですよ。お布施だと思ってください。',
			norm: '生き残るために、これも食べないとなりませんね。',
			repell: 'お金は持ってきました！客ですよ！',
			seenRepell: '生きとし生けるものは平等に扱いなさい。',
		},
		name: '矢田寺成美',
		spellCards: {
			negative: [
				{
					description:
						'業火はランダムにバフを3つ燃やし、その効果を失効させる。',
					name: '地蔵「業火救済」',
				},
			],
			positive: [
				{
					description:
						'顧客は会計時にチップの50%をお布施として支払うことになる。60秒間持続。',
					name: '魔符「インスタントボーディ」',
				},
			],
		},
	},
	1005: {
		chat: [
			'なんだか最近、河童たちが妙に浮足立ってませんか……',
			'今の私は、幻想郷の皆さんに覚えてもらえるのではないでしょうか？',
			'守矢の名を幻想郷に響かせてやります！',
			'あの二柱は、物好きですがあまり人前には出ませんね。',
			'夜食は太るとはいえ……今日はたくさん歩いたから大丈夫だと思います！',
		],
		description: [
			'数年前に守矢神社とともに外からやってきた巫女。彼女と一緒に来たのは二柱の神様……と湖だったという。あまりにも突飛すぎる出来事で、今でも恐ろしいと感じる。',
			'家にこもってお茶を飲む博麗の巫女さんとは違い、彼女は非常に勤勉で、信仰を集めている姿が随所で見られる。現人神とはいえ人間の身で信仰を集めるのは大変だね。',
			'博麗神社は幻想郷において特別で絶対的な地位を持つ。守矢神社も早苗さんも博麗の名を超えるのは難しい。でも、こつこつとした努力のおかげで、今では守矢の巫女の名をみんな覚えてくれたみたい、本当によかった！',
		],
		evaluation: {
			bad: 'この程度のものでは人の心は動かせません。',
			exbad: 'こんなものを信者に出したら信仰心を失いますよ！',
			exgood: 'あなたを信仰したいくらいです！',
			good: '美味しい食べ物はやっぱり信仰を集められます！',
			lackmoneyangry: '幻想郷って外よりもインフレしているんですか……',
			lackmoneynormal: 'いくら幻想郷といえど、この食費は非常識ですよ！',
			norm: 'これで信仰を集めるには、もう少し精進する必要がありますね。',
			repell: 'え？　えええ！？',
			seenRepell: 'そんな接客態度では、信仰を集められませんよ。',
		},
		name: '東風谷早苗',
		spellCards: {
			negative: [
				{
					description:
						'五芒星に封印される！　すべてのバフが消滅し、かつ30秒間バフを獲得できなくなる。',
					name: '奇跡「白昼の客星」',
				},
			],
			positive: [
				{
					description: '飲料3つと食材3つを獲得する。',
					name: '神徳「五穀豊穣ライスシャワー」',
				},
			],
		},
	},
	2000: {
		chat: [
			'地上から嫌われる地底世界は、私たちの天国よ。',
			'洞窟は暗いけど、私の網は明るいよ。',
			'最近は街の方がにぎやかだ、たまには遊びに行こ～',
			'一番の暗闇に耐えてこそ、一番明るい光を得ることができる',
		],
		description: [
			'暗い風穴で出会った親切な案内人。自分が嫌われるのを知っているから村にはほとんど行かないらしい。あんなに可愛いのに……地上のみんなにも彼女を知ってほしい！',
			'彼女は地底アイドルのような存在だった！さすがヤマメさん。しかし、その可愛らしい性格とは対照的に、彼女の趣味は人外そのもので……',
			'誤解され続け「嫌われ者」になっても、ヤマメさんは気にしていない。彼女が確かにこの地底世界を愛していると感じることができる。そのような境地に達するなんて、本当に凄い。',
		],
		evaluation: {
			bad: 'ショックを与えたいわけじゃないけど、味はあんまり……',
			exbad: '蜘蛛の巣の獲物ほどおいしくない。',
			exgood: '洞窟でこんなに美味しい料理が食べれるなんて、最高！',
			good: '雰囲気も食べ物も満点だよ～',
			lackmoneyangry: '黒蜘蛛よりも黒い店だ！',
			lackmoneynormal: 'まだ地上の食費には慣れないな……',
			norm: '噂の夜雀食堂がこの程度なわけ……',
			repell: '何もしてないのに嫌われるの？',
			seenRepell: '招かれざる店ね。',
		},
		name: '黑谷ヤマメ',
		spellCards: {
			negative: [
				{
					description:
						'ヤマメの蜘蛛の巣に絡まる！　移動速度が80%低下する。30秒間持続。',
					name: '細綱「カンダタロープ」',
				},
			],
			positive: [
				{
					description:
						'行列の顧客はアイドルに惹かれ、営業が終了しても立ち去らない。30秒間持続。',
					name: '「アイドルカーニバル」',
				},
			],
		},
	},
	2001: {
		chat: [
			'あなたは橋の上に立って景色を見て、景色を見ている人はあなたを見る。',
			'人がこんなに幸せそうに見えて、妬ましい——',
			'橋は此岸から彼岸への繋がり、現世から彼の世への道でもある。',
			'なぜ隣の料理が美味しそうに見えるのか、妬ましい——',
			'Line',
		],
		description: [
			'親切で明るい妖怪だと思っていたが、振り向くと陰で悪口を言っているのが見えた……嫉妬を食い物にする妖怪は、人の嫉妬心を煽らないと生きていけないのだろうか？かわいそうな気もするが、彼女はそうは思わないようだ。性格も曇りがちで難しい。',
			'橋姫は橋の妖怪であり、橋の守り神でもある。実は、日々地上から地下へ無事に行き来することを見守っている……ということは、彼女も偉大な妖怪ということだろう。',
			'パルスィさんはあらゆる人の良さを知っていることを発見した！嫉妬深いと言われているが、心の奥底ではみんなに憧れているのではないだろうか。彼女のことをもっと知ることができてよかった！',
		],
		evaluation: {
			bad: '隣のテーブルの料理のほうが断然いいわ！',
			exbad: 'こんなめちゃくちゃな料理で、どうやって店を開いたの？',
			exgood: '美味しくて嫉妬すら忘れてしまいそう——',
			good: 'この癒される美味しさ、妬ましい——',
			lackmoneyangry: 'こんなぽったくり、藁人形で呪うわよ！',
			lackmoneynormal: 'みんなはそんなに裕福なの？',
			norm: '他の人の注文の方が良い気が……',
			repell: '私がダメで他の客はいいって、妬ましい——',
			seenRepell: '他の客が追い出されて私が放置なんて、妬ましい——',
		},
		name: '水橋パルスィ',
		spellCards: {
			negative: [
				{
					description:
						'仲間はミスティアが儲かっていることに強い嫉妬を覚える。その夜の決済時に倍の給料を受け取る。',
					name: '恨符「丑の刻参り」',
				},
			],
			positive: [
				{
					description:
						'顧客の嫉妬心をあおる。すべての顧客の予算を、客席にいる最も裕福な顧客と同じ水準に引き上げる。',
					name: '「嫉妬と張り合い」',
				},
			],
		},
	},
	2002: {
		chat: [
			'こいつもアイツも地上に行きたがる。何が面白いんだ？',
			'酒はにぎやかなほどおいしい。',
			'酒器は必要ない、自前の持ってるからな。',
			'いいね。声のデカさで鬼を超える者はいまい。',
		],
		description: [
			'昔に幻想郷を離れた姉御肌の気迫を持つ鬼で、気丈で歯切れがいい。現在は旧地獄街道の温泉を管理している、たまには温泉に入ってみよう！',
			'勇儀さんはかつて山の四天王の一人だった。彼女には異常なほどの怪力があり、腕力は鬼の中でも並ぶ者がいないという。まさか私がこんなにすごい妖怪と知り合えるとは……やっぱりちょっと緊張する。',
			'鬼は人間に興味を失ったと思っていたけれど……地上を自由に行き来する仲間の姿を勇儀さんは密かにうらやましがっていた。地上に興味があるなら、地上に遊びに行きましょう！鬼はそうあるべきだ！',
		],
		evaluation: {
			bad: 'この料理じゃ、ちょっと私の酒に負けるな。',
			exbad: 'こんな料理じゃ酒が台無しだ！',
			exgood: '最高の酒には最高の料理だ！',
			good: '温泉後の満腹は癒されるな。',
			lackmoneyangry: '鬼をぽったくろうとする店は初めて見たよ。',
			lackmoneynormal: '金に目を眩ませるのはよくないよ——',
			norm: 'どんな料理でも、いい酒で流し込めばいい。',
			repell: '肝っ玉が太いね——',
			seenRepell: '面白くないな。',
		},
		name: '星熊勇儀',
		spellCards: {
			negative: [
				{
					description:
						'三歩必殺のエリアを生成し、移動を制限する。60秒間持続。三歩必殺・一歩目：安全範囲三歩必殺・二歩目・罪人の枷：範囲から離れるまで移動速度が50%低下する三歩必殺・三歩目・怪力乱神：範囲に入ると30秒間スタンする',
					name: '四天王奥義「三歩必殺」',
				},
			],
			positive: [
				{
					description:
						'星熊盃を使い、一定数のお酒を1ランク上のお酒にアップグレードする。100% - ランク1を3杯アップグレード75% - ランク2を2杯アップグレード50% - ランク3を1杯アップグレード',
					name: '「祭りを止めるな」',
				},
			],
		},
	},
	2003: {
		chat: [
			'距離が遠すぎると、読めない……',
			'急いで食べて仕事に戻りましょう。',
			'せっかく時間を作ったから、自分をねぎらうべきね。',
			'グルメは味覚だけでなく、精神的な楽しみでもあるんです。',
		],
		description: [
			'伝説の心が読めるさとり妖怪、その名もさとり。自分の種族や能力を誇りに思っているのだろうか。昼夜を問わず仕事をしているため、話しかける機会があまりない……',
			'私が見た中で最も苦労している領主。ペットたちが雑用を手伝っているが、行政側の仕事は彼女しかできないようだ。仕事のために日常の趣味をたくさん放棄しているようだが、読心だけはあきらめてはいない。疲れて倒れると大変だ。',
			'なぜペットたちがさとりさんを愛しているのかが分かった。激務の中でも、妹やペットのことをずっと気にかけている。冷たい外見の下にある優しさは、確かに忘れられないものだ。',
		],
		evaluation: {
			bad: 'せっかく来れたのに、がっかりです。',
			exbad: '仕事よりもストレスが溜まりますね。',
			exgood: '豪華絢爛、至高の料理とはこれですか！',
			good: 'お燐の勘はいつも当たるわね。',
			lackmoneyangry: '元値はお見通しですよ。',
			lackmoneynormal: 'すみません、ペットにお小遣いをあげたら手持ちが……',
			norm: '食事とは生き長らえるための手段でしかありません。',
			repell: '私の健康のために料理を用意したのでは？',
			seenRepell: '人に対する態度は心の鏡になります。',
		},
		name: '古明地さとり',
		spellCards: {
			negative: [
				{
					description:
						'（さとり以外の）アンロックされたレア客の懲罰スペルカードをランダムで発動する。',
					name: '想起「嫌な記憶」',
				},
			],
			positive: [
				{
					description:
						'（さとり以外の）アンロックされたレア客の奨励スペルカードをランダムで発動する。',
					name: '想起「楽しい記憶」',
				},
			],
		},
	},
	2004: {
		chat: [
			'お空の性格で核融合炉の管理なんて、大変だな。',
			'今日送られてきた怨霊は少し多いかも。',
			'今度はさとり様も連れてこよう。',
			'さとり様、ちゃんとご飯を食べてるかな……',
		],
		description: [
			'火車と呼ばれる化け猫で、地霊殿の主の右腕のような存在。死体や怨霊と会話ができるのは便利そう！でも……火車といえば死体泥棒だ。だから嫌われているんだよね？うーん、他人の趣味をとやかく言うのはよくないような……',
			'よく考えてみると、人間は死んだ直後は茫然としているのではないだろうか。突然の死の中で明るくおしゃべりなお燐に出会えたら、死への恐怖も和らぐのかもしれない。',
			'偏見の下で生きる「凶兆の黒猫」は、そんなにも辛いことを経験するなんて、偏見はよくないことだ。幸いにもお燐はさとりさんに出会った。良い飼い主はペットの一生を変えることができる。お燐には、これからも呑気に死体を盗む生活が続くことを願っています～',
		],
		evaluation: {
			bad: '私の勘が外れたか……',
			exbad: '腐肉のほうがマシだよ、ちぇっ！',
			exgood: 'この料理なら、さとり様も饕餮みたいになるよ！',
			good: '美味しい物は早く食べないと！',
			lackmoneyangry: 'そんな商法なら、こっちも考えがあるから！',
			lackmoneynormal: '最近はちょっと懐具合が……',
			norm: 'この程度でさとり様の食欲をそそれるか……',
			repell: '流石に傷ついたよ。',
			seenRepell: '傲慢は自分に損をさせるよ。',
		},
		name: '火焔猫燐',
		spellCards: {
			negative: [
				{
					description:
						'お燐が立ち去る際に、元の席に地底怨霊を残し、お燐と同様の注文を続ける。地底怨霊は追い出せず、支払いもせず、満足するまで消えない。',
					name: '「死灰復燃」',
				},
			],
			positive: [
				{
					description:
						'顧客に「度数普通」タグを含むお酒を与えると、最高評価を獲得できる。30秒間持続。',
					name: '猫符「猫酔歩」',
				},
			],
		},
	},
	2005: {
		chat: [
			'食事を待つ時間も楽しい～',
			'食事を楽しむ時間が一番楽しい～',
			'花に鳥、おかずに飯だ！',
			'頭の中に入れられないものは、お腹に入れよう。',
		],
		description: [
			'灼熱地獄跡を見守る地獄鴉は、炎のように熱く爽快な性格だった。外見は他の地獄鴉とは違うけれど、頭が空っぽなところは親近感を覚える。',
			'お空の外見が大きく異っているのは、彼女の体内に八咫烏が宿っているからだった！地獄の闇から生まれた地獄鴉と、太陽に生息する八咫烏、奇妙な組み合わせだ！でも……彼女にこんなに強い力を持たせて大丈夫なの？',
			'最近ふと思ったけれど、この力を持つのにお空ほどの適任は居ない気がする。異常に強い力を持っているのに、その力を使う頭がないのは幸運なのではないでしょうか。頭の空っぽなお空はかわいい！私も頭が空っぽだとよく言われるし～',
		],
		evaluation: {
			bad: '火が通ってないかも。',
			exbad: '灼熱地獄で焼いた方がマシかも。',
			exgood: '灼熱地獄よりも熱い料理だ！',
			good: '燃えるね！',
			lackmoneyangry: 'お金忘れたフリしよう……まあ鳥頭だし。',
			lackmoneynormal: '所持金はこれしかないよ。',
			norm: 'ご馳走さま～',
			repell: '焼いちゃうよ！',
			seenRepell: 'なんで追い返すの……',
		},
		name: '霊烏路空',
		spellCards: {
			negative: [
				{
					description:
						'次の夜雀の歌でパーフェクト成功しなかった料理は、調理器具を炉心溶融させ、その夜は使用できなくなる。行列に並んでいた一部の顧客もびっくりして逃げ出す。',
					name: '獄光「ディヒューズヘルファイア」',
				},
			],
			positive: [
				{
					description:
						'すべての煮込み鍋と蒸し器がオーバーヒートし、瞬時に料理が完成する。60秒間持続。',
					name: '「ヘルズトカマク」',
				},
			],
		},
	},
	2006: {
		chat: [
			'食いしん坊は太らず、夢物語は現実だ～',
			'お腹いっぱいだと虚ろにならない！',
			'怪奇審査員って格好いい——あ！私だった！',
			'らっらら——何が来るかな——',
		],
		description: [
			'地霊殿の主の妹、第三の眼を閉じたさとり妖怪！心を閉ざすことで存在感が薄くなり、彼女の神秘的な姿は地底で多くの崇拝者を得た。いつも明るい笑顔を浮かべているが、彼女の本当の心がどう思っているのかは誰にも分からない。彼女自身でさえ。',
			null,
			null,
		],
		evaluation: {
			bad: 'お腹すいたのに食べたくないな。',
			exbad: 'スズメちゃんを剥製にしたら素敵だね～',
			exgood: '女将さん素敵！持ち帰ろ～',
			good: 'たくさん食べられるってことは、美味しいことって、お姉ちゃんが言ってた！',
			lackmoneyangry: 'なんでご飯食べるとお金を取られるの？',
			lackmoneynormal: 'お金はこれで全部だよ～',
			norm: '満腹——',
			repell: 'なになに？見えなかったの？',
			seenRepell: 'にぎやかな方が好き！',
		},
		name: '古明地こいし',
		spellCards: {
			negative: [
				{
					description:
						'こいしによって、一般客の注文はすべて判別不能になる。図鑑を確認して乗り切ろう。60秒間持続。',
					name: '「自我の極意」',
				},
			],
			positive: [
				{
					description:
						'顧客の注文・食事・店員の操作など、クールダウンを必要とするすべての動作は、無意識により最短時間で行われ、最速の理論値に達する。60秒間持続。',
					name: '「自在の極意」',
				},
			],
		},
	},
	3000: {
		chat: [
			'また来ちゃった！びっくりした～？',
			'ますます賑やかになってるね！うれしー！',
			'ターゲット探し中…よし！イタズラ対象はあいつに確定だ！',
			'今日も誰もびっくりさせられなかった……',
		],
		description: [
			'変わった唐傘お化け。ずっと誰にも使われなかったため、気づかぬうちに付喪神になった。誰かを驚かすのに成功すると躍り上がるほど喜ぶ性格である。',
			'めんどくさい性格だ！陽気で親切な妖怪だと思ったら、すぐ泣き出しちゃって……どうして良いか分からない！すぐに元気を出すのは幸いだけど！',
			'たまに後向きなところもあるけど、本質的にはさっぱりしてて芯の強い妖怪なんだ。よくひどい目に遭うけど、いつもくじけずにベストを尽くそうとしてる。そのたくましさ、私にもあればいいんだけどね！',
		],
		evaluation: {
			bad: 'お決まりで意外さ皆無だな。',
			exbad: '驚くぐらいまずかった。',
			exgood: '驚きー！怖いくらい美味しかった！',
			good: 'びっくりするくらい美味しかった！',
			lackmoneyangry: '金はないぞ！びっくりしただろー！？',
			lackmoneynormal: 'このお金は子どもたちからもらったんだ…',
			norm: '悪くないけど意外性はあんまりかな。',
			repell: 'うぅ…私って役立たずだ…',
			seenRepell: 'そんな嫌われる気持ち、わかるよ。',
		},
		name: '多々良小傘',
		spellCards: {
			negative: [
				{
					description:
						'小傘が大きな化け傘となって行列に出現し、並んでいる顧客を驚かす。並んでいる一般客がすべて逃げ出す。',
					name: '「超巨大幻影唐傘」',
				},
			],
			positive: [
				{
					description:
						'「珍味」タグのある料理の制作速度が30%アップし、さらに追加注文率が30%上昇する。30秒間持続。',
					name: '雨符「雨夜の怪談」',
				},
			],
		},
	},
	3001: {
		chat: [
			'あのついてない死神、自分の船が水漏れしてるの気づいたかしら？',
			'昼間はみんな控えてたし、夜は大暴れしてもいいよね？',
			'私も宵越しの銭は持たない暮らしが羨ましいなー',
			'食べ終わったらあいつを魔界まで運ばなきゃならないし……',
		],
		description: [
			'船を沈めるのに執念する妖怪を聖輦船の船長にするなんて、命蓮寺は本当に理解できない。彼女は水面であればどこでも水難事故引き起こすから、厨房の水たまりにも注意しないと！',
			'千年来の仏教徒でありながら、いまだに仏弟子としての自覚がない。海上でのイタズラを随分やらかしていたらしく、今も住職の目を盗んで続けている。でも命蓮寺に不利なことは、絶対しないらしい。',
			'奔放な船長が自分から仏弟子となり、仏教の規律（実際はたいした規律でもないが）を受け入れた、ただ千年前に受けた恩に報いるために。やはり見た目でヒトを判断するのは良くない。村紗さんは、黄金のような義理堅い心を持っている。',
		],
		evaluation: {
			bad: '船での非常食くらいだったな。',
			exbad: '船での非常食よりまずいぞ！',
			exgood: '料理が聖輦船と同じ輝きを放っている！',
			good: '悪くないぞ！料理人として私の船に来てほしいところだ。',
			lackmoneyangry: '金が重すぎて船には載せられないー',
			lackmoneynormal: '地上の生活コストは海上よりずっと高いな。',
			norm: '私も好き嫌いはしないタイプだ。',
			repell: '絶対にお前を船から突き落としてやる！',
			seenRepell: '残念だが賑わい目当てに来たんだ。',
		},
		name: '村紗水蜜',
		spellCards: {
			negative: [
				{
					description:
						'足下で渦巻きが起こり気絶し、5秒間行動不能になる（移動操作で短縮可能）。その後20秒間、移動方向が逆転する。',
					name: '溺符「深海の渦巻き」',
				},
			],
			positive: [
				{
					description:
						'「船霊憑依」状態になる。15秒間持続。この間に獲得した奨励スペルカード（このスペルカードは除く）の有効時間は、このスペルカードの残り時間と同じだけ延長される。',
					name: '「船霊散らず」',
				},
			],
		},
	},
	3002: {
		chat: [
			'幽霊食堂の都市伝説って聞いたことある？',
			'最近の人間は抜けてるのかな？',
			'孤独こそが食を楽しむのに最適な状態なんだよ。',
			'せっかく見つけた居場所なんだ。絶対に出ていかないよ。',
		],
		description: [
			'正体不明の古き妖怪こと鵺である。伝説と全然違う姿で残念……命蓮寺の弟子ではあるけど、いつも寺の周りでフラフラしてて、みんなと馴染んでいないらしい。',
			'無視されたからイタズラでみんなの目を引こうとしてるひねくれた子みたい。寺に馴染みたいと心の底で望んでいるけれど、うまく伝えられない……あんなに長生きしてるのに、まだまだ不器用なんだから。',
			'気にすれば気にするほど怯みやすくなる……結局心も姿と同じ、はっきりと見えない。これが「明かせないもの」の寂しさだろうか？それでも今は真実を見せてくれているから、みんなもいつかきっと彼女の素直さを分かってくれる！',
		],
		evaluation: {
			bad: 'まあまあかな。',
			exbad: 'こんなものに、私が真相を示すほどの価値がない。',
			exgood: 'こんな美味を味わうために真相を見せるんだ！',
			good: 'これが美食の真相というものなのか！？',
			lackmoneyangry: '平安時代の盗賊もお前ほどではないぞ！',
			lackmoneynormal: '平安時代から貯めていた金が底をつきそう…',
			norm: 'まだ美食の真相を見つけ出していないのか。',
			repell: 'どうせ一人でいるのにも慣れているがな。',
			seenRepell: '賑わいを感じるために来たんだ。',
		},
		name: '封獣ぬえ',
		spellCards: {
			negative: [
				{
					description:
						'100％ミスするUFOルーレットを起動する。結果は次の4種類のどれかになる。赤赤緑：15秒間、すべての料理の評価が最低レベルになる。緑緑〇：15秒間、食材や飲み物の消費量が3倍になる。青青〇：15秒間、収入が66%減少する。赤赤青：上記三種類の効果をすべて獲得する。',
					name: '吐き気「東方赤赤青」',
				},
			],
			positive: [
				{
					description:
						'100％当たるUFOルーレットを起動する。結果は次の4種類のどれかになる。赤赤赤：15秒間、すべての料理の評価が最高レベルになる。緑緑緑：15秒間、食材や飲み物が消耗されない。青青青：15秒間、収入が100%アップする。赤緑青：上記三種類の効果をすべて獲得する。',
					name: '喜び「東方赤緑青」',
				},
			],
		},
	},
	3003: {
		chat: [
			'味気ない調理道具には、人間の一生が詰まっているな。',
			'我がこの皿を割れば、この店はさらに賑やかになるぞ。',
			'厨房の火力は足りているかな？我がもう一押ししてやろうか？',
			'火と共に暮す料理人生活も案外我に適しているかもしれないな……',
		],
		description: [
			'長い間自分を呪うことで深い眠りについた古代の人。眠りすぎたのか思考パターンも昔のままで、一般人と完全にズレている……今は現代知識を頑張って勉強しているが、結局これまで以上にどっちつかずになっている。',
			'時代遅れの考え方はさておき、実際仙人らしいところもちゃんとあり、特に風水や何やらについて結構詳しいらしい。よく分からないけど……今度家の増築を見てもらおうかな。',
			'過去を振り切れないということは、まだ引きずるものがあるということ？それでも布都さんは尸解仙の実験台になることを決意したんだ。人間の忠誠心は理解不能だけど、とても感心する！',
		],
		evaluation: {
			bad: '可もなく不可もなしってところだな。',
			exbad: '火加減がうまくできないなら手伝ってやろう！',
			exgood: '国宴レベルだ！',
			good: '食欲が湧いてきそうだ！',
			lackmoneyangry: '貴店の価格では、国庫が空にする可能性すらある。',
			lackmoneynormal: '皆の前で無銭飲食するところだった！',
			norm: 'ごちそうさま。',
			repell: '小人は気骨を知らず、根本を忘れ末節にとらわれる！',
			seenRepell: '礼なる者は人道の極みなり。',
		},
		name: '物部布都',
		spellCards: {
			negative: [
				{
					description:
						'使えるトレーが1つだけになる。使用を禁止されたトレーの料理は焼却される。30秒間持続。',
					name: '火移り「灼熱の皿」',
				},
			],
			positive: [
				{
					description:
						'スペルカードが使用されてから10秒間、顧客の評価に応じた飲み物を獲得する。「普通」評価は、レベル1の飲み物を獲得する。「満足」評価は、レベル2の飲み物を獲得する。「大満足」評価は、レベル3の飲み物を獲得する。',
					name: '聖童女「太陽神の供物」',
				},
			],
		},
	},
	3004: {
		chat: [
			'夜雀ちゃんは暮らしの息吹にちょっと近すぎるかもしれませんね…',
			'私のかわいい部下たちがお世話になりましたね～。',
			'ありとあらゆる食事も、俗世の息吹の表れに過ぎないわ。',
			'仙人を食べたい妖怪はごまんといるけど、仙人に食を作る妖怪は初めて会ったわね。',
		],
		description: [
			'寺の近くでフラフラしているのをよく見かける。修行にはあまり熱心じゃないみたいだけど……修行の良さを布教するのには熱中しているみたいだ。何を考えてるのか全然わからない。一見普通に見えるが、言動や思想は普通と異なる仙人のようだ。',
			'やりたいことは後先考えずにやろうとして、他人が分かってくれなくてもどうということはないって顔をしている。欲望のままに生きるのともなんだか違う気がして……彼女のやることは欲望というより、性格によるものなのかもしれない。',
			'邪仙が邪悪な仙人とは限らない。思考や言動が妥当じゃないから天人の道を断たれるなんて理解出来ない……でも一つだけ言えるのは、青娥さんがすごく特別ということだ！天人になるためにその特別さを手放さないといけないなら、青娥さんはむしろ今のままのほうがいいと思っている。',
		],
		evaluation: {
			bad: '私の目が狂ったのか？',
			exbad: '気でも狂ってなければ食べないわ！',
			exgood: '生きてこそ、こんな美味しいものを食べられるのよ～。',
			good: '美味しい食べ物を前にしながら穀断ちなんて勿体ない～。',
			lackmoneyangry: '私ってそんなに金の亡者に見えるかしら？',
			lackmoneynormal: '夜雀ちゃんも結構お客さんをぼるのね～',
			norm: 'もっと頑張らなきゃね～。',
			repell: 'ちゃんと考えておいてねえ……',
			seenRepell: '私の目が狂ったのかしら？',
		},
		name: '霍青娥',
		spellCards: {
			negative: [
				{
					description:
						'レア客が暴走状態になる。支払いの度に評価を問わず、30%の確率で懲罰スペルカードを発動する。元々発動するスペルカードがあった場合、追加でもう一度発動する。30秒間持続。',
					name: '入魔「暴走」',
				},
			],
			positive: [
				{
					description:
						'仲間が食堂の顧客や障害物をすり抜けられるようになる。30秒間持続。',
					name: '邪術「壁抜け」',
				},
			],
		},
	},
	3005: {
		chat: [
			'三食は普通、四食は満足。',
			'美食と風景はありとあらゆる悲しみや迷いに敵うものだ。',
			'死んでしまえばなんの心配もなくなるさ。',
			'酒に向かいて笑うべし！人生など幾ばくのもの、大いに楽しめ！',
		],
		description: [
			'古代の人の亡霊。昔は深い恨みを抱いていたようで、怨霊という性質上、妖怪にとって一番怖いタイプ。近づくのもちょっと怖いかも……',
			'と思ったら、彼女は素直で心が広く元気はつらつな人だった。ちっとも怨霊らしくない。恨みはもうほとんど晴れきったから？そんな心の広い屠自古さんを怨霊にさせたなんて、きっとすごく辛いことのはず……',
			'でもその元凶は、まさかまさかの布都さん！それなのにお二人はとても仲が良い！？屠自古さんは心が広いというか、もう成仏してもおかしくないレベルだよ。',
		],
		evaluation: {
			bad: '自分で作ったほうがうまいな。',
			exbad: 'こんなカスのような食べ物で済ますつもりか！？',
			exgood: 'この美味さがあれば、千年の孤独も 何ということもない！',
			good: 'この美味しさ、憎しみよりも思い出に残るものだ。',
			lackmoneyangry:
				'ぼり屋か！太子様からの家計が一度の食事代でほぼ尽きた！？',
			lackmoneynormal: '金も憎しみもほぼ消えてしまった。',
			norm: 'ないよりマシか。',
			repell: '恨まれるのが怖くないのか？',
			seenRepell: '夜雀女将も気が小さいな……',
		},
		name: '蘇我屠自古',
		spellCards: {
			negative: [
				{
					description:
						'次の完璧に演奏できなかった料理は天雷を引き起こし、仲間一人を30秒間気絶させる。',
					name: '天罰「天雷爆撃」',
				},
			],
			positive: [
				{
					description:
						'稲妻の力を借りて、30秒間自身と仲間の移動速度が30%アップ！',
					name: '雷影「電光石火」',
				},
			],
		},
	},
	3009: {
		chat: [
			'葉っぱを銭に変えるのは便利なものじゃのう～',
			'伝統と現代が交える風格はわしの好みじゃ。',
			'儂はまだまだ現役じゃよ――',
			null,
		],
		description: [
			'化け狸の親分。相応の威厳と親分らしさがあり、変幻術に長けている。だがどれだけ変幻が上手でも、しっぽと耳を隠しきるのは無理らしい。ちなみに、実はしっぽの大きさは妖力の表れなので、最初から隠すつもりはなかったのかもしれない。',
			null,
			null,
		],
		evaluation: {
			bad: 'がっかりしたのうー。',
			exbad: '儂を愚弄する気か？本物のいたずらを見せてやろう！',
			exgood: 'たぬきの恩返しに値するごちそうじゃったのう！',
			good: 'ほっほっほっー。さすが儂が気に入った妖獣じゃー。',
			lackmoneyangry: '葉っぱ払いしなかっただけで義理堅いと思え！！！',
			lackmoneynormal: '葉っぱはたくさんあるんじゃが、銭はこれだけじゃ。',
			norm: 'この程度なのか？',
			repell: '今時の妖怪は敬老の美徳も忘れたのうー。',
			seenRepell: '帰ってたぬきたちと飲んだ方が面白いわい～。',
		},
		name: '二ッ岩マミゾウ',
		spellCards: {
			negative: [
				{
					description:
						'30秒間、受け取るお金がすべて葉っぱが変化したものとなり、リザルト画面で初めて判明する。この期間中に獲得したすべてのお金は収入にならない。葉っぱ払いは最悪！',
					name: '「悪徳商人を懲らしめる最良の方法」',
				},
			],
			positive: [
				{
					description:
						'複数の狸を召喚し、客席の顧客に化け（マミゾウ本人は除く）行列に並ぶ。狸の好みや予算は変化対象と同じになるが、レア客のスペルカードの使用回数は1回に制限される。',
					name: '「化け狸十変化」',
				},
			],
		},
	},
	4000: {
		chat: [
			'今日取材したものも使えないわね……',
			'情報を得るには大衆に入り込むしかない。',
			'仕事と休息をうまく配分したほうが長持ちするわよ～。',
			'新聞は料理と同じ、スパイスがあったほうが美味しいですよ～。',
		],
		description: [
			'幻想郷のあちこちを奔走し、取材したことを新聞にする鴉天狗。有名な『文々。新聞』の作者だ。有名なのは新聞の質がいいからではなく、数が多すぎるから……',
			'元々強いうえに新聞という強力な武器もあってか、文さんは幻想郷で嫌われがちだ。でもこんなに一生懸命仕事する彼女を見ると、なんだか励まされた気分になる。新聞のデタラメな部分が減るといいんだけど……',
			'新聞って本当に偉大だ！文さんの新聞は幻想郷の過去を記していて、すこし真実とズレたところもあるけれど……いい思い出として残るものもたくさんある！文さん、自分に合う新聞のスタイルが見つかるといいですね。',
		],
		evaluation: {
			bad: 'ちょっと、こんなので大丈夫なの……',
			exbad: '一面に載せられるほどまずいわね！',
			exgood: 'この料理は絶対ビッグニュースになるわ！',
			good: 'この料理、バズる可能性大ね。',
			lackmoneyangry:
				'こんなふざけた値段を報道しなかったのを感謝しなさい！',
			lackmoneynormal:
				'自費で新聞を作りすぎて、夜食も払えなくなるところだった。',
			norm: 'ニュースの材料としては普通かしら～。',
			repell: 'ちょっと！？報道するわよ？',
			seenRepell: '客を追い払ってどう情報を探るのよ？',
		},
		name: '射命丸文',
		spellCards: {
			negative: [
				{
					description:
						'猛烈な暴風が食堂に吹き荒れ、遠隔配膳ができなくなる。30秒間持続。同時に新聞でぼったくり店と非難され、翌日から人気店状態が消失する。',
					name: '「筆槍紙弾禁制の道」',
				},
			],
			positive: [
				{
					description:
						'新聞を利用し店を宣伝し、翌日から店が人気店になる。3日間持続。人気店：顧客の予算が10%、顧客数が5%上昇する。「看板」タグが人気になる。店がすでに人気店か、宣伝が行われている場合、このスペルカードは以下に変化する。「食堂風神雲気無双」メニューの「看板」タグのある料理は人気料理になる。人気料理は、調理時間が5秒より短い場合は即時完成する。世論の後押しを受け、「人気」タグを好む顧客が人気料理を食べた際、追加注文率が30%上昇し、飲み物分の消費が返還され、最大追加注文回数が必ず1回増加する（回数増加効果は一食卓で一回だけ発生）。30秒間持続。',
					name: '「八衢潮流風靡幻想」',
				},
			],
		},
	},
	4001: {
		chat: [
			'孤独は毒であり、薬でもあるわ。',
			'少量の毒は薬にもなる。',
			'酒の飲み過ぎは体への毒なのよ。',
			'ひまわりにも毒性があればいいのにね。',
		],
		description: [
			'劇毒のすずらん畑に一人で住んでいる付喪神。まだ生まれたばかりなので経験も知識も不足していて、人との付き合い方もあまり知らないようだ。広いすずらん畑で一人でブツブツしていたり踊り回ったりする姿は、かわいいけどちょっと変……性格は素直でストレートだけど。',
			'妖怪になっても体はまだ人形らしい。だから体内が毒だらけになっても何も感じないようだ。人間への友好度は低く、なんと食べ物に毒を入れて人間を操ることもあるらしい……若い故に手加減を知らないので、心が成長するまでは必ず注意を払わないと！',
			'毒人形が実はこんな純真無垢な子だとは、誰も思わないでしょう。教えられたものを何でもそのまま受け入れる。生まれたばかりの妖怪が少しずつ成長していくのを見守るのって、こんな感じなんだ！私自身も若いから先輩としての経験はあんまりないけれど、今はこの子を守って幸せな成長を見届けたい……私のほうが弱いかもしれないけれど。',
		],
		evaluation: {
			bad: 'スーさんはあんまりこういう味好きじゃない。',
			exbad: 'スーさんの毒には敵わない！',
			exgood: '毒以外で感じられる最大の満足！',
			good: '私もスーさんも好評価だよ！',
			lackmoneyangry: 'スーさんはこういうのが「ぼったくり店」だって！',
			lackmoneynormal: 'スーさんとせっかく貯めたお金がもう空っぽ…',
			norm: '料理って毒に比べれば大したことないね。',
			repell: 'この追い払う手を腐らせてやる！',
			seenRepell: 'スーさんが急に興ざめたって。',
		},
		name: 'メディスン',
		spellCards: {
			negative: [
				{
					description:
						'「劇毒中和」を解除する。料理制作時、スーさんはさらに「憂鬱の毒」タグを追加し、当該タグのある料理を食べた顧客は追加注文しなくなる。30秒間持続。',
					name: '鈴蘭「枯れる花園」',
				},
			],
			positive: [
				{
					description:
						'「枯れる花園」を解除する。メディスンが料理に含まれる有害物質を操作し、料理タグの衝突をなくす。30秒間持続。さらに「度数普通」タグのある飲み物を1つ獲得する。',
					name: '分解「劇毒中和」',
				},
			],
		},
	},
	4002: {
		chat: [
			'くだらない戦闘には興味ないわ。',
			'花たちも喜んでいるようよ。',
			'ここがこんな雰囲気なのは初めてよ。',
			'花に囲まれれば、一人で飲んでも構わない。',
		],
		description: [
			'優雅な女性のように見えるが、なぜだかよく「花の暴君」と呼ばれているらしい。怖い噂話が多いけれど、実際に人間や弱小妖怪へのいじめを見た人は全然いない。本当の彼女はいったいどんな人なんだろう？',
			'花の世話をする姿を一度見ればあんな噂話は信じられなくなる。でも、あんなに強い妖力を持っているのに、なぜ飛び交う噂を我慢して黙って中傷に耐えているのでしょう？',
			'間違っていた！彼女はそんなことを「我慢」してはいなかった、なぜなら気にしたことがないからだ。だから説明さえも余計なこと。幽香さんの一番強いところは彼女の心なんだ。彼女を無敵にするのは強大な妖力ではなく、純粋で曇りのない心だと思う。',
		],
		evaluation: {
			bad: 'こんなやり方では、どんなにお気楽な花でも咲きたくなくなるわよ。',
			exbad: 'ふふ！受けて立つわ！',
			exgood: 'あなたが持つのは心の花を咲かせる力よ！',
			good: '今の気持ちはゆっくり開く蕾みたいね。',
			lackmoneyangry: '魔砲を喰らわせてないだけ感謝しなさい。',
			lackmoneynormal: 'こんなふざけた値段では店が長続きしないわよ。',
			norm: 'これでは花に好かれないわよ。',
			repell: null,
			seenRepell: null,
		},
		name: '風見幽香',
		spellCards: {
			negative: [
				{
					description:
						'優しい微笑みで客席の先頭に行き、魔砲で射線上の食卓をすべて吹き飛ばす。その日の夜は修理不可能。該当の食卓で食事をしていた顧客は逃げ出す。',
					name: '「決闘スパーク!!!!」',
				},
			],
			positive: [
				{
					description:
						'花を1つ植え、能力で成長させる。気分が充実している場合は追加で1つ植える。1つの花は24秒ごとに25円のチップを生成する。幽香以外のレア客が奨励スペルカードを使用する時、ランダムに1つの花がスペルカードの力を吸収し咲き誇る。その地域のレア客がこの花に惹かれて店に訪れ、来店時花を摘むようになる。花が咲いている間、顧客は料理を食べ終わったあと気分が15上昇する。15秒後花は枯れ、1回の 「散華飾り」 を獲得し、コンボ中断のミスを1回耐えられるようになる。',
					name: '「花鳥風月群芳咲く」',
				},
			],
		},
	},
	4003: {
		chat: [
			'革命は生ぬるいやり方では成功しないものだ。',
			'弱小な妖怪たちよ、私と一緒に立ち上がれ！',
			'いつか貴様も傘下に入れてやる。',
			'「おふくろの味」などを恋しがるのは軟弱の極み！',
		],
		description: [
			'甘い言葉で人を惑わせるのが上手な天邪鬼。幻想郷をひっくり返すという宣言で、血の気が多い妖怪や人間の若者を惑わして手下にしたのに、資金不足で待遇が悪く、天狗に広告を出してまで観光客から通行料を取ろうとするって…どう見ても無茶苦茶だ。',
			'正邪さんは本当に下剋上を目指しているのだろうか。成功してからのことにはあまり興味がないように見える。社会に逆らうことに喜びを感じているだけで、本当に社会を変えようとは思っていないのかもしれない。',
			'仲間が次々と離れていくのを見たら、普通はこんなやり方じゃダメだって思うはずだ。でも正邪さんは諦めることは全然考えていない。誰もがのんびりと暮らしている幻想郷の中では珍しく、目的達成まで止まらないタイプである意味感心する…',
		],
		evaluation: {
			bad: '軟弱な味だ。',
			exbad: '私が覆したいのは、こんな籾殻を食べ物にする世界だ！',
			exgood: '力がみなぎっている！今の私は、どんなものも覆せるぞ！',
			good: '力が溢れ出てくる！これが美食の威力なのか？',
			lackmoneyangry: 'チップはみかじめ料だと思え！',
			lackmoneynormal: '飲食店で金を搾り取るのはいい考えだな。',
			norm: '「まあまあ」はひっくり返しても「まあまあ」だな。',
			repell: 'ここは誰の縄張りだと思っている！？',
			seenRepell: '弱小妖怪はいつになったら抑圧されなくて済む！？',
		},
		name: '鬼人正邪',
		spellCards: {
			negative: [
				{
					description:
						'下剋上の階級反転タイム！自分の予算と店内の顧客の最高予算を入れ替える。さらに15秒間、自身以外のすべての顧客の予算を店内の最低予算レベルまで減らす。',
					name: '逆弓「逆転世界」',
				},
			],
			positive: [
				{
					description:
						'何でもひっくり返す程度の能力を発動し、顧客の好みを逆転させる。店にいる自分以外の顧客の嫌いなタグを好きなタグに逆転する。30秒間継続。並んでいる顧客を含む一般客の総数が7以上の場合、このスペルカードが以下になる。逆弓「天壌夢弓の詔勅」並んでいる客を含むすべての顧客の、最大追加注文回数が1回、予算が25%増加する。各一般客は最大3回までこの効果を受ける。',
					name: '欺符「オーバーシュート」',
				},
			],
		},
	},
	4004: {
		chat: [
			'ここに来ればいい話が聞けるの？',
			'輝針城がこんなに賑やかなのは初めてよ…',
			'彼女もよくここに来るんじゃないの？',
			'この寂しい城に活気をもたらしてくれてありがとう。',
		],
		description: [
			'一寸法師に憧れる小人族の城主。控えめで真面目な性格で、ヒーローを夢見る勇者厨だ。冒険に憧れる箱入り姫ってなんだか新鮮かも。和菓子が得意なのも気質と合っている！',
			'勇者の冒険に憧れて準備もたくさんしてきたのに、ずっと旅に出ることはなかった。完璧な伝説を残せるかどうかが気になっているらしい。でも色々気にしすぎじゃないかな……',
			'胸のつかえがとれた針妙丸さんがついに勇気を持って旅に出た。「勇気を持てば世界を救える」物語が、彼女の道標になっているようだ。結果ばかりを気にしては一歩も踏み出せなくなる。心のままに動いたほうが自分に合うことを、彼女から学びました！',
		],
		evaluation: {
			bad: '腹の足しにもなれない。',
			exbad: 'こころの勇気を蝕まれるくらいまずい！',
			exgood: 'この料理、旅に出る勇気をくれた！',
			good: '勇者の物語を読むような感じね！',
			lackmoneyangry: '貴族とはいえ落ちこぼれ…',
			lackmoneynormal:
				'小人族は長い間人里離れた生活してたけど、外の物価はもうこんなに高いの？',
			norm: '腹の足しにはギリギリなるかな。',
			repell: '未来の勇者様を追い払うなんて！？',
			seenRepell: '勇者として、こんなことを見過ごすわけにはいかない。',
		},
		name: '少名針妙丸',
		spellCards: {
			negative: [
				{
					description:
						'打ち出の小槌の魔力により、体が3倍の大きさになる。30秒間持続。',
					name: '小槌「おおきくな～れ！」',
				},
			],
			positive: [
				{
					description:
						'小槌でレジを叩き、1回の 「打ち出の小槌の力」 をかける。小槌の溢れ出る魔力により営業終了時の売上が増大する。1回目の「打ち出の小槌の力」は売上を7%増加し、2回目以降は1回ごとに2%増加する。',
					name: '宝槌「インフレ危機」',
				},
			],
		},
	},
	4005: {
		chat: [
			'夜更かしは肌に悪い…',
			'ダイエットは美容には絶対に繋がらないわね。',
			'夜も暑いわね…',
			'髪も切ったほうがいいかしら…',
			'女将さんお疲れ様～。',
		],
		description: [
			'穏やかな狼女で、親しみやすいお姉さんのようだ。竹林は月人が住み着いたからか月にまつわる妖怪が多いようで、影狼さんもそのひとりだとか。',
			'お肌が気になっているらしく、こんなにオシャレ好きな狼女は初めて見ました。草の根妖怪の毎日は穏やかで賑やかだ。たまに思うけれど……私も店を開いてなかったら、きっとこんな生活を送っていたでしょう。',
			'影狼さんの狼としての部分は、外の世界でもう絶滅しているニホンオオカミだ。一時は敬われ拝められたけれど、結局絶滅してしまってかわいそうだ。幻想郷の人間も妖怪も、私たち獣（鳥）をもっと愛するべきだ！',
		],
		evaluation: {
			bad: '女将さんの腕も安定してないようね。',
			exbad: 'こんな料理からなんの善意も感じられない。',
			exgood: '女将さんの料理こそ本物の円満！',
			good: '料理にある善意を味わえるわよ！',
			lackmoneyangry: '抜けた毛がお金になればいいのに。',
			lackmoneynormal: '夜食ってついつい食べ過ぎちゃうよね…',
			norm: 'もっとよくできるはずよ。',
			repell: '草の根妖怪にも尊厳があるわ！',
			seenRepell: 'どうして仲良くできないの？',
		},
		name: '今泉影狼',
		spellCards: {
			negative: [
				{
					description:
						'すべての顧客は「満腹感」タグがない料理に最低評価を出すようになる。元から「満腹感」が嫌いな顧客は必ず最低評価を出すようになる。30秒間持続。',
					name: '餓狼「爆食の月下舞踏」',
				},
			],
			positive: [
				{
					description:
						'顧客の心の底にある野性を目覚めさせる。「肉食」と「山の幸」が好きになり、それに基づいて料理を評価するようにする。元から該当のタグが好きな顧客は、関連料理に必ず最高評価を出すようになる。30秒間持続。',
					name: '狼魂「野性覚醒」',
				},
			],
		},
	},
	4008: {
		chat: [
			'フランったら、いつも元気が尽きないわね…',
			'後でフランにもちょっと持ち帰りましょう。',
			'この店の運命は、静かに変わったかもしれないわね。',
			'我が家のメイドと比べたらまだまだね。',
		],
		description: [
			'紅魔館の主人。幼い子供に見えるが、近づくとそのオーラに圧倒されて言葉も出せなくなる。さすが名の知れた吸血鬼の領主！でもワガママな時は本当に子供みたい…まだ未熟なようだが、多くの人の運命を背負っている。あんな小さな背中で大家族を支えている姿は、本当に大黒柱らしい。レミリアさんも、みんなが思うほど自己中心的な人じゃないのかもしれない。',
			null,
			'概要',
		],
		evaluation: {
			bad: '最初から何も期待してなかったわ。',
			exbad: 'こんなもの作ったんだ、神槍で串刺しの方が良かったかな？',
			exgood: '美味しいものこそ、尊い吸血鬼様にふさわしいわ！',
			good: '今回はまあまあね。ちょっとだけ期待に値するものになったわ。',
			lackmoneyangry: '咲夜が用意したお金はこれだけよ！',
			lackmoneynormal:
				'自分でお金を持って出かけるのはまだ慣れてないから…',
			norm: '我が家のメイドと比べたらまだまだね。',
			repell: 'ふん。甘やかしすぎたみたいね——',
			seenRepell: '帰って咲夜の料理を食べようっと。',
		},
		name: 'レミリア',
		spellCards: {
			negative: [
				{
					description:
						'レミリアが自分の威厳を示し、血霧で左下の注文エリアを覆う。60秒間持続。',
					name: '夜符「紅霧異変再臨」',
				},
			],
			positive: [
				{
					description:
						'レミリアが紅魔館の主の名において、真夜中に宴会を開く。当日終了時に食堂が 「不夜城レッド」 状態になる（すでに終了している場合は即座に発動する）。営業終了まで継続する。「不夜城レッド」：一般客の予算は必ず500円以上になる。仲間の仕事速度が100%上昇する。咲夜の場合は極限まで上昇する。顧客の追加注文率が100%上昇する。発動時レミリアが店にいる場合、60秒間営業が終了せず、一般客の更新速度が300%になる。レミリアがいない場合、店内の最後のレア客が退場する時に、その日の夜に発動した奨励スペルカードの数に応じた数の妖精メイドを召喚する。',
					name: '紅符「不夜城レッド」',
				},
			],
		},
	},
	5000: {
		chat: [
			'今日も疲れたなー',
			'忙しい一日がついに終わりました！',
			'今は自分をねぎらう時間だ！',
			'筋肉痛です――',
		],
		description: [
			'地上から来た私に親切にしてくれた月の使者で、永遠亭の鈴仙さんと同じ名前を持っている。たまに地上へのあこがれを見せたり、過去に何があったのかわからなかったり……月の使者の訓練が大変だったのかも。',
			'レイセンはかつて薬搗きウサギだった。でも薬搗きに耐えられずに幻想郷に逃げたせいで色々あって、最終的には月の使者になったようだ。彼女が地上に未練を示すのも無理はない。でも彼女は月の使者の仕事も好きではないみたいで、身も心も苦労しているようだ……。',
			'ずっと後悔の中で生きているのはどんな気持ちなんだろう。もし時間が戻ったら、彼女は薬を搗く仕事から逃げないのだろうか。それで彼女は幸せを感じるのだろうか。この質問は私にはできなかった……でも、迷い続けるよりも前を向いたほうがいいんじゃないだろうか？彼女がいつか本当の自由を手に入れることを願っています。',
		],
		evaluation: {
			bad: '今日もこのまま終わるのかな……',
			exbad: '大変な一日でした……',
			exgood: 'これが私の光です！！！',
			good: '女将さん、一日の疲れを癒してくれてありがとう！',
			lackmoneyangry: '私を売っても払えないよ！',
			lackmoneynormal: '給料を使い果たしそう……',
			norm: 'ありがとう、元気になりました。',
			repell: 'これも私の運命でしょう。',
			seenRepell: 'この世はどこも不公平な扱いがあるんですね。',
		},
		name: 'レイセン',
		spellCards: {
			negative: [
				{
					description:
						'レイセンはフィールド上に狂気の弾を打ち、その場の顧客に影響を与え続ける。狂気の影響を受けた顧客は、「度数高め」以外の飲み物には必ず最低評価を与える。30秒間持続。注記：狂気と狂気の間に干渉が起こる…とは？',
					name: '「酔っぱらって混乱している」',
				},
			],
			positive: [
				{
					description:
						'盛大なかがり火の宴を開き、その場に存在するウサギごとにランダムな食材1つ、またはランダムな飲み物1つを生成する。30秒以内に新しいウサギが現れた場合も、同様に食材や飲み物を生成する。食材が生成される確率は80%、飲み物が生成される確率は20%。',
					name: '「玉兎のかがり火の宴」',
				},
			],
		},
	},
	5001: {
		chat: [
			'たまには桃以外も食べましょ～。',
			'好きなものを食べて、かわいい人生を送る。',
			'今日の5回目の食事スタート！',
			'食いしん坊の境地とは、目で見て食べること。',
		],
		description: [
			'綿月家の姉。性格は優しく、時折子供っぽい一面を見せる。月の使者の訓練の際に玉兎たちにお菓子を持ってくることがたまにあるとか。訓練にはほとんど参加していないこともあり、玉兎に愛されている。',
			'豊姫さんはすごーーく桃が好きで、すごーーくのんびりしている。彼女のような強い人は、本当に何も心配しなくてもいいのだろうか。どんな環境でもこうして無邪気に生きることができるのは、ある種の能力でもあるんじゃないだろうか。',
			'豊姫さんの中にもやりたいことがあった。彼女はいつから引退したいと思っていたのだろうか。あるいは最初から、月の使者のリーダーを引き継ぐしかなかったのかもしれない。引退していないのは、一つは適切な後継者がいないから、もう一つは……おそらく依姫さんのためではないでしょうか？',
		],
		evaluation: {
			bad: '桃を食べに行ったほうがいいわね。',
			exbad: '食べ物を無駄にしないためには……',
			exgood: 'お店に泊まりたくなるくらい美味しかったわ！',
			good: 'おいしい！もっと食べたい――',
			lackmoneyangry: 'もう桃を残したでしょう？',
			lackmoneynormal: 'お金のことを考えすぎると風格を失うわよ。',
			norm: '食べ物を無駄にしないのが私のベースラインよ。',
			repell: 'すずめちゃんは悪いわーー',
			seenRepell: 'いじめはダメよ、スズメちゃん。',
		},
		name: '綿月豊姫',
		spellCards: {
			negative: [
				{
					description:
						'豊姫は、その地域または招待したレア客の中から、まだ来店していない顧客をランダムに3名「神隠し」にして、今晩食堂に来ることができないようにする。',
					name: '晦朔「天地未形」',
				},
			],
			positive: [
				{
					description:
						'豊姫は海と山を結び、幻想郷のある場所と繋げる。該当エリアの一般客とレア客が「面」を通って来ることができる。豊姫の能力によるエリアは、それぞれ独立して更新され、更新頻度は元の33%である。',
					name: '周囲の「山海千重」',
				},
			],
		},
	},
	5002: {
		chat: [
			'そんな時は瞑想をしてみましょう。',
			'食事のついでに明日の訓練計画をしましょう。',
			'食べ終わってから運動をしましょう。',
			'こんなに多くの人が夜食を食べる習慣があるとは思わなかった。',
		],
		description: [
			'綿月家の妹。性格は真面目で厳格。ウサギたちの戦い、学習、礼法の訓練を担っている――つまり月の使者のリーダーがすべき仕事をほぼ請け負っている。実戦はほとんど行われないがウサギたちの訓練は厳しく、怠けていると罰せられる。',
			'あまりにも真剣で訓練にも厳しく、ウサギたちはあまり懐いていないように見える。のんびりした姉とは裏腹に、依姫さんはリラックスできない状態が続いているようだ。賢い人は考えすぎてしまいがちなのかも……。',
			'依姫さんは師匠の意志を受け継ぎ、月の都に貢献しようと危機感を持っていた。兵士を厳しく訓練するのも戦争で死んでほしくないからだ。すべてを背負ってきた依姫さんは、強くて優しいですね……。',
		],
		evaluation: {
			bad: '……40点。',
			exbad: '0点！',
			exgood: 'これは満点に値する！',
			good: 'いいですね。90点あげます。',
			lackmoneyangry: '月の都に放っておくことはできません！',
			lackmoneynormal: 'この価格は……明日話しましょう。',
			norm: '60点。',
			repell: 'これは宣戦布告だと理解しますが？',
			seenRepell: '軍隊に不公平があってはなりません。',
		},
		name: '綿月依姫',
		spellCards: {
			negative: [
				{
					description:
						'依姫は神跡を起こし伝説の一部を封印する。「伝説」タグのある料理や、「伝説」タグのある食材を使った料理は作れない。30秒間持続。',
					name: '戒め「諸神聖裁」',
				},
			],
			positive: [
				{
					description:
						'依姫は神霊を召喚し、1つの「神耀桂冠」を付加する。今回提供された料理に「伝説」タグが付いていれば、追加でもう1つ付加する。レア客から大満足以外の評価が発生した場合、1つの「神耀桂冠」を消費して神跡を誘発し、評価を大満足に高める。',
					name: '神詔「衆神託使」',
				},
			],
		},
	},
	5003: {
		chat: [
			'ソクラテスもたくさん食べてね♡～',
			'魔界にもこんなお店があってよかった♡',
			'何かお手伝いできることはない？',
			'辛抱強く待てばいいわ～',
		],
		description: [
			'勤勉で善良で情熱的な女の子は、「ふわふわエレン」という魔法の店を開き、ソクラテスというちょっとクールな性格の猫を飼っている。',
			'助けが必要な人に出会うとエレンさんは十二分に助けてくれる、とてもフレンドリーな魔法使いだ！エレンさんは仕事に対してもかなり熱意を持っていて、会話をするたびに自分も元気になったような気持ちになる。',
			'見た目も性格も幼く見えるのに、何千年も生きている大魔法使いにはまったく見えない！長く生きた妖怪はたくさん見たけれど、それほど長く生きて、これほど純真でロマンチックで善良なことを維持できているのは、エレンさんだけです！',
		],
		evaluation: {
			bad: 'う～ん、お疲れ様でした……',
			exbad: '仕事にはもう少し気を遣う必要があるわよ……',
			exgood: 'ソクラテスがピカピカになるほど美味しかった!',
			good: '私もソクラテスも大満足よ！',
			lackmoneyangry: 'すみません、もっと頑張って働いてお金を稼ぎます……',
			lackmoneynormal: 'もっと頑張って働いて稼がないと……',
			norm: 'おかみさん、ごちそうさま！',
			repell: 'ソクラテスを連れてちゃダメだった？',
			seenRepell: 'お客様に対しては平等にしないと～。',
		},
		name: 'エレン',
		spellCards: {
			negative: [
				{
					description:
						'ソクラテスはフィールド上の仲間を威嚇し、移動速度を30%、作業速度を50%減らす。30秒間持続。',
					name: '「ウサの猫」',
				},
			],
			positive: [
				{
					description:
						'顧客の注文が完了し「普通」以上の評価を得ると、座席の近くにふわふわキャンディを1つ落とす。30秒間持続。',
					name: '「恋のキャンディハウス」',
				},
			],
		},
	},
	5004: {
		chat: [
			'この実験データのセットは再検証が必要だ……',
			'気がつけばもう何日も食べていない。',
			'少し食べてから実験を続けよう。',
			'待ち時間は先ほどの計算を続けよう。',
		],
		description: [
			'独自に魔界で研究を進めている……学者？自称神霊だが、周囲からは悪霊や悪霊とみなされている。いずれにしても、彼女のしっかりとした強さと自信を感じることができる、彼女は一体どんな存在なんだろう？',
			'魅魔さんがあの霧雨家の魔法実験で生まれたなんて驚き！でもそんな縁があっても、信念の固い魅魔さんは誰にも所有されたり支配されたりしなかった。真理の追求と探求は魅魔さんの一生の目標であり、それで霧雨家と決裂して百年以上戦っても、本意を変えはしなかった。',
			'魅魔さんは魔理沙さんの師匠だった！たしかに二人には本当に共通点が多い！知識を求める執着や集中という点でも、道徳の面でも……そして、自分の弱さを見せたことがないところも……一見全く違うように見えるけれど。この二人の孤独で立派な人は、昔はどんな感じだったんだろう？',
		],
		evaluation: {
			bad: '素人が内輪でやるような出来だ。',
			exbad: '知識の宝庫を軽薄に足蹴にするような暴挙だ。',
			exgood: '未知の謎に出会ったような高揚感！',
			good: '公式を見つけ理想的な結果を得たように心躍る！',
			lackmoneyangry: '見縊られたものだ、恐怖を忘れたか――？',
			lackmoneynormal: '少し高くても問題無い。',
			norm: '無知な人の知識自慢のように退屈だ。',
			repell: 'ほう？　私に対して、結果はよく考えたかい？',
			seenRepell: '最も効率的なやり方だ。頭の回転が速いな。',
		},
		name: '魅魔',
		spellCards: {
			negative: [
				{
					description:
						'悪霊から恨みを買う：夜雀の歌の効果を得ることができず、特殊な調理器具の効果を発動できなくなる。30秒間持続。',
					name: '「神を冒涜する代償」',
				},
			],
			positive: [
				{
					description:
						'「幽玄封魔陣」を生成しする。すでに存在してい場合、法陣に2点のエネルギーを充填する。「幽玄封魔陣」：魅魔以外のレア客が任意のスペカを発動する際、1点のエネルギーを充填する。エネルギーが7点に達すると、全エネルギーを消費して誘発する。夢符「時空一粟」すべての客席の顧客は、残りの予算が上限まで回復する。さらに20秒間、調理時に食材を消費せず瞬時に完成し、顧客は必ず最高の評価をする。',
					name: '「幽冥の輪廻」',
				},
			],
		},
	},
	5005: {
		chat: [
			'人間界に行きたいわ。',
			'実は人間界にもこんなお店があるのよ。',
			'たまには魔界にいるのもいいわね。',
			'魔界がにぎやかなのは珍しいわ。',
		],
		description: [
			'魔界をこっそり抜け出して外遊（仕事）までする魔界人。自動で移動できるスーツケースを持ち歩いている。仕事内容は「ブログ」という場所で自分の旅の過程をシェアすることで、外の世界の人間に人気があるらしい。不思議に思うけれど、人間は人の旅行を見るのが好きなんだろうか？',
			'ルイズさんは旅行の過程を共有するだけでなく、自分のクリエイティブなデザインの共有もよくするみたいだ。彼女は目が肥えているだけでなく面白いアイデアも多くて、ファッションもよく知っていて、人を褒めることができて、スイーツを作ることができて……ルイズさんのような素敵な人になりたいな。',
			'ルイズさんのように心から人のために行動している人でも、すべての人に認められることはないみたいだ。お互いを理解しようとするのは容易なことではない。けれど、それでもルイズさんは愛する仕事をあきらめるつもりはなかった。彼女の未来がずっと「愛に背かない」ことを願っています。',
		],
		evaluation: {
			bad: 'このレベルだと、ブログに投稿してもフォローする人はいないわ。',
			exbad: 'ブログに投稿したら、腐ったトマトを投げられそう。',
			exgood: 'ぜひブログでこの料理をお勧めします！',
			good: 'ブログを投稿したくなるほど美味しい！',
			lackmoneyangry: '観光地のレストランだってこんなに高くないのに！',
			lackmoneynormal: 'これは一般価格より高いわね……',
			norm: '生ぬるいレベルね。',
			repell: 'お客さんを追いやる観光地に未来はない……',
			seenRepell: 'いくら有名な観光地でも客を傲慢に扱う資格はないのよ。',
		},
		name: 'ルイズ',
		spellCards: {
			negative: [
				{
					description:
						'その夜の営業終了後から60秒経過すると、店舗内の客を強制的に追放し閉店する。',
					name: '「失われた水晶の靴」',
				},
			],
			positive: [
				{
					description:
						'ルイズは魔法のカメラを店内に呼び出す。レア客が退店時に、満腹でなく予算も尽きていない場合、カメラでそのレア客を撮影し「旅人ブログ」に投稿する。当日終了後に「旅人ブログ」を公開し（撮影時に終了している場合は即時公開）、撮影した客像を投影し再び食堂に来店させる。形成されたレア客像はスペルカードを使用でき、好みも同様だが、予算と追加注文可能数は退店時のものとなる。',
					name: '「伝説のガリバー」',
				},
			],
		},
	},
	5012: {
		chat: [
			'久しぶりにご飯を食べに来たわね……',
			'次はゆっくり眠れそうね。',
			'長い道のり、本当にお疲れ様。',
			'あなたの努力を私はすべて目にしています。',
		],
		description: [
			'幻想郷を創造した賢者の一人。幻想郷最古の妖怪だそうで、神出鬼没でちょっと不人情な性格だけど、実はこれまで密かに幻想郷の安全と安定を守ってきた……多くの人に理解されていないけれど、おそらく彼女ほど幻想郷に真摯に向き合い、幻想郷を愛してきた人もいないだろう。',
			'概要2',
			'概要3',
		],
		evaluation: {
			bad: 'こういうものは隙間に捨てるべきね。',
			exbad: 'こんなものは隙間に入る資格さえないわ。',
			exgood: '流石ね！　あなたはもっと評価されるべきよ！',
			good: 'いいわね。有名になるのも頷けるわ。',
			lackmoneyangry: '幻想郷でこんな無茶苦茶な行為、許せない！',
			lackmoneynormal: 'スズメちゃん、この商売はちょっとやりすぎよ。',
			norm: '私が思っていたのとは違うようね。',
			repell: 'スキマで話さない？',
			seenRepell: '私が望む幻想郷はそうじゃないわ。',
		},
		name: '八雲紫',
		spellCards: {
			negative: [
				{
					description:
						'フィールド上に位置を変えるスキマをいくつか開く。スキマに近づくと吸い込まれ、ランダムに他のスキマに送られ、同時にトレーの飲み物が消える。30秒間持続。',
					name: '「現と隠の境界」',
				},
			],
			positive: [
				{
					description:
						'当日終了前に発動した場合、残り時間が44秒以上のバフは時間を凍結し、当日終了まで減少しないようにする。再発動または、当日終了後に発動した場合、残り時間が44秒以上のバフは時間を残り時間の10%分増加する（各バフで最大17秒増加）。',
					name: '「人と妖の夢」',
				},
			],
		},
	},
	9000: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	9001: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	9002: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	9003: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	9004: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	10000: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	10001: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	10002: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	11000: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	11001: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
} as const satisfies Readonly<
	Partial<Record<number, ILocalizedSpecialGuestText>>
>;
