import type { ILocalizedSpecialGuestText } from '@/domain/data/localization/types';

export const SPECIAL_GUEST_LOCALIZATION_KO = {
	0: {
		chat: [
			'친절한 이웃이 도우러 왔다구!',
			'...그런 눈으로 바라보지 마! 가게 위생을 더럽힌다거나 하진 않을 거니까!',
			'집 근처에 벌레가 나온다고...? 아냐! 나랑 관계 없거든!',
			'우리 곤충들의 부흥을 위해! 지금부터 「벌레 알람서비스」를... 뭐야! 왜 다물라고 하는 거야!',
			'밤하늘의 반딧불이는 뭔가 낭만적이지 않아? 잠깐 멈춰서 이 순간을 좀 더 즐겨보는 건 어때?',
		],
		description: [
			'곤충들을 사랑하는 오랜 친구. 리글을 알고 지낸 지 몇년이나 지났는데도, 그 벌레들은 정말 감당할 수 없어.',
			'리글은 단지 반딧불이 요괴처럼 보이지만, 사실 강력한 고대 곤충의 마지막 세대야. 그게 리글의 유일한 자존심이지.',
			'나는 리글에 대해 잘 알아. 비록 성격은 별로 안 좋아 보일지 몰라도, 사실 친구를 정말 아끼는 녀석이야! 이렇게 작은 반딧불이, 그저 희미한 빛으로 고독하고, 오랫동안 쇠퇴한 종족을 밝히기를 고대하고 있다니, 누가 상상이나 하겠어?',
		],
		evaluation: {
			bad: '오! 고마워!',
			exbad: '감히 나한테 이럴 수 있어? 우리 곤충들의 힘을 보여주지!',
			exgood: '이렇게 맛있는 요리를... 뭔가 보답을 하지 않으면 안 되겠어!',
			good: '곤충들의 기호를 잘 알고 있구나!',
			lackmoneyangry: '이 리글 님의 돈을 전부 털어가다니... 배짱이 큰데!',
			lackmoneynormal: '이번 건 외상으로 할게! 다음에 말해줘!',
			norm: '나쁘지 않은걸!',
			repell: '감히 나를 내쫓는다고!?',
			seenRepell: '우와, 실망스러워.',
		},
		name: '리글 나이트버그',
		spellCards: {
			negative: [
				{
					description:
						'사람들을 깨무는 날벌레 떼를 소환해, 가게 내의 모든 손님들을 집으로 돌려보냅니다. 가게 규모가 작다면 큰일이겠죠!',
					name: '준부 「나이트버그 토네이도」',
				},
			],
			positive: [
				{
					description:
						'반딧불이 떼를 소환해, 가게의 분위기를 한층 살립니다. 손님이 30% 더 자주 출몰합니다.',
					name: '등부 「파이어플라이 피너미넌」',
				},
			],
		},
	},
	1: {
		chat: [
			'「어두운 밤이 내 눈을 멀게 했다」니, 그 눈으로 어둠을 찾는 편이 더 낫지 않은건가-?',
			'「성자는 십자가에 매달렸습니다」라는 것 처럼 보여?',
			'여긴 너무 밝아. 눈이 이상해지는 느낌이야...',
			'가끔 사람들이 날 보고 홍마관의 세번째 아가씨라고들 부르는데, 왜 그런걸까나-?',
			'여기서 먹으려면, 주변을 어둠으로 물들여야 하겠는걸',
		],
		description: [
			'어둠을 좋아하는 오랜 친구. 항상 보면 바보 같다고 생각하지만, 이 두 점은 나랑 비슷한 거 같아.',
			'루미아는 항상 여기저기 돌아다니는데, 뭘 하면서 돌아다니는 지 상상이 안 가. 만날 때마다 엉뚱한 소리를 하는데... 대체 어디서 뭘 하는 거야?',
			'오래 지내면 지낼수록 루미아의 과거에 대해 궁금한데, 물어봐도 모르겠다고만 대답해. 그래도 우리는 좋은 친구야. 앞으로도 그럴거고.',
		],
		evaluation: {
			bad: '헤에~ 그~런건가~',
			exbad: '이게 그 암흑물질이라는건가?',
			exgood: '네 요리가 고기를 더 빛나게 해주고 있어!',
			good: '맛있어!',
			lackmoneyangry:
				'네 요리 정가는 마치 인류가 십진법을 채용했습니다 같은건가-!',
			lackmoneynormal: '지금 가진 돈은 이게 전부인데...',
			norm: '꽤 괜찮은데~',
			repell: '왜 날 내쫓는 거야?',
			seenRepell: '나도 저렇게 내쫓을 거야?',
		},
		name: '루미아',
		spellCards: {
			negative: [
				{
					description:
						'어둠이 부엌을 삼킵니다. 음료 선반을 포함해, 어디에 무엇이 있는지 알 수가 없게 됩니다. 20초간 지속됩니다.',
					name: '암부 「보더 라인」',
				},
			],
			positive: [
				{
					description:
						'도감에 기록된 고기들 중 3개를 무작위로 얻습니다. 어떻게 달빛의 힘을 이용해 고기를 만들어내고, 어째서 고기를 사랑하는 루미아가 당신에게 그 고기들을 주는지는... 상상에 맡깁니다.',
					name: '월부 「문라이트 레이」',
				},
			],
		},
	},
	2: {
		chat: [
			'배고파서 온 게 아니라, 잘 하고 있나 보려고 온 거야!',
			'빨리 일하지 않으면 빚을 못 갚을텐데?',
			'아무리 맛있어도 변제 금액에서 빼주진 않는다구~',
			'다음번엔 우리 고양이들도 데려와야 할 까봐?',
			'혹시 음식 포장도 돼? 우리 고양이들한테도 좀 주려고.',
		],
		description: [
			'불행의 검은 고양이 보다는, 광기의 검은 고양이라고 부르고 싶네.',
			'계속 날 감시하러 왔다고 해. 내가 연체한 적이 있었나? 빚은 항상 제때 갚았어!',
			'첸은 역시 무슨 목적을 숨기고 있는 것 같아. 하지만 나한테 대하는 태도를 보면 악의는 없는 것 같단 말이지... 그러니까, 뭔갈 숨기고 있던 말던, 항상 평소대로 대할 거야.',
		],
		evaluation: {
			bad: '그럭저럭이네.',
			exbad: '길고양이도 이런 건 안 먹는다고!',
			exgood: '뭐, 괘, 괜찮... 아냐! 맛있잖아!!',
			good: '맛있는 요리인걸, 칭찬할 만 해!',
			lackmoneyangry: '이자율이 너무 높았나 본데...',
			lackmoneynormal:
				'앗, 지금은 돈이 없는걸! 그치만, 다음에 돈을 빌릴 때 조금 깎아줄게, 어때?',
			norm: '나쁘지 않은데!',
			repell: '됐어! 여기 있어봤자 시간낭비지!',
			seenRepell: '손님들을 보내지 마! 열심히 일해서 빚 갚아야지!',
		},
		name: '첸',
		spellCards: {
			negative: [
				{
					description:
						'고양이들을 소환해, 손님들이 고양이들을 쓰다듬고 싶어지게 만들어 현혹시킵니다. 새로운 손님이 올 확률이 줄어듭니다.',
					name: '방부 「기문둔갑」',
				},
			],
			positive: [
				{
					description:
						'도감에 기록된 물고기들 중 3개를 무작위로 얻습니다. 이 물고기들이 어디서 나왔는지, 어째서 물고기를 사랑하는 첸이 당신에게 그 물고기들을 주는지는... 상상에 맡깁니다.',
					name: '선부 「봉황란」',
				},
			],
		},
	},
	3: {
		chat: [
			'정말로 요괴가 운영하는 가게에 발을 들이게 될 줄은 상상도 못 했네요...',
			'이런 곳을 자주 다닐 수가 없어서, 매 순간을 값지게 여긴답니다.',
			'이런 곳에서는 여러 이야기들을 들을 수 있어요.',
			'히에다 가의 아홉번째 당주로서, 책임감이 막중하달까요.',
			'요즘은 무엇 때문에 환상향연기를 집필해야 하는지도 모르겠어요...',
		],
		description: [
			'인간 마을의 고귀한 사람. 환상향연기의 저자이자 히에다 가의 영주인 멋진 여성이야.',
			'그 젊은 아가씨는 재능이 있지만, 건강이 좋지 않고 몸도 약해. 그럼에도 불구하고 가끔 내 가게에 방문하지. 상태가 걱정되지만, 대접하게 되는건 기뻐.',
			'그녀의 우아함은 완벽하지만, 나는 뭔가 환생같은 반항심 같은게 느껴져. 현재 그냥 인간 소녀잖아.',
		],
		evaluation: {
			bad: '잘 먹었습니다.',
			exbad: '...형언할 수 없는 맛이네요...',
			exgood: '몇 번이고 윤회를 겪어왔지만, 이렇게 맛있는 요리는 처음 먹어봅니다.',
			good: '오늘의 외출은 이것 하나 만으로도 가치가 있군요.',
			lackmoneyangry: '악덕업자라 기록해야겠군요...',
			lackmoneynormal:
				'어, 지금 하인들이 같이 오지 않아서... 돈이 없어요... 죄송합니다...',
			norm: '잘 먹었습니다.',
			repell: '환상향연기에 꼭 적어드리지요!',
			seenRepell: '다른 요괴들과는 다른 줄 알았는데...',
		},
		name: '히에다노 아큐',
		spellCards: {
			negative: [
				{
					description:
						'아큐가 경영 상의 흑역사를 하나 공개해, 가게의 분위기를 0으로 낮춥니다. 이를 들은 모든 손님들의 기분이 나빠집니다.',
					name: '구전 「검은 마음에 검은 역사」',
				},
			],
			positive: [
				{
					description:
						'유명 작가님의 서명이 적힌 색지를 받습니다. 특별한 교환을 할 수 있을지도 모릅니다!',
					name: '집필 「이것도 다 요괴 때문이다」',
				},
			],
		},
	},
	4: {
		chat: [
			'식품에 깃든 역사도 참으로 무궁무진하죠.',
			'가끔 드는 생각인데, 왠지 만월이 뜬 날엔 기억이 잘 나지 않는 것 같군요...',
			'그저 과거에 일어났다고 해서 역사라고 하는 게 아닙니다. 역사란 기록된 것입니다.',
			'최근 우리 학생들이 영 수업에 집중을 못 하는 것 같아요. 수업 수를 더 늘릴까봐요.',
			'요리에 깃든 건 맛 뿐만이 아니라, 사람들의 감정과 기억도 깃들어 있지요.',
		],
		description: [
			'인간 마을에서 교사로 일하는 요괴. 나한테는 요괴보다 인간에 더 가까워 보여.',
			'그녀는 비록 요괴지만, 인간들로부터 신뢰를 얻고 있지. 마을 사람들의 마음 속에서는 그녀가 무녀보다 더 믿음직하고, 무녀의 일을 대신 처리하고 있다고들 해.',
			'그녀는 인간과 요괴에 대해 동시에 고민하고 있어. 둘 중 어느 한 쪽도 무시하지 않고 말이야. 그런 게 바로 현자 아닐까? 그리고 본 적이 있는지 없는지 모르겠지만, 다른 모습을 지니고 있다고 했어.',
		],
		evaluation: {
			bad: '조금만 연습하면 더 잘 할 수 있을 겁니다.',
			exbad: '먹어도 아무런 맛이 나지 않는군. 버려도 상관 없으려나.',
			exgood: '탁월한 맛입니다! 요리에 역사가 담긴 것 같군요.',
			good: '맛이 썩 괜찮군요. 노력한 게 보이네요.',
			lackmoneyangry:
				'환상향의 주민들에게 있어 이 가격은 적절하지 않아 보입니다만.',
			lackmoneynormal: '죄송하지만 오늘은 이만 물러나야 할 것 같군요.',
			norm: '나쁘지 않군요. 더 정진하시길 바랍니다.',
			repell: '당신이 우리 학생이기만 했어도, 박치기 한 방 먹였을 텐데.',
			seenRepell: '참으로 못 배워먹은 행동이군요.',
		},
		name: '카미시라사와 케이네',
		spellCards: {
			negative: [
				{
					description:
						'케이네 선생님의 박치기 공격! 효과는 굉장해, 20초간 기절하게 됩니다. 이동 키를 연타해 더 빨리 회복할 수 있습니다.',
					name: '국부 「비급ㆍ박치기」',
				},
			],
			positive: [
				{
					description:
						'삼종의 신기ㆍ검 무작위 야채 2종을 얻습니다. 삼종의 신기ㆍ경 15초동안, 새로 하는 요리가 재료를 소모하지 않게 됩니다. 삼종의 신기ㆍ옥 마음의 자물쇠를 풉니다. 특별한 손님의 모르고 있는 비밀 정보 한 개를 공개합니다. 삼종의 신기ㆍ향 만족한 케이네 선생님이 당신의 가게를 홍보합니다. 오는 손님이 많아집니다. ——삼종의 신기가 네 개인 건 상식 아닌가?',
					name: '국부 「삼종의 신기」',
				},
			],
		},
	},
	5: {
		chat: [
			'선인이라고 이슬만 먹고 사는 건 아닙니다.',
			'최근 인간 마을에 동물 애호 단체가 생긴 것 같습니다. 잘 된 일입니다.',
			'환상향을 못 본 사이에 뭔가 많이 바뀐 듯 합니다... 저 또한 그에 맞춰 적응해야만 합니다.',
			'하아... 어째서 이리도 속을 썩이는 이들이 많은겁니까...',
			'요즘 무녀는 어떤 것 같습니까? 더 노력하도록 설교라도 해야 할 필요성이 느껴지셨습니까?',
		],
		description: [
			'항상 진지한 얼굴을 하고 다니는 신비로운 현자. 나는 그녀에게서 다른 현자들과는 뭔가 다른 게 느껴져. 비록 한번도 제대로 만나 본 적은 없지만.',
			'모든 현자들이 이렇게 딱딱한 방식으로 말하나? 그녀랑 대화하면 뭔가 혼나는 느낌이야... 그래도 현자들을 대접할 수 있는건 상당히 좋네.',
			'수다스럽긴 하지만 정말 열정적인 사람이야. 약간 엄격한 옆집 언니 같아. 처음과 비교하면 성격이 많이 바뀐 것 같아. 예전에 비해 부드러워졌달까?',
		],
		evaluation: {
			bad: '수행을 더 해야만 할 것 같습니다.',
			exbad: '...이런 걸 음식이라고 내오신 겁니까?',
			exgood: '좋습니다! 이건... 금욕중인 선인조차 탐낼 맛입니다.',
			good: '맛이 좋습니다.',
			lackmoneyangry: '터무니없이 높은 가격에 깃든 욕망이 보입니다.',
			lackmoneynormal:
				'예산을 초과해 버렸는데... 아, 공짜로 수행을 도와드리는 건 어떻겠습니까?',
			norm: '나쁘진 않지만, 자만하진 마시길 바랍니다.',
			repell: '원래 올 생각도 없었습니다!',
			seenRepell: '어떻게 이런 어리석은 짓을 하시는 겁니까!?',
		},
		name: '이바라키 카센',
		spellCards: {
			negative: [
				{
					description:
						'모든 손님들이 현자마냥 수련을 하게 됩니다! 30초동안 속세의 모든 욕망을 저버리고, 가장 싼 음식과 녹차만을 주문합니다.',
					name: '「단악수선의 금욕시험」',
				},
			],
			positive: [
				{
					description:
						'가게와 음식에 만족한 카센이, 자신의 호랑이를 이용해 재주를 부리게 합니다. 다만 돈은 당신이 벌지만요...! 가끔씩 식사 및 대기중인 손님이 1~30엔 사이의 팁을 줍니다.',
					name: '「맹수의 예술적인 용례」',
				},
			],
		},
	},
	6: {
		chat: [
			'경영에 있어서는 내가 그대보다 훨씬 선배지...왜 그런 눈으로 보는건가?',
			'이해하기 어려운 건 굳이 이해하려 들지 말라고. 환상향의 생존법이다.',
			'네 마음을 굳게 다지라고. 바라는 게 있으면, 그걸 제대로 표출할 줄 알아야 하지.',
			'난 힘을 쓰는 타입은 아니다. 덕분에 지금까지도 살아있지.',
			'가게를 좀 꾸며보는건 어떤가? 필요하다면 우리 가게에 와봐. 가격도 적당히 싸게 해 줄테니.',
		],
		description: [
			'단지 평범한 상인일 뿐이라고 주장하는 인간. 그는 순수하게 관심사를 위해, 혹은 막무가내로 거래해. 경영자의 선배로서는 좋은 선배가 되겠지? 그리고 가끔 가게에서 편리한 걸 판매하는 경우도 있어.',
			null,
			null,
		],
		evaluation: {
			bad: '그저 평범하네만.',
			exbad: '이딴 걸 가지고 사업을 한다니, 어이가 없군.',
			exgood: '대단하군! 요스즈메가 요리를 이렇게 잘 할 줄이야.',
			good: '실력이 괜찮군!',
			lackmoneyangry:
				'어떻게 이렇게 터무니없는 가격으로 장사를 할 수가 있는가?!',
			lackmoneynormal:
				'지금은 돈이 없네만... 다음 번 우리 가게에 올 때, 가격을 1%정도 깎아 주겠네.',
			norm: '뭐, 가끔은 이런 것도 나쁘진 않지.',
			repell: '내 가게에 얼씬도 할 생각 말지어다!',
			seenRepell: '경영가로서의 자각은 하고 있는건가?!',
		},
		name: '모리치카 린노스케',
		spellCards: {
			negative: [
				{
					description:
						'특별 손님의 비밀 정보 한 가지가 숨겨지게 됩니다.',
					name: '「허위 사실 유포」',
				},
			],
			positive: [
				{
					description:
						'향림당 30% 할인 쿠폰을 받습니다. 내일까지 사용 가능합니다.',
					name: '「향림당 대출혈 세일중」',
				},
			],
		},
	},
	7: {
		chat: [
			'어떻게 요괴가 운영하는 가게가 신사보다 사람이 많은거야!?',
			'사람 상대로 장사하려면 위생을 중요하게 생각해야지.',
			'오늘은 별 일 없었어? 뭔 일이라도 생기면 나한테 얘기해.',
			'요괴랑 인간이 함께 식사를 한다니... 무녀라 그런지 이상한 기분이 드네.',
			'돈벌이가 꽤 짭짤한가봐, 나도 가게라도 열어야 하나...?',
		],
		description: [
			'가난하게 사는 호전적인 무녀... 진짜 인간인지 궁금하지만, 건드려 볼 생각은 아무도 없어.',
			'레이무씨는 정말 사양을 하질 않네... 하지만 눈치채지 못한 새에 정말 많은 도움을 받았어. 왜 그렇게 많은 요괴들이 그녀 주변에 있는지, 이해가 되기 시작했어.',
			'말은 날카로울지 몰라도 다 타인을 위해서 하는 걸거야. 자신이 무엇을 하는지 항상 알고 있는걸. 하쿠레이의 무녀가 레이무씨라서 정말 다행이야.',
		],
		evaluation: {
			bad: '내가 만드는 것 보다 못 하잖아.',
			exbad: '왜, 아주 퇴치당하고 싶다고 말을 하지 그래?',
			exgood: '돈을 다 쏟아부어도 의미 있는 맛이야!',
			good: '맛있어! 돈을 모아 온 보람이 있는걸!',
			lackmoneyangry: '나한테 도전하는거야? 퇴치해주겠어!',
			lackmoneynormal:
				'너, 우리 연회에 오면서 한 번도 돈을 낸 적이 없었잖아? 그러니까, 이번엔 조금 깎아주는 건 어떨까...?',
			norm: '나쁘지 않은 맛이야.',
			repell: '전에 퇴치하지도 않았잖아! 어떻게 이럴 수가 있어?!',
			seenRepell: '나중에 쟤네가 나한테 뭐라 말해도 난 몰라.',
		},
		name: '하쿠레이 레이무',
		spellCards: {
			negative: [
				{
					description:
						'메뉴 중 무작위 3가지 음식이 봉인되어, 30초간 만들 수 없게 됩니다.',
					name: '영부 「몽상봉인」',
				},
			],
			positive: [
				{
					description:
						'다음 특별 손님의 처벌형 스펠 카드를 무력화하는 보호 결계를 얻습니다.',
					name: '몽부 「이중결계」',
				},
			],
		},
	},
	8: {
		chat: [
			'최근 연회가 적어지는 것 같은데, 나 몰래 뒤에서 하는 거 아냐?',
			'너에 대해선 잘 알고 있어. 계속 봐왔지.',
			'술은 취하지 않아! 사람이 취하지.',
			'이런 왁자지껄한 곳에서 마시는 술이 가장 맛있는 법이지~',
			'너도 마음 속에 스트레스 담아두지 말고, 같이 한 잔 어때?',
		],
		description: [
			'환상향에 아직도 오니가 살고 있을 줄이야. 그녀를 처음 봤을 때 정말 깜짝 놀랐다니까! 진짜.. 진짜 오니일까?',
			'그녀가 진짜 오니임엔 의심할 여지가 없어. 평소엔 몸집이 작고 취한 모양새를 보이지만, 말에선 아주 무거운 중압감이 느껴져. 오니가 산의 최강자라는 전설이 괜한 말이 아니었어.',
			'비록 오니는 무섭지만, 일단 친구가 되면 가장 믿을만 한 존재야! 스이카씨는 항상 취해 있는 상태지만, 맑은 정신을 유지하지. 그런 기술은 정말 놀라워.',
		],
		evaluation: {
			bad: '술이 있어야 겨우 한 입 먹을까 말까잖아.',
			exbad: '이딴 쓰레기랑 어떻게 술을 마시라는 거냐!',
			exgood: '술보다 더 술술 들어가는 음식이 있을줄은 몰랐는데, 의외잖아!',
			good: '음식도 있고 술도 있고, 한 잔 짠 해야겠는걸!',
			lackmoneyangry: '형편 없는 연회야...',
			lackmoneynormal: '돈이 없어. 다음에 내가 술 사줄게!',
			norm: '술안주로 제격이구만!',
			repell: '오니가 오랫동안 안 오니 두려울 게 없나봐?',
			seenRepell: '연회에 온 손님을 어떻게 내쫓을 수가 있어? 지루하구만.',
		},
		name: '이부키 스이카',
		spellCards: {
			negative: [
				{
					description:
						'작고 귀여운 미니 스이카 셋이 찬장에서 가장 비싼 술 3병을 가져갑니다. 이렇게 귀여운 애들이 어찌 이런 끔찍한 짓을 할 수가...',
					name: '「백만귀야행」',
				},
			],
			positive: [
				{
					description:
						'작고 귀여운 미니 스이카한테서 술을 받습니다. 가끔 매우 희귀한 술을 받을 수도 있습니다. 왜 스이카가 술을 주냐고요? 술은 같이 마셔야 즐겁기 때문이죠.',
					name: '주탄오의 「귀음주」',
				},
			],
		},
	},
	9: {
		chat: [
			'내가 보기엔 허름한 가게일 뿐인데. 뭐, 지상에 있는 것 답군.',
			'천계의 늙은이들은 뭘 몰라도 너무 몰라!',
			'지상에 비하면 천계는 뭐든지 풍부롭고 여유롭지...만, 여기 좀 머물다 가는 것도 괜찮겠네.',
			'천인님께서 여기 오셨다는 것만 알면 지상 송사리들은 전부 몰려오겠지~',
			'지상에는 기괴한 것들이 넘쳐나네. 뭐, 그리 내키진 않지만서도 싫지도 않아.',
		],
		description: [
			'소문대로 공격적이고, 거만한 천인. 가급적이면, 이런 손님은 대접하고 싶지 않은데...',
			'내가 아까 한 말은 취소해야겠어. 내가 어떻게 손님을 내쫓을 생각을 할 수 있지? 그녀가 공격적이고, 거만하고, 배려하지 않고, 상식도 없고, 자존심이 높지만, 그래도 손님이니 최선을 다 해야지...',
			'사실, 그녀가 그렇게 나쁜 건 아냐. 말하는게 조금(많이) 열받긴 하지만, 천계에서 좋지 않은 시간을 보낸 것 같으니, 적어도 지상에선 편안하게 해 줄 수 있도록 노력해야겠어.',
		],
		evaluation: {
			bad: '하, 지상의 요리는 겨우 이딴 수준인가?',
			exbad: '바늘 천 개 삼키는 느낌이야!',
			exgood: '놀랍군! 이런 황폐한 땅에서도 이 정도 수준의 요리를 만들 줄이야!',
			good: '천계의 요리랑 비줄 만한 수준인걸.',
			lackmoneyangry: '흠. 내가 가게에 온 것 만으로도 영광인 줄 알도록.',
			lackmoneynormal: '흥, 이 정도면 한 끼로는 충분해!',
			norm: '지상 송사리 치고는 나쁘지 않군.',
			repell: '하찮은 게, 가소롭구나!',
			seenRepell: '형편없네. 저렇게 마음이 작아서야.',
		},
		name: '히나나위 텐시',
		spellCards: {
			negative: [
				{
					description:
						'하늘로부터 요석 탄막을 불러내 테이블에 내려꽂습니다. 해당 테이블에서 식사중이던 손님들을 내쫓고, 테이블은 수리를 위해 60초간 사용이 불가능해집니다.',
					name: '「천벌의 돌기둥」',
				},
			],
			positive: [
				{
					description:
						'천계로부터 내려온 천인의 힘을 발휘합니다. 모든 식사중인 손님들의 만족도가 85%로 상승합니다.',
					name: '「전인류의 비상천」',
				},
			],
		},
	},
	10: {
		chat: [
			'괜찮아! 난 책을 훔... 빌릴 뿐이니까. 밥값은 제대로 낸다구.',
			'젠장, 오늘도 레이무한테 져버렸다고!',
			'보는 눈이 이렇게나 많아... 먹고 튀지도 못해!',
			'마법은 말 그대로 파워라구! 요리랑 별 다를 바 없지?',
			null,
		],
		description: [
			'수다스러운 인간 마법사. 그녀가 혼자서 마법의 숲에 살고 있다는건 상상하기 어렵네. 정말 이상한 사람이야! 그래도 버섯에 대해서는 박식한거 같아.',
			'할 일이 없는 것 처럼 보이지만, 실은 키리사메 마법상점을 운영하고 있어. 수집을 좋아하긴 한데, 정리정돈을 안하다 보니 대부분은 쓰레기 수거장으로 오해하는걸 보면... 당연히 손님이 찾아올리가 없지...',
			'심술진 부분도 있지만 보통은 솔직하고 유쾌한 성격이라 나도 모르게 같이 떠들고 있지. 본인은 엄청난 노력파지만 다른 사람들에게 거의 말하지 않고 있는 것 같아. 어릴때부터 독립했던지라, 주변 친구들에게 의지하는 법을 배우면 좋을 것 같은데...',
		],
		evaluation: {
			bad: '평범하구만.',
			exbad: '이게 대체 뭐야!? 차라리 생 버섯을 먹고 말지!',
			exgood: '무언가 마법이라도 부린거야? 이렇게 맛있을 수가 있다니!',
			good: '연회의 주연으로 딱이야!',
			lackmoneyangry: '돈 좀 빌려오겠다구!',
			lackmoneynormal:
				'돈은 이미 냈다구. 뭐? 안 들어 있어? 몰라. 난 확실히 냈다구.',
			norm: '괜찮은데! 만드는 법 좀 가르쳐 달라구~',
			repell: '잠깐만, 믿어줘! 이번엔 돈을 갖고 왔다구!',
			seenRepell: '우와, 친구도 없나...',
		},
		name: '키리사메 마리사',
		spellCards: {
			negative: [
				{
					description:
						'요리, 재료, 음료 중 무작위 두 아이템을 훔쳐갑니다. 마리사가 엄청난 것을 훔쳐가고 나면 울 시간도 없겠죠... 참고로, 이렇게 물건을 훔쳐가게 되면 음식 값도 안 낸 채로 도망치게 됩니다. 그녀의 말에 따르자면, 훔치는 게 아니라 죽을 때까지 빌리는 것이라고 하네요.',
					name: '마부 「이 건 이제 제겁니다」',
				},
			],
			positive: [
				{
					description:
						'세 가지 무작위 버섯을 얻습니다. 가끔 매우 희귀한 버섯을 받을 수도 있습니다. 어떻게 별로 버섯이 만들어지고, 버섯을 사랑하는 마리사가 당신에게 주냐고요? ...모르는 편이 나을 겁니다.',
					name: '유성 「슈퍼 페르세이드」',
				},
			],
		},
	},
	15: {
		chat: [
			'땡땡이치는 게 아닌걸요!——뭐, 몰래 빠져나오긴 했지만...',
			'사쿠야 씨의 단검은 마치 의식이라도 있는 듯 잘 날라가죠!',
			'아가씨께서 언제쯤 만화책 다음 권을 돌려주실까요...',
			'메이드장이 찾기 전에 빨리 돌아가봐야겠어요.',
			'식전이나 식후에 운동은 금지! 편히 자는게 몸에도 좋다구요~',
		],
		description: [
			'악마의 집을 지키는 문지기 요괴가 사실 열정적이고 상냥한 언니일 줄이야! 잠도 많아 보이고 만나러 갔을때 항상 자고 있는게 걱정이야...',
			'이 거대한 저택을 혼자서 지켜야 한다니, 잠이 부족한게 당연할지도. 내가 도와줄 수 있는 일이 있다면 좋을텐데.',
			'그녀의 고향은 바다 건너 어딘가에 있다고 해. 하지만 환상향에는 바다가 없는데, 그 말은 고향에 돌아갈 수 없다는 걸까? 그 고향의 음식에는 유명한 것들이 많아서, 열심히 배우고 대접해주면 좋아할 거야.',
		],
		evaluation: {
			bad: '그냥 딱 배 채우기 용이네요...',
			exbad: '이런 걸 대접하다니! 너무해!',
			exgood: '이런 음식이라면... 머리에 칼을 수십 방이 꽂힐지라도 후회하지 않겠어요!',
			good: '이거라면 단검에 찔릴 각오도 되어 있어요!',
			lackmoneyangry: '문지기가 그만한 돈이 어딨겠어요!',
			lackmoneynormal: '이걸로 통장이 다 비어버렸네요...',
			norm: '음... 먹을 만 하네요.',
			repell: '너무 하세요!',
			seenRepell: '주인장이 이런 사람이었다니...',
		},
		name: '홍 메이링',
		spellCards: {
			negative: [
				{
					description:
						'성난 판다를 불러내 테이블을 파괴합니다. 만약 테이블에 손님이 식사 중이었다면 겁에 질려 도망갑니다. 분위기를 10 감소시키고, 90초간 테이블을 사용할 수 없게 됩니다.',
					name: '「판다한테 저항 금지」',
				},
			],
			positive: [
				{
					description:
						'메이링이 흥분을 주체 못 해 다음 30초간 묘기를 선보입니다. 2초마다 가게의 분위기가 1씩 증가합니다.',
					name: '채부 「방화현란」',
				},
			],
		},
	},
	24: {
		chat: [
			'불로불사라 해도, 결국에는 영원히 고독할 뿐이지...',
			'숯이 필요하면 날 불러!',
			'그 자식, 달로 돌아갈 방법을 찾게 되면 가버리려나...',
			'꺼지지 않는 불꽃으로부터, 불사조는 몇 번이고 다시 태어나지.',
			'길에 꽁초 버릴 때 조심하라고.',
		],
		description: [
			'미혹의 죽림에 사는 욕망없는 인간. 그녀는 이상한 걸 먹고 불멸의 존재가 되었어. (음식은 절대 주워먹거나 하면 안 돼.)',
			'모코우씨는 정말 멋진 사람이야. 인간임에도 강하고 호탕하지. 매운 음식을 좋아하는 사람은 쾌활하다고들 하는데, 모코우씨는 아닌 것 같네.',
			'그녀는 내가 생각했던 것보다 더 섬세해. 과거에 감히 상상할 수 없는 고난을 겪었던 것 같아. 그럼에도 불구하고, 남몰래 타인을 돕는 친절한 사람으로 알려져 있지. 그녀는 행복할 자격이 있어!',
		],
		evaluation: {
			bad: '좀 더 연습해야 겠는걸.',
			exbad: '이 음식은 너무 딱딱해서 이가 다 깨질 지경이야.',
			exgood: '아아... 산다는 건 얼마나 멋진 일인가...',
			good: '오래 살아왔지만, 이 정도로 맛있는 음식은 손에 꼽는걸.',
			lackmoneyangry:
				'이야, 시대가 발전하는 속도도 네가 가격을 올리는 속도는 못 따라가겠는걸?',
			lackmoneynormal: '나는 청빈한 삶을 살아왔다고. 이게 가진 전부야.',
			norm: '더 잘 할 수 있잖아?',
			repell: '...좋아. 나는 그냥 연습용이다 이거지.',
			seenRepell: '그딴 식으로 행동하지 말라고.',
		},
		name: '후지와라노 모코우',
		spellCards: {
			negative: [
				{
					description:
						'다음 30초동안 음식이 얼마나 잘 만들어졌든간에 상관 없이 평범함 평가를 받게 됩니다.',
					name: '후지와라 「멸죄사원상」',
				},
			],
			positive: [
				{
					description:
						'모코우가 화염을 내뿜어 모든 조리기구에 전해지는 열을 증가시켜 효율성을 올립니다(왜 도마에도 적용되는 지는 묻지 마세요). 다음 20초동안 음식들이 50% 더 빨리 조리됩니다.',
					name: '불사 「불새 -봉익천상-」',
				},
			],
		},
	},
	25: {
		chat: [
			'일하는 자만이 먹을 수 있다니, 나도 뭔갈 해야 할까?',
			'아름다운 다섯 개의 난제라, 오래 전에 포기해버렸지 뭐야.',
			'난 니트가 아냐! 뭘 하려고 할 때 마다 에이린이 귀찮게 하니까 의욕이 없을 뿐이야.',
			'환상향의 비는 pH농도 6 정도려나. 그렇게 산성을 띄는 것도 아니지.',
			'일곱 빛깔의 우담바라는 아름답지. 그래도 요리가 일곱 색깔이면 좀... 역겨워.',
		],
		description: [
			'영원정의 공주. 소문에 따르면 그녀는 달의 도시에서 왔다고 해. 어째서 달의 공주가 환상향에 와서 숨어사는걸까?',
			'그녀는 우아한 공주처럼 보이지만 어떨 때는 악당처럼 행동해... 어째서 그녀가 그 검은 토끼의 주인이 될 수 있는지 이해했어. (검다는 건 속내를 말하는 거야...)',
			'이런 고귀한 공주도 여느 사람과 마찬가지로 직업에 대해 고민하고 있다니. 카구야씨도 나랑 다를 게 없잖아. 여기선 몇년동안 일한 선배로서 응원해줘야지!',
		],
		evaluation: {
			bad: '여기까지 온 보람이 없네.',
			exbad: '이딴 오물을 내놓다니, 제정신이야?',
			exgood: '지상에 이런 맛있는 보배가 있는데, 왜 굳이 달로 돌아가겠어?',
			good: '이 맛은 옥이나 금보다도 값진걸.',
			lackmoneyangry: '지상에도 이런 협잡꾼들이 난무하는거야!?',
			lackmoneynormal: '흐음, 달과 지상의 가격 차이가 꽤 심해졌네.',
			norm: '지상의 음식은 예로부터 썩 괜찮았지.',
			repell: '무례한 것!',
			seenRepell: '갑자기 식욕이 없어졌어.',
		},
		name: '호라이산 카구야',
		spellCards: {
			negative: [
				{
					description:
						'시간을 빨리 감아 영업 시간을 30초 줄입니다. 자정이 된다면 영업이 강제로 종료됩니다.',
					name: '신보 「봉래의 옥의 가지 -꿈빛 고향-」',
				},
			],
			positive: [
				{
					description: '시간을 되돌려 영업 시간을 30초 늘립니다.',
					name: '「영야 되돌리기 -밝아오는 세계-」',
				},
			],
		},
	},
	27: {
		chat: [
			'「인생은 마법을 끼얹은 파스타 한 그릇이다」, 라던가.',
			'관은 너무 번잡하고 시끄럽지. 가끔은 나와야 겠어.',
			'나는 책을 마구잡이로 배치한 적이 없어. 책이 원하는 곳에 둘 뿐이지.',
			'진보한 과학은 마법과 구별하기 어렵겠지.',
			'요리와 마법의 융합이라. 재미있겠어.',
		],
		description: [
			'항상 잠옷만 입고 구석에 숨는 이상한 마법사. 그녀는 다른 사람의 시선이나 유행을 전혀 신경쓰지 않는 것 같아. 신체적으로 연약해 보이지만, 생각이 빨라. 좋은 몸을 갖는 게 좋은 마음보다 더 중요한데 말이지.',
			'파츄리씨는 책을 손에서 떼어놓질 않아. 책을 그렇게 오래 읽으면 눈이 피곤하지 않을까? 그리고 책에 나오는 말이 전부 다 맞는 건 아닐텐데, 이렇게 책만 읽고 다니면 지식은 좋아져도, 상식은 부족하잖아.',
			'스승님께선 지금까지 빈혈과 천식에 시달려 오신것 같아. 정말 걱정이야. (여기서만큼은 스승님이라고 불러도 되겠지?) 나와도 오랫동안 알고 지냈지만, 아직 나한테 그다지 친절하진 않아. 하지만, 스승님께선 내게 많은 지식을 가르쳐 주셨기 때문에 반드시 기대에 부흥할 수 있도록 노력할 거야.',
		],
		evaluation: {
			bad: '먹거나 잠자는 도중에는 대화를 삼가하도록.',
			exbad: '이런 쓰레기 가지고 가게를 열기로 한 거야?',
			exgood: '아무리 수백 권의 책을 읽는다 해도, 이런 심오한 요리를 만들기는 무척이나 어렵지.',
			good: '이런 음식을 만들어 낼 수 있다니, 대단하네?',
			lackmoneyangry:
				'가격이 옥이나 계수나무보다도 비싸다니, 말이 안 되잖아.',
			lackmoneynormal: '콜록... 갑자기 몸상태가... 돌아가야겠어...',
			norm: '책을 좀 더 읽으면 요리 실력도 나아지겠지.',
			repell: '무례한 것에겐 죽음이 딱 어울리지!',
			seenRepell: '흥, 딱하네.',
		},
		name: '파츄리 널릿지',
		spellCards: {
			negative: [
				{
					description:
						'다음 30초동안 모든 요리가 50% 확률로 암흑물질로 변합니다.',
					name: '금&수부 「머큐리 포이즌」',
				},
			],
			positive: [
				{
					description:
						'다음 30초동안 "문화적" 속성이 붙은 음식은 최고의 평가를 받게 됩니다.',
					name: '지식의 기묘한 모험 「문화의 바람」',
				},
			],
		},
	},
	28: {
		chat: [
			'이 몸이 최고!',
			'이 몸의 얼음은 말 그대로 날으는 새를 떨굴수도 있다구!',
			'이 몸을 평범한 요정이라고 생각하는 건 아니겠지?',
			'발효 음식? 음식을 왜 굳이 썩혀서 먹는거야?',
			'쉬는 시간이야! 배도 부르니까 놀자구!',
		],
		description: [
			'최강을 자칭하는 얼음 날개를 가진 요정. 그런 날개로 날 수 있다니 놀라워. 더 놀라운건 그 두뇌야. 항상 다른 결정을 내리니까. 어쨌든, 그 말을 진지하게 받아들일 필요는 없어.',
			'비록 치르노는 얼음 요정이지만, 활기차고 열정적이야! 사실 정말 강한 요정일지도 몰라. 특히 용기에 관해서라면. 좌절을 마다하지 않고 그저 나아가는데, 죽음조차도 막을 수 없을걸!',
			'치르노와 함께 있다보면 알게모르게 이끌려버려. 이게바로 리더쉽이란걸까? 하지만 치르노랑 있을땐 마음이 가벼워져. 서로 통하는게 있을지도 모르겠네. 혹시 나도 바보라서 그런건가? 랄까나~',
		],
		evaluation: {
			bad: '이런 걸로 이 몸을 내쫓을 수 있을 거라고 생각한거야!?',
			exbad: '이게 뭐야... 급속냉동된 고기를 먹는 것 같잖아...',
			exgood: '혀가 녹아내리는 것 같아!',
			good: '맛있네! 이 시간부로 이 몸 밑에서 일하도록!',
			lackmoneyangry: '돈! 없! 어!',
			lackmoneynormal: '요정이 그만한 돈이 어딨겠어.',
			norm: '먹다가 혀를 씹을 정도야.',
			repell: '최강인 이 몸을 내쫓다니 두고 보자ㅡㅡ',
			seenRepell: '사람을 뒤쫓는 건 재미 없어.',
		},
		name: '치르노',
		spellCards: {
			negative: [
				{
					description:
						'무작위 조리기구 3개를 얼립니다. 만약 조리기구가 음식을 조리중이었다면, 조리중인 음식 또한 얼어붙어 산산조각납니다. 30초간 지속됩니다. ——이 몸, 최강!',
					name: '동부 「퍼펙트 프리즈」',
				},
			],
			positive: [
				{
					description:
						'시원하게 마심 속성이 붙은 무작위 일반 음료 3개와 얼음 2~5개를 얻습니다.',
					name: '「달달한 서리 요정」',
				},
			],
		},
	},
	29: {
		chat: [
			'사람들이 날 만나게 되면, 그 때 인생 최고의 운을 누린 거나 마찬가지지 말야~',
			'와, 새대가리로도 이렇게 장사를 잘 한다구? 신기하네에.',
			'오오~ 장사가 잘 되잖아! 슬슬 보호비를 받아야 쓰겠어?',
			'아직 참 무르구만~ 다음에 내가 진정한 영업이라는 걸 가르쳐주지!',
			'나와 만난 걸 행운으로 알라구! 진짜로 행운이 넘치는 사람만이 날 만날 수 있으니까 말야.',
		],
		description: [
			'내 가게에 갑자기 나타난 토끼 요괴는 항상 사악한 모습으로 말썽을 피우지. 귀가 보이기만 해도 머리가 아파...',
			'항상 비싼 물건을 팔아서 바가지를 씌우지만, 가끔 유용한 것들도 있어.',
			'레이무씨가 항상 퇴치하는것도 불쌍한데... 돈만 된다면 가게에 불러들여도 나쁘지 않아. 인간들은 테위를 보는것 만으로도 상상할 수 없는 행운을 얻게 된다지?',
		],
		evaluation: {
			bad: '토끼들이 만든 경단보다 맛이 없잖아.',
			exbad: '나한테 이런 걸 갖다 준다고? 퍽이나 고맙네! 답례를 해 줄게!',
			exgood: '이 맛은 도대체...... 언니!! 부자 되시겠어!!',
			good: '꽤 하는데! 우리 토끼들한테도 만드는 법 좀 가르쳐주지 않을래?',
			lackmoneyangry:
				'이런 건 시킨 적이 없는데? 자기가 낸 요리는 자기가 치워야지?',
			lackmoneynormal: '돈은 이게 가진 전부야. 갖든 말든 맘대로 해~',
			norm: '이런 걸로 내 지갑을 열...... 뭐, 그럴까.',
			repell: '새대가리 주제에...',
			seenRepell: '악덕점포는 사기칠 가치도 없지.',
		},
		name: '이나바 테위',
		spellCards: {
			negative: [
				{
					description:
						'착한 아이"였는데"... 유전자에 공포를 다시 새겨줄 때가 왔나 보군요. 물건 강매가 한 번 더 발동하게 되고, 이를 거부할 시 또다른 처벌 스펠을 발동합니다—— 흉보「콤보 브레이커」 여태 쌓은 콤보가 초기화되고, 다음 30초간 콤보를 쌓을 수가 없게 됩니다.',
					name: '상기 「옛날 옛 적 공포의 토끼」',
				},
			],
			positive: [
				{
					description:
						'모든 재료 수집 지점이 재활성화되고, 다음 날 해당 수집 지점에 가 재료를 모으게 된다면 1~2개의 재료를 추가로 얻을 수가 있습니다.',
					name: '생기 「40잎클로버 정도의 행운」',
				},
			],
		},
	},
	30: {
		chat: [
			'이 세계에는 어떤 먹을거리가 있을까요? 기대돼요.',
			'이 세계의 사람들은 제 세계의 「각진」 것들과는 뭔가 다르네요.',
			'이 세계의 사람들은 전부 귀여워요! 저도 귀여워졌어요!',
		],
		description: [
			'「MC 환상향」의 마스코트. 「콜라보의 문」을 통해 이 세계로 왔대. 야작식당의 이미지 캐릭터이기도 하고. 이 세계의 사람들을 마인크래프트 세계로 초대해 두 세계간의 상호적 협력 관계를 이어나가고 있어.',
			null,
			null,
		],
		evaluation: {
			bad: '제가 여기까지 와서 이런 거나 먹어야 되는거에요?',
			exbad: '이세계의 여행자에게 이런 대접을 하시면 안되죠!',
			exgood: '굉장해! 제 세계로 돌아가면 모두에게 소개시켜주고 싶을 정도에요!',
			good: '맛있어요! 여행해 온 보람이 있는 것 같아요.',
			lackmoneyangry:
				'손님들의 등골을 빼먹는 건 이 세계에서는 흔한 일인가 보죠?',
			lackmoneynormal: '앗... 예산이...',
			norm: '엄청 기대했는데요...',
			repell: '와앗! 개발자한테 악덕업자라고 이를 거에요!',
			seenRepell: '우와ㅡㅡ 이 세계의 주인장은 너무한 거 아닌가요?!',
		},
		name: '모에 스미카',
		spellCards: {},
	},
	31: {
		chat: [
			'서니 「헤헤~ 오늘은 뭐가 기다리고 있을까?」',
			'루나 「우리 그림체, 뭔가 이상한 것 같지 않아...?」',
			'스타 「셋이서 한 자리라... 너무 좁은 것 같은데...」',
			'서니 「빨리 이 가게에서 가장 최고인 걸 내놓으라구!」',
			'루나 「그치만 우리 돈이 그렇게 많은 건 아니잖아?」',
			'스타 「몰래 저 주방으로 들어가서 뭔가 기술을 훔쳐오는 건 어때?」',
		],
		description: [
			'「삼요정의 폴짝폴짝 토벌 대작전」의 주인공들. 「콜라보의 문」을 통해 이 세계로 왔대. 끝없는 호기심과 행동력 덕분에 이 세계에서도 큰 환영을 받고 있어. 얘네를 보기만 해도 내 기분도 좋아져.',
			null,
			null,
		],
		evaluation: {
			bad: '요정한테 이런걸 먹이다니, 미안하지도 않아?',
			exbad: '이런건 개도 안 먹어!',
			exgood: '너, 너무 맛있어!! 최고로 HIGH한 기분이야!!',
			good: '대체 뭘 넣은거야!? 너무 맛있어!',
			lackmoneyangry: '이거 사기야! 우리한테 사기를 치는거야!?',
			lackmoneynormal: '돈을 안 내면 우릴 병에 가둬버리고 말거야...',
			norm: '평범하네.',
			repell: '와앗ㅡㅡ약한 요정을 괴롭히다니잇ㅡ!',
			seenRepell: '이래서 악덕점주라 불리는 거라구!',
		},
		name: '삼월정',
		spellCards: {},
	},
	36: {
		chat: [
			'내 이름의 린은 환상의 동물 기린 할 때 린이라구! 대단하지?',
			'우리 병원보다도 여기 오는 사람이 많잖아!',
			'오늘은 주사할 때 너무 세게 찔러넣었다고 환자한테서 컴플레인을 받았어...',
			'죽림의 돌팔이 의사가 어디서 난데없이 나타난거지?',
			'난 별로 인내심이 강한 편이 아니라구. 음식 빨리 줘!',
		],
		description: [
			'병원에서 일하는 인간 간호사. 그녀는 정직하고 순수하며, 건강 관리에 있어서 매우 신중하고, 자신의 몸을 돌보지 않는 환자들을 싫어하지. 이런 환자들한테 주사를 놓을 때 좀 더 아프게 찔렀을 거야.',
			null,
			null,
		],
		evaluation: {
			bad: '맛이 마치 약 같잖아...',
			exbad: '내가 자주 나타나지 않는다고 해서 함부러 대해선 안 되는거야!',
			exgood: '피로가 싹 가시는 느낌이야!',
			good: '맛있어! 요괴인데도 나보다 요리를 잘 하잖아...',
			lackmoneyangry: '허튼 소리! 이게 정상가가 아니란 건 알잖아!',
			lackmoneynormal: '지금은 이것밖에 없어요...',
			norm: '나쁘지 않네.',
			repell: '나보고 지금 나가라는 거야? 병원에 오기만 해봐!',
			seenRepell: '차별이라니, 최악이야.',
		},
		name: '사츠키 린',
		spellCards: {
			negative: [
				{
					description:
						'급하게 먹으면 체해요! 대기줄을 포함한 모든 손님들의 식사를 끝마치는데 걸리는 시간이 2배가 됩니다. 단, 도철의 만찬 같은 식사 속도를 증진시키는 버프들은 이 디버프보다 높은 우선권을 갖습니다.',
					name: '「꼭꼭 씹어 드세요」',
				},
			],
			positive: [
				{
					description:
						'사츠키 린의 특별 처방 하에, 재료에 들어있는 고콜레스테롤, 고염분, 고칼로리 등의 부작용이 제거ㆍ중화되어 손님들이 건강 걱정 없이 맛있는 음식들을 즐길 수 있게 됩니다. 대기줄을 포함한 모든 손님들은 자신들의 예산과 상관 없이 각각 30% 확률로 음식을 추가주문하게 됩니다.',
					name: '「아직 더 먹을 수 있어」',
				},
			],
		},
	},
	37: {
		chat: [
			'살아있는 동안 덕을 많이 쌓도록! 안 그러면 죽고 난 뒤 나한테 여러가지... 당할지도?',
			'좋은 일을 하면 좋은 보답이, 나쁜 일을 하면 나쁜 보답이. 인과응보지.',
			'내가 잔혹해? 헤에, 자업자득인 셈이지!',
			'동정 따윈 불필요한 감정이야.',
			'살아있음에 큰 행복을 느끼도록, 인간.',
		],
		description: [
			'작열지옥터의 경비병. 그곳의 죄수들을 고문하는게 일이라던데, 정말 무서워! 외모와 성격은 무시무시하고 목소리가 큰 건달처럼 말하기도 해. 공격적이고 강해서, 언젠가 내 가게를 부숴버릴까 걱정돼.',
			null,
			null,
		],
		evaluation: {
			bad: '지상에서는 이게 최선인가?',
			exbad: '지옥에 가고 싶은건가!?',
			exgood: '자네를 팔한지옥의 수석 요리사로 임명하고 싶군.',
			good: '지상의 음식도 꽤 하잖아!',
			lackmoneyangry: '나를 등쳐먹으려고 하는 건가? 지옥에나 가시지.',
			lackmoneynormal:
				'어째서 네가 가격을 정한다고 생각하는 거지? 가격을 정하는 건 나다!',
			norm: '무난하군.',
			repell: '젠장! 지옥에나 떨어져라...',
			seenRepell: '흠, 지상도 똑같이 약육강식의 질서가 펼쳐져 있군.',
		},
		name: '타치소라 시오',
		spellCards: {
			negative: [
				{
					description:
						'다음 120초동안 담백함/채식 속성이 붙은 모든 요리가 암흑물질이 됩니다.',
					name: '고문 「알부타」',
				},
			],
			positive: [
				{
					description:
						'공간을 다루는 능력을 사용해 모든 손님들을 자리에 봉쇄합니다. 손님의 돈과 위장이 남아도는 한 반드시 음식을 주문해야만 합니다. 예산의 70% 이상을 쓰지 않으면 탈출할 수 없습니다.',
					name: '「즐기지도 않고 가려고?!」',
				},
			],
		},
	},
	38: {
		chat: [
			'지옥의 개혁인가. 격렬한 전쟁이 벌어질 것만 같네...',
			'오늘의 행동은 내일 후회하게 될 거다.',
			'모든 악법은 전부 허망한 것이지.',
			'끝없는 미래에는 무한한 가능성이 기다리고 있다고.',
			'저 요괴 현자...... 아아, 그런가...',
		],
		description: [
			'신 지옥의 고위 행정관, 작열지옥터의 최고 책임자, 행정 및 사법 고문. 이런 높으신 분이 왜 여기에... 내 가게가 지옥에서도 유명한건가?',
			null,
			null,
		],
		evaluation: {
			bad: '열심히 일하지 않으면 죽을 만큼의 고난이 기다리고 있을 거다.',
			exbad: '고통스러운 경험이 가장 값진 교훈이지.',
			exgood: '지상에 있는 이런 별미들 덕에, 돌아가고 싶지가 않아.',
			good: '나쁘지 않잖아. 좀 더 시행착오를 겪어 보다보면 실력이 좋아질 거다.',
			lackmoneyangry:
				'불공평거래의 죄악은 언젠가 지옥에서 심판받게 될 거다.',
			lackmoneynormal:
				'불공평한 가격은 죄악이다. 나는 정당한 가격만을 지불하고 싶어.',
			norm: '내가 보기엔... 지금보다도 더 잘 할 수 있을 것만 같은걸.',
			repell: '환상향은 지옥의 손님조차 못 받아들이는 건가?',
			seenRepell:
				'저들에게는 아무리 시간이 지나도 잊혀지지가 않을 경험이겠지.',
		},
		name: '지엔 유우',
		spellCards: {
			negative: [
				{
					description:
						'다음 60초동안 모든 손님들이 무슨 음식을 받든간에 무작위 평가를 내립니다.',
					name: '율부 「전도착란」',
				},
			],
			positive: [
				{
					description:
						'논리와 추론의 힘을 사용해, 손님들의 남은 예산과 얼마나 더 시킬지를 알아볼 수 있게 됩니다.',
					name: '인과 「추리와 판단의 눈」',
				},
			],
		},
	},
	39: {
		chat: [
			'드디어 쉬는 날에 여길 오게 되었네요!',
			'전에는 참으로 실례를 범했습니다. 당신께서 용서해 주시니 다행입니다.',
			'으... 유유코님을 모시는 건 정말 혼이 빠지는 일이에요.',
			'혹시 도움이 필요하십니까? 제게 맡기십시오!',
			'명계에도 한 잔 가볍게 할 수 있는 식당이 있으면 참 좋을텐데요.',
		],
		description: [
			'명계의 주인을 섬기는 정원사이자 경비원이자 요리사... 즉 넓디넓은 백옥루의 안뜰을 관리할 뿐만 아니라, 사이교우지 가문과 주인의 안전을 지킬 필요가 있고, 동시에 대식가인 주인님의 욕구도 채워야 해. 어떤것이든 힘들어 보여. 내 가게에서 약간의 치유라도 받을 수 있으면 좋겠네!',
			null,
			null,
		],
		evaluation: {
			bad: '어라... 원래 이런 맛이 나는 음식이 아니지 않나요?',
			exbad: '아무리 장난이라도 너무하잖아요!',
			exgood: '우와... 이거야말로 아무리 해도 다다를 수 없는 경지의 음식 아니겠어요!',
			good: '저도 이런 맛있는 걸 만들 수 있다면 좋을텐데!',
			lackmoneyangry:
				'할아버지께서는 사기를 당할 것 같으면 바로 돌아서라고 하셨죠!',
			lackmoneynormal: '죄송합니다! 지금 가진 돈이 이것밖에 없어요...',
			norm: '이런 건 저는 못 만들겠죠?',
			repell: '에... 어째서...',
			seenRepell: '저렇게 내쫓기게 되다니, 안타깝네요...',
		},
		name: '콘파쿠 요우무',
		spellCards: {
			negative: [
				{
					description:
						'모든 손님들이 인내심을 잃는 속도가 두 배가 되고, 2초마다 분위기가 1씩 깎입니다. 60초간 지속됩니다.',
					name: '천상검 「천인의 오쇠」',
				},
			],
			positive: [
				{
					description:
						'요우무가 세련된 검술을 시연합니다. 이 검술 동작을 보고 감명받아, 이후 도마로 만드는 모든 요리들을 순식간에 만들어낼 수 있게 됩니다.',
					name: '옥계검 「이백유순의 일섬」',
				},
			],
		},
	},
	40: {
		chat: [
			'꿈에서 먹은 음식의 맛을 잊어버릴 수가 없어서, 다시 왔단다.',
			'음, 참새는 잔뼈가 너무 많아서 문제야...',
			'당신을 먹으면 안 되는 걸까? 아쉽네...',
			'신경쓰지 마. 그냥 평범한 손님이라고 대해줬으면 좋겠는걸.',
			'어머~ 식사 중에 그렇게 바라보시면 소녀 부끄럽사와요~',
		],
		description: [
			'환상향을 통째로 삼켜버릴 뻔한 무서운 괴물. 의식이 되돌아오면 모든 게 나아질 줄 알았는데, 깨어나서 날 보고 잡아먹고 싶어했단 말이야! 가끔 내 가게에 와서 침을 흘리며 나를 쳐다봐... 다시는 이 귀신을 만나고 싶지 않아.',
			null,
			null,
		],
		evaluation: {
			bad: '내가 생각했던 맛이 아니네.',
			exbad: '그냥 널 먹으면 안될까?',
			exgood: '내가 찾던 맛이야!',
			good: '가끔씩은 이렇게 밖에 나와서 먹는 것도 좋지~',
			lackmoneyangry: '어머, 지갑을 놓고 왔네?',
			lackmoneynormal: '계산? 이거면 충분하려나?',
			norm: '내가 생각했던 것과는 좀 다른걸.',
			repell: '그럼! 가게가 망하면 안 되겠지요~',
			seenRepell: '에? 되게 실망스러운 짓을 하잖아...',
		},
		name: '사이교우지 유유코',
		spellCards: {
			negative: [
				{
					description:
						'영업이 끝날 때까지, 재료를 5개 미만으로 사용한 모든 요리가 최저의 평가를 받게 됩니다.',
					name: '「양은 더 많이, 값은 그대로」',
				},
			],
			positive: [
				{
					description:
						'영업이 끝날 때까지, 모든 손님이 접시를 순식간에 비우게 됩니다. 다시 발동될 시, 효과가 변동합니다. 「묵염부앵화취접」 유유코가 1/3/5/8 (발동할 때마다 개수 증가)개의 나비를 보관함으로 보냅니다. 나비들은 보관함에서 요리를 꺼내 먹으며, 정가의 4배에 달하는 돈으로 환급해줍니다 (팁 보너스에 영향을 받습니다).',
					name: '「음식순간삭제술」',
				},
			],
		},
	},
	41: {
		chat: [
			'여기도 꿈의 세계야?',
			'새 희망의 가면... 별로 가지고 싶진 않네.',
			'모두의 뜨거운 감정과 싸운 뒤, 많은 것을 배웠어.',
			'야작식당... 인기를 모으는데 아주 적합한 장소야.',
		],
		description: [
			'66개의 가면으로 이루어진 츠쿠모가미. 평소에는 별로 웃지 않는 모습이지만, 가끔 눈을 마주치면 시선을 피해. 처음에는 성격이 차가운 것처럼 느껴졌지만, 사실 알고보니 가면으로 가리는 것에 익숙해져 감정을 이해하질 못하는 거래. 어찌 보면 아기처럼 순수한 것 같다 생각할 수도 있는데, 사실 막 태어난 요괴나 다름 없어서 똑같긴 해! 지금은 감정을 이해하기 위해 열심히 수련 중이라고 해. 언젠가 그녀 스스로가 자기만의 미소를 찾을 수 있으면 좋겠네!',
			null,
			null,
		],
		evaluation: {
			bad: "별로야... 이건 '실망'의 감정이네.",
			exbad: "정말 맛없어... 이건 '분개'의 감정이네.",
			exgood: "정말 완벽해! 이건 '아주 만족'했다는 감정이야.",
			good: "맛있어.이건 '환희'의 감정이야.",
			lackmoneyangry: "돈을 뜯겼어! 이건 '원망'의 감정이야.",
			lackmoneynormal: "돈이 다 떨어졌어... 이건 '창피'의 감정이야.",
			norm: "적당하네. 이건 '평온'의 감정이야.",
			repell: "쫓겨나다니... 이건 '말이 안 나오는' 감정이네.",
			seenRepell: "손님한테 이렇게 대한다고? 이건 '황당'의 감정이네.",
		},
		name: '하타노 코코로',
		spellCards: {
			negative: [
				{
					description:
						'하타노 코코로의 암흑 노가쿠가 모든 손님의 감정에 영향을 끼칩니다. 얻는 팁이 0으로 감소합니다. 66초간 지속됩니다.',
					name: '상심 「칠정육욕 해방」',
				},
			],
			positive: [
				{
					description:
						'필드에 감정 가면이 없을 시 당일에 대응하는 가면을 소환합니다. 30초간 지속됩니다. 필드에 감정 가면이 이미 있는 경우 30초간 효과를 강화합니다.',
					name: '화심 「희로애락 변환」',
				},
			],
		},
	},
	1000: {
		chat: [
			'똑똑한 사업가만이 모든 정보를 활용할 수 있지.',
			'계획을 잘 짜두지 않으면, 결국 실패에 직면하게 될 거야.',
			'배는 항구에서 안전하지만, 우리가 배를 만드는 이유는 그게 아냐.',
			'잠재적인 고객들은 너한텐 관심이 없어. 관심은 자신에게만 있고 자신과 관련이 없는 것은 읽거나 듣고 싶어하지 않지.',
			'우리 자본가에게는 단 하나의 규칙이 있지. 높은 임금과 낮은 생산 비용이 최고의 제품과 최대의 이윤을 보장한다는 것.',
			'캇파들한테 식재료좀 찾아달라고 말해야 하나...',
		],
		description: [
			'캇파가 모두 용병이라면, 중간 보스로서 니토리는 그 중 최고야! 이윤을 추구하는 사업가들에게 죄책감은 없지만, 조금만 더 친절하면 좋지 않을까?',
			'니토리씨는 특히 사업과 기술에관해서는 정말 똑똑해! 캇파는수익 지향적이라고 생각했었는데,위험한 기술을 발전시키기 위해기꺼이 모든 돈을 투자하는 것같아. 이해할 수 없어...',
			'모든 위기를 기회로 바꾸는 능력은정말 놀랄 수 밖에 없어. 이 기술을배울 수 있을까?',
		],
		evaluation: {
			bad: '무의미하고 불필요한 첨가물은 가치를 하락시킬 뿐이지.',
			exbad: '어떻게 이게 환상향에서 가장 인기있는 가게인거야? 이거 거짓 광고야!',
			exgood: '내가 지불한 것보다 더 많은 걸 받아버렸는데... 뭔가 보답이라도 해줘야겠네!',
			good: '산에서 가게를 열 수 있도록 해준 건 올바른 선택이었어!',
			lackmoneyangry: '이렇게나 비싸다고!? 이건 절도야!',
			lackmoneynormal:
				'최근에 돈을 좀 벌긴 했지만... 이만한 여유는 없는데...',
			norm: '음식 가공은 생각보다 힘들다고. 아직 갈 길이 머네.',
			repell: '고객에게 이런 대접을 하다간 오래가지 못할걸.',
			seenRepell: '장사하는 법을 아직도 모르고 있네.',
		},
		name: '카와시로 니토리',
		spellCards: {
			negative: [
				{
					description:
						'홍수를 일으켜 식사중인 무작위 손님 3~5명을 내쫓습니다.',
					name: '수부 「캇파의 플래시플러드」',
				},
			],
			positive: [
				{
					description:
						'다음 120초 동안 동료들이 캇파의 기술인 "늘어나는 팔"을 사용하여 원격으로 음식과 음료를 제공하게 합니다.',
					name: '캇파 「늘어나는 팔」',
				},
			],
		},
	},
	1001: {
		chat: [
			'제 장기 상대는 오늘 꽤나 잘했었습니다. 그게 장기가 재미있는 이유죠!',
			'아무리 침입자가 적더라도, 적어도 한 명 쯤은 경계를 게을리 해서는 안 되죠.',
			'캇파는 천재라고들 하지만... 제게 검술과 장기로 모두 패배했었죠.',
			'조직이 방대해질수록 규칙도 더 많이 필요한 법입니다.',
			'그 카라스텐구가 도대체 무슨 일을 꾸미고 있는지 참...',
		],
		description: [
			'후각과 청각이 매우 예민한, 요괴의 산을 순찰하는 백랑 텐구야. 천리 밖에 있는 걸 볼 수도 있고, 침입자도 즉시 발견할 수 있대! 요괴의 산엔 이런 경비가 아주 많으니까, 우리같이 약한 요괴는 들어가기도 무섭다구…',
			'사실 요괴의 산은 침입자가 별로 없어서 경비가 할 일이 없대. 가게를 차리고 나니까, 퇴근 후 들릴만한 곳이 생겨서 좋아하는 것 같아. 표정은 진지해도, 살랑대는 꼬리를 보면 마음이 훤히 보이지.',
			'처음엔 엄격해 보였지만, 친해지고 나니 가끔 일에 대해 불평하는 등 귀여운 모습을 보이기도 해. 내 생각보다 다루기 쉬운 것 같기도 하고… 진작 알았더라면 요괴의 산을 더 일찍 왔을텐데!',
		],
		evaluation: {
			bad: '음료만 주문했었어야 했는데...',
			exbad: '이런 걸로 노동자의 지갑을 쥐어짜는겁니까!?',
			exgood: '역시 환상향 중 최고! 기대한 것 이상이군요! 감사합니다!',
			good: '맛있는 음식은 피로를 풀기에 딱이죠!',
			lackmoneyangry:
				'이 가격은 요괴의 산의 가격 규제 조약을 위반합니다!',
			lackmoneynormal:
				'경비원들은 생활비를 벌지 못해서 제대로 된 식사조차 할 수 없어요…',
			norm: '충분한 술이 없다면 잘 넘어가지 않을지도...',
			repell: '텐구를 얕잡아보시는 건가요?',
			seenRepell: '그런 행동은 산을 단결시키지 못 할 것입니다!',
		},
		name: '이누바시리 모미지',
		spellCards: {
			negative: [
				{
					description:
						'다음 30초 동안 가게로 오는 길을 막아 새로운 손님들이 오지 못하게 합니다.',
					name: '「계엄령 선포」',
				},
			],
			positive: [
				{
					description:
						'짧은 시간동안 많은 텐구들이 식사하러 올 것입니다.',
					name: '「일 끝난 뒤의 한 잔」',
				},
			],
		},
	},
	1002: {
		chat: [
			'한번쯤 돌아가는 것도 나쁘진 않을 것 같네...',
			'인형들이 좀 낡은 것 같아. 돌아가서 손 좀 봐야겠어.',
			'내일은 어떤 인형극을 할까...',
			'이렇게 많은 마법사들이 있었을 줄은...',
		],
		description: [
			'금발에 고운 피부를 가진 마법의 숲에사는 마법사. 그녀는 너무 창백해서인형처럼 보여. 그녀의 집에도 인형이 많고 살아 있는 것처럼 생생하다는소문이 있다구! 좀... 소름 끼쳐...',
			'그녀의 인형의 움직임을 본 사람은인형이 살아 있는지 궁금해 할 거야.그녀는 실제로 접근하기 어려워 보일때에도 다른 사람들을 매우 배려하지.이게 소위 말하는 ""도시적 사고방식""을 의미하는 걸까?',
			'앨리스씨랑 가까워지는 건 어려워...예의 바르고 상냥하지만 거리를 두는느낌이야. 인형이 매우 많으니까...외로웠던 걸까?',
		],
		evaluation: {
			bad: '그냥 인형들에게 요리를 시킬 걸 그랬어...',
			exbad: '마법을 써버리면 되는데 나는 왜 고통받고 있는 거지!?',
			exgood: '이런 사랑스러운 맛은 동화에서만 가능한 줄 알았는데!',
			good: '인간의 식생활을 늘 지켜온 건 바로 이런 음식 때문이지~',
			lackmoneyangry: '이게 새로운 계획이야? 이런 사기가!?',
			lackmoneynormal: '이런... 예산 관리를 잘못했나보네...',
			norm: '그럭저럭.',
			repell: '...들를 생각도 없었어.',
			seenRepell:
				'분위기가 형편 없으면 요리 맛도 덩달아 형편없어지기 마련이지.',
		},
		name: '앨리스 마가트로이드',
		spellCards: {
			negative: [
				{
					description:
						'앨리스가 마법의 유리병을 부엌에 던져 무작위 주방용품을 고장냅니다. 수리하는 데 60초가 걸립니다.',
					name: '마부 「아트풀 새크리파이스」',
				},
			],
			positive: [
				{
					description:
						'앨리스가 인형을 손님으로 보이게 만듭니다. 남은 모든 좌석을 보충합니다.',
					name: '「인형을 가지고 노는 아이」',
				},
			],
		},
	},
	1003: {
		chat: [
			'세상을 우습게 보면... 고생하게 될 거야.',
			'피연못지옥의 석유는 맛있다니까~',
			'내 좌우명은 "어부지리"라고.',
			'강욕동맹의 조직원들은 멋대로 행동하는 녀석들이 많아.',
			'이 참새를 먹으면... 나도 맛있는 요리를 할 수 있을 것 같은 기분이 든단 말이지...',
		],
		description: [
			'축생계의 무슨 동맹? 의 지도자. 그 전설적인 식욕은 정말 모든걸먹어치워버리지! 그리고 성격은뭘 먹느냐에 따라 달라지는 것 같아. 어떤 음식을 찾고 있는 것 같은데... 가끔 손님으로도 방문할것도 같고... 어떻게 봐도 그냥 어린애처럼 보여. 하지만 그렇다고 그녀를 과소평가하는 바보가 나타나지 않았으면 좋겠어...',
			null,
			null,
		],
		evaluation: {
			bad: '이딴 쓰레기를 먹으려고 지상에 올라온 게 아냐!',
			exbad: '그래!? 피연못지옥의 온갖 부정적인 감정들을 느껴보고 싶다 이거지!?',
			exgood: '이 음식은 미뢰들을 말 그대로 터뜨리고 있잖아! 내 무한한 배로 들어가기엔 충분한 가치가 있어!',
			good: '언제나 지상은 후진 곳이라고 생각했는데... 그렇진 않았네.',
			lackmoneyangry:
				'나한테 사기를 치고 싶은거야!? 그럼 뭘 할 수 있는지 스스로에게 먼저 물어보라고!',
			lackmoneynormal:
				'어이가 없을 정도로 야만적이야! 축생계랑 똑같잖아!',
			norm: '맛은 뭐... 검은 물이랑 비슷한 정도네.',
			repell: '정말로 내가 널 먹지 않을 거라고 생각하냐!?',
			seenRepell: '지상도 축생계랑 다를 게 없네. 실망이야.',
		},
		name: '토테츠 유마',
		spellCards: {
			negative: [
				{
					description:
						'분노한 유마가 3~5개의 무작위 재료, 1~3개의 음료 및 1개의 주방용품을 먹어치워 밤새 사용할 수 없게 만듭니다. 피연못지옥 도전에서는 유마가 추가로 5%의 HP를 회복합니다.',
					name: '「강욕스런 짐승신 도철의 저녁 식사」',
				},
			],
			positive: [
				{
					description:
						'다음 30초 동안 유마를 제외한 다른 모든 손님은 가장 비싼 음식과 음료만 주문합니다. 이 주문은 예산을 무시합니다.',
					name: '「토테츠의 도철의 연회」',
				},
			],
		},
	},
	1004: {
		chat: [
			'속세의 연기와 화기는 심신을 안정시키기에 충분하지.',
			'만복은 사람을 만족시킬 수 있지.',
			'모든 맛들은 취향이 있고 모든 취향들은 존중받아야 해.',
			'아무리 위대한 사람이라도 하루 일과가 끝나면 식사를 해야만 하는 법이야.',
			'본래 동서가 없나니, 어느 곳에 남북이 있으리오?',
		],
		description: [
			'마법의 숲에 있던 석조 지조상.하지만 마법의 숲의 마력으로 인해살아 움직이게 되었어. 만약 숲이그정도로 마력이 흘러 넘친다면,마법사들이 왜 그렇게 많이 있는지알 것 같아.',
			'지장보살은 더 조용하고 위엄이 있지않을까 하고 생각했었는데... 처음만났을 땐 그냥 그런 척 하던 거였어.단지 몇 번 대화한 것 뿐인데 그녀는내게 마음을 완전히 열었지. 순진한아가씨야~',
			'드디어 생명이라는 선물을 받았지만 방구석!? 정말 아까워! 그녀가 세상의 모든 부분을 볼 동기를 부여하기 위해뭔가 해야겠어!',
		],
		evaluation: {
			bad: '설마 요리할 때 기름을 재활용한 건 아니지?',
			exbad: '나쁜 사람들은 끔찍한 요리와 같아. 그 모습만으로도 마음을 아프게 하지.',
			exgood: '완전 좋아! 욕망과 번뇌를 버리는것 보단 역시 배부르게 먹는 게 더 좋다니까~',
			good: '이건 밖에 나갈만한 가치가 있어!',
			lackmoneyangry:
				'지장보살한테 이런 거금을 요구한다고? 그럼 그냥 공물로 쳐 줄게!',
			lackmoneynormal: '외상으로 해 줘. 나중에 갚을 테니까.',
			norm: '이 요리는 단지 영양분을 섭취하기 위해서 만들어진 요리네.',
			repell: '여기 자선으로 온 게 아냐! 돈 있다니까!',
			seenRepell: '모든 사람은 자연의 섭리 아래에선 평등해야 해!',
		},
		name: '야타데라 나루미',
		spellCards: {
			negative: [
				{
					description:
						'나루미가 업화의 화염을 소환하여 무작위 버프 3개를 즉시 종료시킵니다.',
					name: '지장 「업화구제」',
				},
			],
			positive: [
				{
					description:
						'다음 60초동안 손님이 퇴장할 때, 팁을 50%만큼 더 지불하게 합니다.',
					name: '마부 「즉석 보리」',
				},
			],
		},
	},
	1005: {
		chat: [
			'캇파들이 평소보다 더 들떠있는 것 같지 않나요?',
			'이젠 환상향의 모든 사람들이 절 기억해주겠죠?',
			'우리 모리야의 이름을 널리 세계에!',
			'그 신님들은 흥미진진한 사건을 좋아하지만, 개인적으로 관여하기는 원하지 않아요.',
			'이렇게 밤늦게 먹으면 살찔텐데... 에이, 오늘은 많이 걸었으니까 괜찮겠지!',
		],
		description: [
			'몇 년 전 모리야 신사와 함께 나타난 무녀. 분명히 그녀의 두 신과 함께 바깥 세계에서 왔어... 그리고 그 호수. 얼마나 기묘한지 참... 아직도 무서워.',
			'집에서 차를 마시는 걸 좋아하는레이무씨와는 달리 사나에씨는 아주성실하고 어디에서나 신앙을 모으는모습이 보이곤 해. 인간의 몸으로신앙을 모으러 다닌다니, 정말 놀라워!게다가 사나에씨는 현인신이라는 소문이 있던데...',
			'하쿠레이 신사는 환상향에서 특별한지위를 가지고 있기 때문에 모리야신사와 사나에씨가 그들을 능가하는 건 매우 어려운 일이야. 하지만 사나에씨의 많은 노력 덕분에, 많은 사람들이 모리야의 무녀에 대해 들어봤다고 해. 잘 됐지!',
		],
		evaluation: {
			bad: '이런 음식으로는 사람들의 마음을 한데 모을 수 없어요.',
			exbad: '제 신자들에게 이런 대접을 한다면 저에 대한 신앙을 모두 잃어버리고 말겠죠!',
			exgood: '레이무 말고 제 신자가 돼주시면 안되나요!?',
			good: '맛있는 음식으로도 신앙을 모으기 충분하겠군요!',
			lackmoneyangry: '이건 상식에 어긋날 정도로 비싸잖아요!',
			lackmoneynormal:
				'환상향에서의 생활비는 바깥 세계보다 훨씬 비싼데...',
			norm: '이런 음식으로 신앙을 모으고자 한다면, 요리 기술을 더 갈고닦을 필요가 있겠네요.',
			repell: '네? 어, 지, 진짜로요!?',
			seenRepell:
				'사람들에게 이런 식으로 대하면 신앙을 모을 순 없을 거에요.',
		},
		name: '코치야 사나에',
		spellCards: {
			negative: [
				{
					description:
						'사나에가 오망성을 방출하여 다음 30초 동안 모든 버프 획득을 차단하는 봉인 상태가 됩니다.',
					name: '기적 「대낮의 객성」',
				},
			],
			positive: [
				{
					description:
						'기적의 힘을 발현시켜, 무작위 3개의 주류와 3개의 재료를 획득합니다.',
					name: '신덕 「오곡풍양 라이스샤워」',
				},
			],
		},
	},
	2000: {
		chat: [
			'지상에선 지저를 안좋게 보지만, 우리에겐 천국이라구.',
			'동굴은 어두웠지만... 내 그물은 밝았어.',
			'요즘 거리가 시끌벅적하네, 가끔 놀러가야겠어~',
			'가장 어두운 칠흑을 견뎌야 가장 밝은 빛을 얻을 수 있는 법이야.',
		],
		description: [
			'어둠의 풍혈에서 만날 수 있는 친절한 길잡이. 미움받는다는 걸 스스로도 알고 있어서 마을에는 잘 가지 않아. 이렇게 귀엽고 깜찍한데... 지상의 사람들도 만나봤으면 좋겠어!',
			'야마메는 역시 아이돌 같은 존재였구나! 하지만 그 성격과는 취미가 남달랐던 것 같은데...',
			'계속 오해를 받고 미움받는 자가 되었지만 야마메는 대수롭지 않게 여기고 있어. 나는 그녀가 확실히 이 지저를 사랑하고 있다는 걸 느낄 수 있었어. 그런 심경을 가질 수 있다니, 대단해.',
		],
		evaluation: {
			bad: '나쁜 뜻은 아니긴 한데, 좀 별로야...',
			exbad: '차라리 거미줄에 걸린 걸 먹겠어.',
			exgood: '이런 동굴에서 맛있는 음식을 먹을 수 있다니, 너무 좋아!',
			good: '분위기도 음식도 만점이야~',
			lackmoneyangry:
				'이 가게는 과부거미보다도 어두운 흑심을 가지고 있잖아!',
			lackmoneynormal: '아직 지상의 물가는 익숙치 않은데...',
			norm: '그 전설의 야작식당이 이 정도는 아닐 텐데...',
			repell: '아무것도 안 했는데 미움을 받아야 해?',
			seenRepell:
				'미움받는 사람들을 그렇게 여겨서야, 이곳에 가게같은 건 내지도 마.',
		},
		name: '쿠로다니 야마메',
		spellCards: {
			negative: [
				{
					description:
						'야마메의 거미줄에 붙잡혔다! 30초동안 이동 속도가 80% 감소합니다.',
					name: '세강 「칸다타 로프」',
				},
			],
			positive: [
				{
					description:
						'앞으로 30초 동안 줄을 서는 손님들은 아이돌에게 이끌려 영업이 끝나도 떠나지 않습니다.',
					name: '「지하 아이돌 뒷풀이 시간」',
				},
			],
		},
	},
	2001: {
		chat: [
			'그대는 다리 위에서 풍경을 바라보고, 풍경을 보는 사람은 건물 위에서 그대를 바라본다.',
			'여기 있는 모두가 행복해 보이네. 질투나.',
			'다리는 연결로 뿐만 아니라 현계와 저승을 가는 길을 의미하지.',
			'옆집 음식이 어찌나 맛있어보이던지, 정말 샘나ㅡㅡ',
			'Line',
		],
		description: [
			'친절하고 밝은 요괴인 줄 알았는데 돌아서자마자 내 뒷담을 하는 걸 봐버렸어... 질투를 먹고사는 요괴가 스스로 질투를 해야만 하는 걸까? 왠지 안쓰러워... 그래도 그녀는 그렇게 느끼진 않는 것 같아.',
			'하시히메는 다리의 요괴이자 수호신이지. 파르시씨는 사실 매일매일 사람이 무사히 지상과 지저를 왕래하는 걸 지켜보면서...... 그렇다면 그녀도 대단한 요괴야.',
			'파르시씨는 모든 사람의 장점을 잘 알고 있다는 걸 알았어! 질투심이 많다고 하지만 마음속 깊은 곳에선 다른 사람들을 동경하고 있는거겠지? 그녀를 알아갈 수 있어서 너무 좋아!',
		],
		evaluation: {
			bad: '내 옆 테이블의 음식이 더 맛있어보이잖아!',
			exbad: '이런 실력으로 어떻게 가게를 차린거야?',
			exgood: '질투도 뭣도 잊어버릴 만큼 맛있어!',
			good: '이렇게 치유되는 맛이라니, 질투가 나잖아ㅡㅡ',
			lackmoneyangry: '이런 악독한 가게는 못을 박아버리겠어!',
			lackmoneynormal: '다른 사람들의 주머니는 이렇게나 부유하단 말야?',
			norm: '왠지 다른 사람의 음식이 더 맛있어보이는데...',
			repell: '나를 쫓아냈으면서 다른 손님들은 쫓아내지 않다니, 질투가 나잖아!',
			seenRepell:
				'다른 손님은 쫓아냈으면서 나는 쫓아내지 않다니, 질투가 나잖아!',
		},
		name: '미즈하시 파르시',
		spellCards: {
			negative: [
				{
					description:
						'스펠 카드가 활성화되면, 동료가 당신을 질투해 정산 때 일당을 두배로 청구할 것입니다.',
					name: '한부 「축시의 참배」',
				},
			],
			positive: [
				{
					description:
						'파르시가 손님들의 질투심을 부추겨 모든 손님들의 예산을 현재 가게에 있는 가장 부유한 손님과 동일한 수준으로 끌어올립니다.',
					name: '「질투와 가불」',
				},
			],
		},
	},
	2002: {
		chat: [
			'하나 둘 땅으로 파고들다니, 정말 지저가 재미있는걸까?',
			'술은 여럿이서 마실 수록 더 맛있는 법이지.',
			'잔은 필요 없어. 난 가지고 다니거든.',
			'떠들썩하네, 허나 내 목청을 이길 자가 있을까?',
		],
		description: [
			'오래전부터 환상향을 떠났던 사천왕같아 보이는 오니는 강단있고 깔끔한 성격이야. 지금은 옛 지옥의 거리에 있는 온천을 관리하고 있대. 가끔 들리자!',
			'정말로 사천왕 중 한 사람이었어. 그 괴력은 비슷한 오니들조차 대적할 수 없다고 해. 나도 이런 요괴를 만나게 될 줄이야... 역시 떨리네.',
			'오니는 인간에게 흥미를 잃은 줄 알았는데... 유기씨는 사실 지상을 자유롭게 오가는 동료들의 모습을 남몰래 부러워했던것 같아. 지상에 관심이 있다면 가면 되잖아! 오니가 그렇게 우물쭈물 해도 되는 거야?',
		],
		evaluation: {
			bad: '이건 내 술과는 안 어울리는 것 같은데.',
			exbad: '이딴 요리는 내 술을 버릴 뿐이야!',
			exgood: '좋은 말과 좋은 안장, 좋은 술과 좋은 안주!',
			good: '온천에 몸을 담그고 나서 배부르게 먹는건 치유하기에 딱 좋지.',
			lackmoneyangry: '오니를 잡을만한 용기를 가진 가게는 처음 보는걸.',
			lackmoneynormal: '지갑에 구멍이 뚫려버렸는걸ㅡㅡ',
			norm: '좋은 술이 있으니, 안줏거리는 뭐가 되었든 상관 없지.',
			repell: '대단한 용기인데!',
			seenRepell: '재미없군.',
		},
		name: '호시구마 유기',
		spellCards: {
			negative: [
				{
					description:
						'유기가 3중 경계선을 생성하여 움직임을 제한시킵니다. 60초동안 지속됩니다. 삼보필살ㆍ제1중 : 안전범위. 삼보필살ㆍ제2중ㆍ죄인의 족쇄 : 범위 내에선 이동 속도가 50% 감소합니다. 삼보필살ㆍ제3중ㆍ괴력난신 : 이 범위에 들어가면 즉시 30초 동안 기절합니다.',
					name: '사천왕오의 「삼보필살」',
				},
			],
			positive: [
				{
					description:
						'호시구마하이로 일정량의 음료 등급을 한 단계 높입니다. 레벨 1 음료 3잔을 100% 확률로 업그레이드합니다. 레벨 2 음료 2잔을 75% 확률로 업그레이드합니다. 레벨 3 음료 1잔을 50% 확률로 업그레이드합니다.',
					name: '「연주도 춤도 척척」',
				},
			],
		},
	},
	2003: {
		chat: [
			'거리가 멀면 잘 안 읽히는데...',
			'얼른 먹고 다시 일하러 가야 해.',
			'이렇게라도 시간을 내서 휴식을 좀 해야지...',
			'음식은 미각 뿐 아니라 정신적으로도 즐길 수 있지.',
		],
		description: [
			'전설에 나오는 마음을 읽는 사토리 요괴. 이름도 사토리야. 아마 자신의 종족이나 능력에 대한 자부심 같은게 있는걸까? 매일밤 쉬지도 않고 일을 하다 보니 말을 걸 기회가 별로 없었어...',
			'사토리씨는 내가 본 사람들 중에 제일 많이 고생하는 사람 같아. 애완동물들이 잡일은 도와주지만 행정적인 일은 그녀만이 할 수 있으니. 일을 위해 취미를 많이 포기한 것 같은데, 독심만은 포기할 수 없나봐. 그정도로 피곤하면 정말 안 좋은데...',
			'애완동물들이 어째서 그렇게 사토리씨를 좋아하는지 알겠어. 힘든 일에 짓눌려도 동생과 애완동물들이 있으니, 싸늘한 외모에 담긴 부드러움은 잊지 못할 것 같아.',
		],
		evaluation: {
			bad: '모처럼 왔는데 좀 실망스럽네.',
			exbad: '이건 일하면서 쌓인 스트레스보다 더 심하잖아...',
			exgood: '양, 색, 향, 맛 모두 갖추었네.',
			good: '오린의 안목은 원래 좋았어.',
			lackmoneyangry: '나에겐 원가가 얼마인지 다 보이는데 말이지.',
			lackmoneynormal: '미안, 용돈 좀 나눠준 지 얼마 안 돼서...',
			norm: '그래도 쓰러지는건 피해야 하니까.',
			repell: '요리를 좀 해준다고 하지 않았나?',
			seenRepell: '사람에게 대하는 예의는 자신의 초상을 비추는 거울이야.',
		},
		name: '코메이지 사토리',
		spellCards: {
			negative: [
				{
					description:
						'해금된 무작위 처벌 카드 중 한개를 발동합니다.',
					name: '상기 「불행하던 시절」',
				},
			],
			positive: [
				{
					description:
						'해금된 무작위 스펠 카드 중 한개를 발동합니다.',
					name: '상기 「행복했던 시절」',
				},
			],
		},
	},
	2004: {
		chat: [
			'오쿠는 핵융합로를 항상 지켜본단 말이지.',
			'오늘은 원령들이 좀 많네.',
			'다음엔 사토리님이랑 같이 와야겠다.',
			'사토리님은 잘 계시려나...',
		],
		description: [
			'카샤라고 불리는 고양이 요괴는 지령전 주인의 오른팔이야. 죽은 사람이나 원령과 대화할 수 있어서 편리할 것 같아! 그런데... 카샤는 시체를 가져가는거지? 그래서 미움받는걸까? 으음... 남에 취미에 대해서 이렇게 말하는 건 좋지 않은 것 같지만...',
			'생각해보면 인간은 죽었을때 막막하지 않을까? 돌연사를 앞두고 명랑하고 입담 좋은 오린을 만난다면 죽음에 대한 두려움을 조금은 알 수 있을 거야.',
			'편견 속에 사는 불길한 검은 고양이, 그런 일을 겪어야 했다니. 편견은 정말 좋지 않아. 다행히도 오린은 사토리씨를 만났어. 좋은 주인은 애완동물의 인생을 바꿀 수 있지. 오린은 앞으로도 걱정없이 시체를 훔쳐가는 삶을 살았으면 좋겠네~',
		],
		evaluation: {
			bad: '내 눈이 삐었나... 이게 대체...',
			exbad: '차라리 썩은 고기를 먹겠다! 퉤!',
			exgood: '거식증이라도 허겁지겁 먹어치워버릴 만한 맛이야!',
			good: '이런 좋은 음식은 금세 먹어버린다고!',
			lackmoneyangry:
				'네가 강매하는데, 공짜로 먹는 것 쯤은 아무것도 아니겠지!?',
			lackmoneynormal: '요즘 사정이 좀 빠듯한데...',
			norm: '이 정도로 사토리님의 식욕을 돋울 수 있는 걸까...',
			repell: '어떻게 이럴 수 있어!?',
			seenRepell: '교만과 자만은 손해를 초래할 뿐이지.',
		},
		name: '카엔뵤 린',
		spellCards: {
			negative: [
				{
					description:
						'오린이 떠날 때 자리에 원령을 남깁니다. 원령은 계속 주문하지만, 쫓아낼 수 없고 지불도 하지 않습니다. 정상적인 절차로 만족시켜야 사라집니다.',
					name: '「사회부연」',
				},
			],
			positive: [
				{
					description:
						'앞으로 30초 동안 "도수 중간" 태그가 붙은 음료를 판매하는 것이 가장 높은 평가를 받을 것입니다.',
					name: '묘부 「캣츠 워크」',
				},
			],
		},
	},
	2005: {
		chat: [
			'맛있는 음식을 기다리는 시간은 즐겁지~',
			'맛있는 음식을 먹는 건 가장 즐겁지~',
			'비가 내리기 시작하니, 밥도 나오기 시작했다.',
			'머릿속에 안 담기는 건 뱃속에 담으면 돼!',
		],
		description: [
			'작열지옥터를 지키는 까마귀는 불꽃처럼 뜨겁고 상쾌한 성격이야. 겉보기엔 다른 지옥까마귀랑 비슷한데 유독 바보같다는 점이 친근하게 느껴졌어.',
			'오쿠의 외모가 빛을 발한 건 알고 보니 그녀의 몸 안에 신령이 깃들었기 때문이야. 지옥의 어둠에서 태어난 까마귀가 태양에 서식하는 야타라가스와 묘한 조화를 이룬다니... 그녀에게 이렇게 강한 힘을 주어도 괜찮은걸까?',
			'요즘 문득 오쿠만큼 강한 사람이 없다는 생각이 들어. 아주 강한 힘을 가졌는데도 그 힘을 쓸 머리가 없었던 게 다행이었지? 바보같은 오쿠는 역시 귀여워! 하지만 나도 바보같다는 말을 자주 듣지~',
		],
		evaluation: {
			bad: '열기가 너무 약하잖아.',
			exbad: '차라리 내가 요리하는게 더 낫겠다.',
			exgood: '지옥보다 더 뜨거운 열기야!',
			good: '이 밥은 열기가 충분해!',
			lackmoneyangry:
				'돈 챙기는 걸 잊은 척 해야겠다... 어쨌든 난 새대가리니까.',
			lackmoneynormal: '새대가리엔 이렇게 많은 숫자는 안 들어간다고...',
			norm: '고맙다고, 사장님~',
			repell: '확 구워버린다!',
			seenRepell: '왜 사람을 쫓아내는거야..?',
		},
		name: '레이우지 우츠호',
		spellCards: {
			negative: [
				{
					description:
						'다음 번 요스즈메의 노래의 완벽한 성공을 하지 못하면 해당 주방기구는 완전히 연소돼 그날 밤 사용할 수 없게 됩니다. 줄을 선 일부 손님들은 놀라 도망칠 수 있습니다.',
					name: '옥광 「디퓨즈 헬파이어」',
				},
			],
			positive: [
				{
					description:
						'앞으로 60초 동안 냄비와 찜기가 과부하돼 요리가 순식간에 완성됩니다.',
					name: '「헬스 토카막」',
				},
			],
		},
	},
	2006: {
		chat: [
			'살찌지 않으니, 아무리 먹어도 괜찮아~',
			'배만 채우면 허전하지 않아!',
			'이상한 생각은 정말 멋져ㅡㅡ앗, 잠깐! 그건 나잖아!',
			'어라, 뭘 기다리고 있는 거야?',
		],
		description: [
			'지령전 주인의 여동생. 제 3의 눈을 닫아버린 탓에 존재감도 옅어졌고, 신비로운 모습은 지저에서 많은 신자를 얻게 했지. 늘 환하게 웃지만 속마음은 그녀 자신조차도 몰라.',
			null,
			null,
		],
		evaluation: {
			bad: '속이 텅 비었는데도 별로 먹고 싶지 않네.',
			exbad: '참새를 집에 장식으로 달면 예쁠 것 같은데~',
			exgood: '이 멋진 사장님을 장식해두면 정말 굉장할 거야!',
			good: '언니가 그랬는데, 배가 빵빵하면 배부른거래!',
			lackmoneyangry: '밥을 먹는데 왜 돈을 내야 하는 거야?',
			lackmoneynormal: '금방 돈 가져올게~',
			norm: '잘먹겠습니다ㅡㅡ',
			repell: '왜그래? 내가 보이지 않는 거야?',
			seenRepell: '시끌벅적한게 더 좋다구!',
		},
		name: '코메이지 코이시',
		spellCards: {
			negative: [
				{
					description:
						'앞으로 60초 동안 일반 손님들의 주문은 모두 블라인드로 가려져 도감에서 찾아 유추해야 합니다.',
					name: '「자의식의 극의」',
				},
			],
			positive: [
				{
					description:
						'앞으로 60초 동안 주문, 식사, 동료 등 쿨타임이 필요한 모든 동작이 무의식에 의해 이론적인 속도의 한계에 도달합니다.',
					name: '「무의식의 극의」',
				},
			],
		},
	},
	3000: {
		chat: [
			'나 또 왔어! 깜짝 놀랐어?',
			'이 곳이 점점 더 활기가 넘치고 있어! 신난다——!',
			'누구를 놀래켜 볼까...... 그래! 저 사람으로 해야겠다!',
			'오늘도 깜짝 놀라는 사람은 없네......',
		],
		description: [
			'아무도 사용하지 않고 방치되었던 우산에 깃든 츠쿠모가미. 누군가를 놀래키면서 좋아하는 요괴야.',
			'성격이 좀 이상한 것 같아. 명랑하고 친근한 요괴인 줄 알았는데, 가끔 울기도 하고... 어떻게 대해야 할 지 모르겠어! 그래도 다행인 건 금방 기운을 차린다는 거야.',
			'가끔 비관적이기도 하지만 마음은 다정하고 단호한 요괴야. 항상 실패하지만 최선을 다하지. 나도 이 에너지를 가질 수 있기를!',
		],
		evaluation: {
			bad: '조금도 놀랍지 않아.',
			exbad: '너무 맛없어서 깜짝 놀랐어.',
			exgood: '꺄——! 깜짝 놀랄 정도로 맛있어!',
			good: '너무 맛있어서 깜짝 놀랐어!',
			lackmoneyangry: '난 돈이 없어! 놀랐지——!?',
			lackmoneynormal: '이 돈은 모두 아이들이 나한테 준 거란 말야......',
			norm: '나쁘진 않지만, 약간의 놀라움이 부족하네.',
			repell: '흑...... 난 정말 쓸모없어......',
			seenRepell: '난 미움받는 기분은 이해할 수 있어.',
		},
		name: '타타라 코가사',
		spellCards: {
			negative: [
				{
					description:
						'작은 우산 요괴가 커져 대기열에 나타납니다. 줄에 서 있는 일반 손님들은 모두 놀라 도망가게 됩니다.',
					name: '「초극대환영우산」',
				},
			],
			positive: [
				{
					description:
						'다음 30초 동안 "이상함" 태그가 달린 음식 제작 시간이 30% 감소하고, 재주문율이 30% 올라갑니다.',
					name: '우부 「비오는 밤의 괴담」',
				},
			],
		},
	},
	3001: {
		chat: [
			'그 불운한 사신은 자신의 배가 샌다는 걸 눈치챘을까?',
			'낮에는 다들 자제하고 있으니까, 밤에 한바탕 소란을 피우는 것 정돈 괜찮겠지?',
			'매일 술에 취하는 삶이 정말 부럽다——',
			'배가 불러도 그 녀석을 마계로 보내줘야 하는데......',
		],
		description: [
			'사람을 익사시키는 요괴가 성련선의 선장이 되다니, 이해할 수가 없어. 이 요괴는 어떤 방식으로든 수난사고를 일으킬 수 있으니까, 주방에선 특히 조심해야 해!',
			'불교에 입문한 지 수천년이 지났는데도 불교에 대한 제자 의식이 전혀 없어. 주인 몰래 장난치고 다니기만 한다고. 그래도 명련사에 해가 되는 일은 결코 하지 않는 것 같아.',
			'자유로운 성격을 가진 이 선장님은 거리낌없이 불교의 신자가 되어서, 통제를 받으며(통제를 할 순 없지만) 수천 년 전의 은혜에 보답하기 위해 수천 년을 지새웠다고 해. 역시 사람은 겉만 보고 판단해서는 안 되나봐. 무라사 씨는 연과 의를 중요시 하는, 금 같은 분인 거 같아.',
		],
		evaluation: {
			bad: '기내식이랑 비슷한 수준이네.',
			exbad: '기내식보다 더 못하잖아!',
			exgood: '이 요리가 내는 빛은 마치 성련선과 같은 빛이야!',
			good: '나쁘지 않네! 혹시... 성련선에서 일할 생각 없어?',
			lackmoneyangry: '값이 너무 나가서 내 배에는 실을 수 없을 것 같네.',
			lackmoneynormal: '육지의 생활비는 바다보다 훨씬 비싸네...',
			norm: '난 입맛이 까다로운 편은 아니라고.',
			repell: '널 배 밖으로 던져버릴거야!',
			seenRepell: '안타깝네, 기대하고 왔는데.',
		},
		name: '무라사 미나미츠',
		spellCards: {
			negative: [
				{
					description:
						'발 밑에 소용돌이가 생겨 5초 동안 기절하게 됩니다. 이동 스틱을 움직여 더 빨리 회복할 수 있습니다. 이후 20초 동안 이동방향이 반대가 됩니다.',
					name: '익부 「딥 보텍스」',
				},
			],
			positive: [
				{
					description:
						'15초 동안 지속되는 "유령선 빙의" 버프를 얻습니다. 이 버프가 지속되는 동안 얻는 다른 스펠카드의 지속시간이 이 버프의 남은 시간동안 증가합니다.',
					name: '「유령선 지속항해」',
				},
			],
		},
	},
	3002: {
		chat: [
			'괴담 레스토랑 본 적 있어?',
			'요즘 인간들은 근본이 없는 거 같은데.',
			'고독이야말로 진정한 조미료의 역할을 하지.',
			'어렵게 찾은 곳인데, 떠날리가 없잖아.',
		],
		description: [
			'정체를 알 수 없는 고대의 요괴...지만 전설과는 전혀 다른 모습이었어. 명련사의 제자이긴 하지만, 항상 혼자 다니는데... 잘 어울리지 못하는 걸까?',
			'관심을 받으려고 장난을 마구마구 치는 아이같아. 내심 절에 어울리고 싶어도 서툴러 어떻게 해야할 지 잘 모르는 것 같고... 그렇게나 오래 살았으면서 세상을 잘 모르다니.',
			'남을 신경 쓸수록 더 소심해질텐데... 결국 자신의 속마음은 자신의 이미지처럼 알 수 없게 되버리니, 이게 "정체를 알 수 없게 하는 것"의 고충이 아닐까? 하지만 이젠 자신의 마음을 보여주기 시작했으니, 앞으로 많은 사람들이 그 솔직함을 알아갈 수 있을 거야!',
		],
		evaluation: {
			bad: '그저 그러네.',
			exbad: '고작 이거에 내 정체를 드러낼 필요는 없는데.',
			exgood: '이런 맛을 보려고 내 정체를 밝히는 거지!',
			good: '이게 음식의 정체!?',
			lackmoneyangry: '헤이안 시대의 도적들도 이 정도까지는 아니었다고!',
			lackmoneynormal: '헤이안 시대 이후로 모았던 돈이 다 없어졌네...',
			norm: '아직 진짜 맛있는 음식의 정체를 못 밝혔나 보네.',
			repell: '혼자는 익숙하니깐.',
			seenRepell: '시끌시끌한게 좋은데.',
		},
		name: '호쥬 누에',
		spellCards: {
			negative: [
				{
					description:
						'벤토라 턴테이블을 작동시킵니다. 다음 네 가지 꽝에 반드시 당첨됩니다: 홍홍녹: 다음 15초 동안, 어떤 요리를 받든 가장 부정적인 평가를 내립니다.; 쌍녹: 다음 15초 동안, 식재료와 음료의 소비가 3배로 증가합니다.; 쌍청: 다음 15초 동안, 수입이 66% 감소합니다.; 홍홍청: 위의 3가지 버프를 동시에 얻습니다.',
					name: '악부 「동방홍홍청」',
				},
			],
			positive: [
				{
					description:
						'벤토라 턴테이블을 작동시킵니다. 다음 네 가지 중 반드시 하나가 당첨됩니다: 홍홍홍: 다음 15초 동안, 어떤 요리를 받든 반드시 최고 등급의 평가를 내립니다.; 녹녹녹: 다음 15초 동안, 식재료와 음료가 소비되지 않습니다.; 청청청: 다음 15초 동안, 수입이 100% 증가합니다.; 홍녹청: 위의 3가지 버프를 동시에 얻습니다.',
					name: '희부 「동방홍녹청」',
				},
			],
		},
	},
	3003: {
		chat: [
			'평범해 보이는 냄비나 프라이팬에도 인간의 삶이 가득 담겨 있는 법이지.',
			'이 가게에 있는 접시를 깨뜨리면 풍년이 찾아올 것이야.',
			'부엌의 화력은 충분한가? 소인이 좀... 도와줄 수도 있네만.',
			'불을 이용하는 요리사의 삶이라...... 소인에게 어울릴지도 모르겠군.',
		],
		description: [
			'오랜 세월 자신에게 저주를 걸어 잠들어 있던 고대인. 잠을 너무 오래 자서 그런지 사고가 고대에 머물러 있고, 현재와 완전 동떨어져 있어... 지금은 열심히 현대지식을 공부하고는 있지만, 그래서 그런지 이도 저도 아닌 느낌이야.',
			'구시대적인 패션만 빼면, 선인 같은 스타일이기도 하고, 풍수에 대해 잘 아는 것 같아. 풍수라... 다음에 인테리어 할 때 한번 도와달라고 해볼까?',
			'과거에서 계속 못 벗어난다는 건 결국 과거를 그리워한다는 뜻 아닌가? 그래도 후토씨는 시해선을 직접 실험하는게 옳다고 생각하시다니... 인간의 충성심 같은 건 아직 잘 모르겠지만, 그래도 대단하다고 생각해!',
		],
		evaluation: {
			bad: '이건 쓸모없다고 밖에 평가할 수 없겠군.',
			exbad: '불을 다루는게 서툴다면 소인이 전부 태울 수 있도록 도와주겠네!',
			exgood: '이건 마치 나라의 연회와도 같지 않은가!',
			good: '음! 식욕이 끓어오르는군!',
			lackmoneyangry: '이 가격은 국고마저 텅텅 비게 할 수 있겠군.',
			lackmoneynormal: '대중의 눈 앞에서 무전취식을 할 순 없지!',
			norm: '잘 먹었다.',
			repell: '소인의 사전엔 절제란 없으니, 이 가게는 끝장을 맞이할 것이다!',
			seenRepell: '예의를 갖추지 않은 자는, 이토록 이기적인가...',
		},
		name: '모노노베노 후토',
		spellCards: {
			negative: [
				{
					description:
						'다음 30초 동안, 쟁반을 하나만 사용할 수 있게 됩니다. 사용할 수 없게 된 쟁반에 있던 요리나 음료는 사라집니다.',
					name: '「위험한 곡예」',
				},
			],
			positive: [
				{
					description:
						'다음 10초 동안, 손님의 평가에 따라 음료를 받습니다. 보통 평가는 레벨 1 음료. 만족 평가는 레벨 2 음료. 매우 만족 평가는 레벨 3 음료를 받습니다.',
					name: '성동녀 「태양신의 제물」',
				},
			],
		},
	},
	3004: {
		chat: [
			'우리 참새씨에게 불순한 기운이 느껴지네....',
			'제 귀여운 부하들을 돌봐주신거죠~?',
			'사방이, 속세의 화식이네요.',
			'불멸자를 먹고 싶어하는 요괴는 많은데, 불멸자를 위해 요리하는 요괴는 처음보네~',
		],
		description: [
			'신묘 근처에서 그 모습을 자주 볼 수 있어. 수행에 대해 별로 열의가 없나봐... 그래도 다른 사람에게 수행의 장점을 열심히 전하고 있어. 도대체 무슨 생각인건지 모르겠네. 보기에는 정통적인 선인이지만, 하는 행동과 생각은 정말 특이해.',
			'자신이 원하는 걸 하기 위해서라면 뒷감당은 생각하지 않고 해버리고, 다른 사람이 이해하지 못 한다 하더라도 신경쓰지 않아. 욕망에 사로잡힌 건지 그 반대인 건지... 자기 욕구충족의 목적이라기 보단 단순히 성격 때문에 그런 걸지도 몰라.',
			'사선이 무조건 나쁜 선인이라고는 할 수 없어. 생각과 행동이 부적절하다는 이유만으로 천인이 되지 못 한다는게 이해가 안 가... 곽청아씨는 정말 개성적인 분인데! 천인이 되기 위해서 각자의 개성이 사라져야 한다면, 오히려 지금 이 모습을 유지하는 게 더 나을 것 같아.',
		],
		evaluation: {
			bad: '나만 이상한가요?',
			exbad: '광기에 사로잡힌 인간들이나 먹는 걸, 나한테 준 건가요!',
			exgood: '이걸 위해 이렇게 열심히 살아온 거랍니다~',
			good: '맛있으면서도 벽곡을 수행할 수 있으니, 멋있는 음식이네~',
			lackmoneyangry: '저한테 동전소리가 그렇게 많이 날 것 같아요?!',
			lackmoneynormal: '꼬마 참새씨는 손님들 목조르기가 취미인가 보죠?',
			norm: '조금만 더 노력했으면 좋겠네~',
			repell: '잘 생각해야 할텐데...',
			seenRepell: '내가 잘못 본 거니?',
		},
		name: '곽청아',
		spellCards: {
			negative: [
				{
					description:
						'다음 30초 동안, 희귀 손님은 주화입마 상태에 빠지게 되며, 계산할 때마다 평가에 관계없이 30% 확률로 처벌 스펠 카드를 사용합나디. 이미 처벌 스펠 카드를 받고 있더라도, 한 번 더 받습니다.',
					name: '입마 「주화입마」',
				},
			],
			positive: [
				{
					description:
						'다음 30초 동안, 동료들이 손님이나 장애물을 통과할 수 있게 됩니다.',
					name: '선술 「천하무벽」',
				},
			],
		},
	},
	3005: {
		chat: [
			'3끼는 당연한 거고, 4끼는 딱 만족스러워.',
			'미식과 풍물은 세상의 슬픔과 절망을 이겨낼 수 있어.',
			'죽으면 아무것도 걱정할 필요없어.',
			'술만 있으면, 인생 정도야!',
		],
		description: [
			'고대인의 원령. 과거부터 쭉 쌓여온 원한이 있다니, 요괴들이 가장 무서워하는 종류야. 다가가기도 무서워....',
			'토지코씨와 이야기해보니 생각보다 다른 거 같아. 솔직하시면서 아량도 넓으시고, 활기차시네. 진짜 원령처럼 안보여. 원한이 거의 다 사라진 느낌? 이런 토지코씨를 화나게 만들다니, 얼마나 힘든 일이 있었던 걸까?',
			'토지코씨를 화나게 한 범인이 후토씨였다니! 그래도 서로 관계는 좋아보이던데... 토지코씨는 정말 마음이 넓으셔. 어쩌면 부처가 되는 게 아닐까?',
		],
		evaluation: {
			bad: '차라리 내가 만드는 게 더 맛있겠어.',
			exbad: '썩은 쌀로 날 속이려는 거야!?',
			exgood: '이런 음식만 있다면 천 년 동안 외로이 지내는 건 문제 없어!',
			good: '내 원한보다 더 기억에 남는 맛이네.',
			lackmoneyangry:
				'정말 나쁜 가게야! 태자님께서 주신 식비로도 충분하지 않다니!',
			lackmoneynormal: '원한과 돈이 거의 사라졌네...',
			norm: '없는 거보단 낫지.',
			repell: '내가 널 원망할텐데, 그래도 괜찮아?',
			seenRepell: '우리 참새 사장은 속도 좁아라...',
		},
		name: '소가노 토지코',
		spellCards: {
			negative: [
				{
					description:
						'다음 요리에서, 밤참새의 노래가 완벽하지 않을 경우, 천둥을 불러 동료를 30초 동안 기절시킵니다.',
					name: '천부 「천뢰재결」',
				},
			],
			positive: [
				{
					description:
						'전기의 힘으로 다음 30초 동안, 미스티아와 동료의 이동속도를 30% 증가시킵니다.',
					name: '뇌시 「전광석화」',
				},
			],
		},
	},
	3009: {
		chat: [
			'나뭇잎이 얼마나 편한지 자넨 모를게야~',
			'모던함과 전통의 조화가 참으로 내 취향이네.',
			'난 하나도 안 늙었단 말이제——',
			'저 쪽……끌끌, 저런 허접한 변신은 아무도 안 속는단 말이지.',
		],
		description: [
			'요괴 너구리들의 우두머리로, 그에 걸맞는 카리스마와 리더십을 갖췄지. 변신술에 되게 능숙해. 다만 아무리 변신을 잘 해도 너구리 귀와 꼬리를 완전히 숨기지는 못하나봐. 꼬리의 크기는 사실 요력의 척도이기도 해서, 그냥 처음부터 큰 꼬리를 숨길 마음이 없는 것 같기도 해.',
			null,
			'비었음',
		],
		evaluation: {
			bad: '꽤나 실망스럽구마——',
			exbad: '지금 나랑 장난하자는 게냐? 좋제, 함 해보자꾸마!',
			exgood: '너구리한테 제격인 음식이구만.',
			good: '후후——이 늙은이의 기대를 저버리지 않는구만.',
			lackmoneyangry: '나뭇잎으로 안 속이는걸 다행으로 여기려무나!',
			lackmoneynormal: '나뭇잎이라면 아직 많지만, 돈은 없구만.',
			norm: '고작 이정돈감?',
			repell: '요즘 얼라들은 노인공경도 모르는 겐감?',
			seenRepell: '너구리들이랑 같이 먹는 편이 더 좋은데 말야.',
		},
		name: '후타츠이와 마미조',
		spellCards: {
			negative: [
				{
					description:
						'다음 30초 동안, 얻는 수익금은 모두 나뭇잎으로 된 돈입니다. 이는 일일결산 시간에만 알 수 있으며, 이 시간 동안 얻는 수익은 모두 의미가 없어집니다. 아무리 그래도 위조 지폐 사용은 좀 그렇지 않나요?!',
					name: '「못돼먹은 상인 혼내주기」',
				},
			],
			positive: [
				{
					description:
						'너구리 여러 마리를 소환해, 앉아 있는 손님들의 모습으로 변신해(마미조 자신은 제외) 다시 손님 대기열에 합류합니다. 손님으로 변신한 너구리들은 그 손님의 선호도, 예산을 따라갑니다. 희귀 손님으로 변신한 너구리는 해당 손님의 스펠카드를 하루 동안 단 한 번만 발동시킬 수 있습니다.',
					name: '「마미조화 손님 십변화」',
				},
			],
		},
	},
	4000: {
		chat: [
			'오늘도 쓸만한 소재가 없네요…',
			'사람이 많은 곳엔 쓸만한 정보도 있겠지.',
			'적절한 휴식이 일의 능률을 올리는 법이죠~',
			'기사든 요리든 둘 다 조미료가 있어야 하는 건 똑같거든요~',
		],
		description: [
			'매일 환상향의 이곳저곳을 돌아다니며 소재를 모아 신문을 만드는 카라스 텐구. 그 유명한 "붕붕마루"의 기자야. 유명한 이유는 신문이 좋은 게 아니라 너무 많아서…',
			'이미 강력한 요괴인데다 신문과 무기 때문에 아야씨는 환상향에서 그다지 대접받지 못하는 것 같아. 그래도 열심히 노력하는 모습은 나도 힘이 나게 만들어. 하지만... 신문에 이상한 소리는 좀 덜 썼으면 좋겠어.',
			'신문은 정말 대단한 거 같아! 아야씨는 환상향의 역사를 기록했구나. 물론 조금 왜곡된 부분도 있지만...귀중한 추억이 있다는 건 사실이지! 아야씨한테 딱 맞는 신문 양식을 찾았으면 좋겠어.',
		],
		evaluation: {
			bad: '이런 요리로 식당을 할 수 있는 걸까요…',
			exbad: '이딴 요리는 헤드라인 감이야!',
			exgood: '이런 맛있는 요리는 헤드라인 감이야!',
			good: '대박의 가능성이...!',
			lackmoneyangry:
				'이런 말도 안 되는 값을 요구하다니! 신문에 고발하지 않은 것만으로도 감사히 여기라고!',
			lackmoneynormal:
				'신문을 너무 많이 만들었나... 야식 사먹을 돈까지 써버렸네...',
			norm: '소재로 쓰기에 무난해 보이네요~',
			repell: '잠깐!? 제가 신고하는 건 아무렇지도 않은 건가요?',
			seenRepell: '손님이 아무도 없는데 정보를 어떻게 모으겠어?',
		},
		name: '샤메이마루 아야',
		spellCards: {
			negative: [
				{
					description:
						'가게에 소용돌이가 불어닥쳐 30초간 음식을 던져 서빙할 수 없게 됩니다. 또한 신문에서 가게를 비방하는 기사를 내, 명당 효과가 제거됩니다.',
					name: '「금술 필창지탄」',
				},
			],
			positive: [
				{
					description:
						'신문 광고를 통해 가게를 대대적으로 홍보합니다. 내일부터 가게가 명당이 되며, 3일 뒤 원래대로 돌아옵니다. 명당: 손님의 예산이 10% 증가하며, 유동량이 5% 증가합니다. "시그니처" 태그가 인기 있어집니다. 만약 가게가 이미 명당이거나 오늘 중으로 해당 스펠이 이미 발동했을 경우, 다음 효과로 변합니다. 「식당의 요리신무쌍」 "시그니처" 태그가 붙은 오늘의 메뉴 요리들이 "유명 요리"가 됩니다. 유명 요리를 요리할 때, 조리 시간이 5초 미만일 시 즉시 완성시킵니다. 해당 태그를 선호하는 손님은 유명 요리를 섭취하고 나서 30% 확률로 추가 주문을 일으킵니다. 또, 해당 주문에서 음료에 소모된 값을 돌려주며, 한 번 추가 주문 상한량을 늘립니다. 30초간 지속됩니다.',
					name: '「환상을 덮치는 풍미」',
				},
			],
		},
	},
	4001: {
		chat: [
			'외로움은 독도 되고 약도 되지.',
			'적은 양의 독은 약이 되는 법이야.',
			'과도한 음주도 독이 될 수 있어.',
			'해바라기에도 독이 있었으면 좋았을 텐데.',
		],
		description: [
			'독이 있는 은방울 꽃밭에 혼자 사는 요괴. 요괴가 된 지 얼마 되지 않아 여러가지 경험이나 지식이 부족하고, 남들과 잘 어울리지 못해. 늘 혼잣말을 하거나 춤을 추는 모습, 귀여운 모습이 있지만 때로는 기괴하네... 성격은 솔직한 편이라 다행이야.',
			'요괴지만 몸은 인형같아. 그래서 몸에 독이 가득 차도 괜찮은 걸까? 인간에 대한 우호도도 낮고, 옛날에는 요리에 독을 넣어 조종했다던데... 아직 어려서 그런지 얼마나 심각한 문제인지 모르는 건가봐. 성숙해질 때까지 조심해야겠어!',
			'독을 품은 인형이 이렇게 단순할 지는 누가 알았겠어. 어떻게 가르쳐도 전부 배우다니... 새로운 요괴가 성장하는 건 뭔가 신기한 느낌이네! 나도 아직 어린 편이라 선배라 하긴 애매하지만, 이 아이가 안전하게, 더 행복하게 자랐으면 좋겠어. 물론 내가 더 약하긴 하지만...',
		],
		evaluation: {
			bad: '방울이가 싫어할 만한 맛인데...',
			exbad: '방울이의 독보다 더 강하잖아!',
			exgood: '이렇게 맛있는 건 독 이후로 처음이야!',
			good: '방울이도 나도 칭찬한 맛!',
			lackmoneyangry: '블랙기업이라더니, 사실이잖아!',
			lackmoneynormal: '방울이랑 힘들게 모은 돈인데... 슬슬 바닥이야…',
			norm: '독보다 나은게 없는데 왜 먹지?',
			repell: '언젠가 그 몸이 썩어갈 거야...',
			seenRepell: '그렇게 안 봤는데...',
		},
		name: '메디슨 멜랑콜리',
		spellCards: {
			negative: [
				{
					description:
						'「극독중화」 효과를 제거합니다; 요리를 만들 때 요리에 "우울의 독" 태그가 붙습니다. 이 태그가 붙은 음식을 먹은 손님은 추가 주문을 하지 않습니다. 30초간 지속됩니다.',
					name: '영란 「시든 꽃밭」',
				},
			],
			positive: [
				{
					description:
						'「시든 꽃밭」 효과를 제거합니다; 또한 메디슨이 요리에 들어있을지도 모를 독 요소를 제거해, 음식 내 태그 충돌을 30초간 비활성화합니다. 즉시 "도수 중간"의 음료를 1개 얻습니다.',
					name: '분해 「극독중화」',
				},
			],
		},
	},
	4002: {
		chat: [
			'지루한 탄막놀이 같은 건 관심 없어.',
			'꽃들도 즐거워 보이는구나.',
			'이런 분위기는 처음이야.',
			'꽃들 속에 술이 있거늘, 혼자 마시기 문제 없지.',
		],
		description: [
			'우아한 여인처럼 보이지만, 많은 사람들은 어떤 이유에서인지 "꽃의 폭군"으로 여기는 것 같아. 무시무시한 전설이 떠돌고 있지만, 유카씨가 인간이나 약한 요괴를 괴롭히는 모습을 실제로 본 사람은 아무도 없어.',
			'유카씨가 꽃들을 돌보는 모습을 보면, 유카씨에 대한 전설들은 다 사라질 거야. 난 아직도 모르겠어. 유카씨는 그렇게 강한데 왜 이상한 소문들이 돌아다니는 걸 보고만 있는 걸까?',
			'전혀 틀렸어! 애초에 그런 소문을 "참아낸" 것도 아니고, 그냥 신경쓴 적 자체가 없던거야. 그러니 해명할 필요도 없는거지. 유카씨의 강점은 바로 그녀의 마음이었어. 남들을 깔보는 강대한 요력 때문이 아니라, 그녀의 순수하고 깨끗한 자아야말로 그녀를 무적으로 만드는 거였어.',
		],
		evaluation: {
			bad: '이따위라면, 가장 순수한 꽃마저도 봉오리를 틔우고 싶어하지 않을 거야.',
			exbad: '하——! 그 도발, 받아주도록 하지——!',
			exgood: '마음의 꽃을 피워낼 수 있는 능력을 가졌구나!',
			good: '꽃봉오리가 천천히 열리는 기분이야.',
			lackmoneyangry:
				'내가 마법을 사용하지 않은 것만으로도 감사히 여기렴.',
			lackmoneynormal:
				'가격이 이렇게 높으면, 사업을 계속하기 어려울 거야.',
			norm: '이런 것으로는 꽃들의 사랑을 받을 수 없어.',
			repell: null,
			seenRepell: null,
		},
		name: '카자미 유카',
		spellCards: {
			negative: [
				{
					description:
						'싱긋한 웃음과 함께 자신이 앉아 있던 열의 맨 위로 가 마포를 날려 해당 열의 모든 테이블을 파괴합니다. 남은 시간동안 해당 좌석들은 사용할 수 없게 되며, 앉아있던 손님들은 두려움에 떤 채 도망가게 됩니다.',
					name: '「결투 스파크!!!!」',
				},
			],
			positive: [
				{
					description:
						'유카가 꽃을 심고 기릅니다. 분위기가 100%에 달할 시 꽃을 하나 더 심습니다. 심어진 꽃은 24초간 지속되며, 매 초마다 팁을 25씩 생산합니다. 유카 이외의 희귀 손님이 보상 스펠을 발동할 시, 무작위 꽃이 해당 스펠의 힘을 흡수해 만개하고, 본 지역에 있는 희귀 손님을 가게로 이끌리게 하며, 이끌려진 희귀 손님이 그 꽃을 따게 됩니다. 꽃이 피어난 동안 손님들은 식사 후 분위기를 15 추가로 얻습니다. 꽃은 15초 뒤 저절로 지며, 콤보가 끊기는 실수를 1회 방지하는 꽃잎 저고리 1개로 변합니다.',
					name: '「화조풍월, 피어나는 향기」',
				},
			],
		},
	},
	4003: {
		chat: [
			'준비되지 않은 혁명은 성공할 수 없다.',
			'약한 요괴여, 와라! 하나가 되어 올라갈테니!',
			'언젠가 너도 내 밑으로 들어올 거다.',
			'약한 자만이 따뜻한 집밥을 그리워하지.',
		],
		description: [
			'감언이설에 능한 아마노자쿠. 환상향을 뒤집어 엎겠다는 말로 젊은 요괴, 심지어 인간까지도 꼬셔서 부하로 삼았지만 돈이 없어서 제대로 대접을 못 해주고 있지. 심지어는 텐구에게 광고를 내게 해 관광객들의 돈을 뜯고 있어!... 그야말로 제멋대로 하는 녀석이지.',
			'정말 세이자씨는 하극상을 일으키고 싶은 걸까? 하극상 이후는 관심이 없으신 거 같은데. 어쩌면 하극상을 하려는 그 과정을 좋아하시는 게 아닐까.',
			'동료들이 하나 둘 떠나가고 있으면 보통은 희망이 없다고 생각하지. 하지만 세이자씨는 포기할 생각이 없으신 거 같아. 이 평화로운 세계에서 보기 드물 정도로 포기하지 않고 목적을 달성하려고 하시는데, 좀 존경스럽네...…',
		],
		evaluation: {
			bad: '나약함의 맛이군.',
			exbad: '이따위 음식이 맛있다고!? 이런 썩어빠진 세상부터 뒤집을 거다!',
			exgood: '난 이제 최강이다! 지금 당장 뭐든 뒤집어버릴 수 있도다!',
			good: '힘이 느껴지는군! 이것이 음식의 힘인 건가?',
			lackmoneyangry: '이 정도 팁은 그냥 보호비라고!',
			lackmoneynormal:
				'더러운 꼼수를 써서 돈을 불리다니, 좋은 계획이잖아.',
			norm: '평범함을 뒤집어도 "평범함"이다.',
			repell: '여기가 누구 구역이라고 생각하는 거냐!??',
			seenRepell: '힘 없는 자들은 언제까지 고통받아야 하는가!',
		},
		name: '키진 세이자',
		spellCards: {
			negative: [
				{
					description:
						'혁명이다! 세이자가 예산이 가장 많은 손님의 예산을 자기 것으로 바꿉니다. 이후 15초 동안 세이자를 제외한 모든 손님의 예산을 가장 낮은 예산으로 바꿉니다.',
					name: '역부 「역전세계」',
				},
			],
			positive: [
				{
					description:
						'세이자가 모든 것을 뒤집는 능력으로 모든 손님의 선호도를 뒤집습니다. 세이자를 제외한 모든 손님의 불호 태그를 선호 태그로 바꿉니다. 30초 동안 지속됩니다. 만약 대기줄을 포함해 일반 손님의 수가 7보다 적으면, 이 스펠카드는 다음 스펠카드로 바뀝니다. 역궁「천양몽궁의 조칙」 대기줄을 포함한 모든 일반 손님들의 최대 주문 수량을 늘리고, 예산이 25% 증가합니다. 일반 손님들은 이 효과를 최대 3번 받을 수 있습니다.',
					name: '기부 「오버리액션」',
				},
			],
		},
	},
	4004: {
		chat: [
			'여기 오면 재밌는 이야기들 해주는 거야?',
			'휘침성이 이토록 시끌벅적한 적이 없었거늘…',
			'세이자도 여기 자주 오지?',
			'이 적막한 성에 활기를 불어넣어줘서 고마워.',
		],
		description: [
			'잇슨보시를 동경하는 소인족, 성의 주인이야. 항상 무언가에 대비하고, 꽤나 진지한 성격을 가졌어. 언젠가는 전설의 용사가 되겠다던데. 모험을 좋아하는 공주라니, 좀 새롭잖아. 화과자에 대해서 정말 잘 아시는게 어울리기도 해.',
			'용사의 여정을 떠나고 싶어해서, 엄청나게 많은 준비를 하는데, 정작 여정을 떠난 적은 한번도 없어. 첫 시도부터 전설이 되려고 하는 거 같은데. 시작부터 조금 무리 아니려나…',
			'드디어 신묘마루씨가 마음의 짐을 내려놓고 여정을 떠났어. "용기 하나로 세상을 구한 용사"의 이야기를 듣고 말이야. 나도 그 말이 맞는 거 같아. 결과만 바라보는 건 너무 큰 부담이 되거든. 나한테 딱 맞는 걸 하는 게 최고인 거 같아!',
		],
		evaluation: {
			bad: '비상 식량으로도 못 써먹겠네.',
			exbad: '내 용기가 움츠려들 정도로 맛없잖아!',
			exgood: '여정을 떠날 용기를 주다니!',
			good: '무용담을 읽는 느낌이잖아!',
			lackmoneyangry: '시작은 귀족이었으나, 끝은 추락이라니...…',
			lackmoneynormal:
				'너무 오랫동안 눈을 돌리고 살았나? 요즘 세상은 물가가 이렇게 높아?',
			norm: '간단히 배를 채울 요깃거리 정도네.',
			repell: '미래의 용사를 쫓아내는 거야!?',
			seenRepell: '용사로서, 이건 두고 볼 수 없겠네.',
		},
		name: '스쿠나 신묘마루',
		spellCards: {
			negative: [
				{
					description:
						'요술 망치의 힘을 받아, 30초 동안 몸이 커집니다.',
					name: '소추「커져라 얍」',
				},
			],
			positive: [
				{
					description:
						'계산대를 망치로 쳐서 「요술 망치의 힘」 을 얻습니다. 영업이 끝나면, 요술 망치의 힘으로 수입이 증폭됩니다. 「요술 망치의 힘」 1레벨은 수입을 7% 증폭시키고, 이후 레벨당 2%의 수입을 증폭시킵니다.',
					name: '보추「인플레이션 위기」',
				},
			],
		},
	},
	4005: {
		chat: [
			'수면 부족은 피부에 안 좋은데…',
			'무리해서 다이어트를 하는 건 결코 아름답지 않아.',
			'한밤중인데도 덥네…',
			'머리카락도 좀 손봐야 하지 않을까…',
			'사모님, 수고하시네요~',
		],
		description: [
			'성실하고 친절하신 늑대 인간씨야. 이웃집 언니 같은 느낌이랄까. 대나무 숲에는 달의 주민이 살고 있어서 그런지, 달과 관련된 요괴들이 많이 사는 것 같아. 카게로씨도 그 중 하나이고.',
			'카게로씨는 피부 관리에 민감하시네. 이렇게 자기를 꾸미는 데 신경 엄청 쓰는 늑대 인간은 처음 봤어. 풀뿌리 요괴 네트워크는 분명 평화로운 곳이겠지. 어쩌면 나도...가게를 열지 않았다면 거기에 있었으려나.',
			'카게로씨는 바깥 세계에서 멸종한 혼슈 늑대 중 하나야. 숭배받고, 존경받았지만, 결국엔 멸종이네. 안타까워. 환상향의 인간과 요괴는 더욱 짐승들(새도 포함이야)에게 신경을 써 줘야해!',
		],
		evaluation: {
			bad: '사모님...? 어디 아픈 건 아니지?',
			exbad: '이런 요리는 친절함이 보이질 않잖아...',
			exgood: '사모님의 요리는 정말 완벽해!',
			good: '음식에 친절함이 느껴져!',
			lackmoneyangry:
				'빠진 털들을 전부 돈으로 바꿀 수 있다면 얼마나 좋았을까...',
			lackmoneynormal: '역시 야식은 너무 많이 먹게 된다니까…',
			norm: '더 잘 할 수 있을 것 같은데, 아쉽네.',
			repell: '풀뿌리 요괴한테도 위엄이 있지!',
			seenRepell: '우리들 좀 그냥 내버려두면 안돼?',
		},
		name: '이마이즈미 카게로',
		spellCards: {
			negative: [
				{
					description:
						'30초 동안, 요리에 "배부름" 태그가 들어가있지 않으면, 최악의 평가를 받습니다. 이미 불호 태그인 경우 또한 상관없이 최악의 평가를 받습니다.',
					name: '아랑「월하의 폭식」',
				},
			],
			positive: [
				{
					description:
						'야성의 본능이 깨어나, 30초 동안 모든 손님들이 "육류"와 "산의 일미" 태그를 좋아하게 되고, 이에 따라 요리를 평가하게 됩니다. 이미 선호 태그였던 손님은 반드시 최고 평가를 내리게 됩니다.',
					name: '낭혼「야성의 각성」',
				},
			],
		},
	},
	4008: {
		chat: [
			'플랑은 무한대의 힘을 가지고 있긴 해…',
			'플랑 것도 좀 남겨놔야겠어.',
			'이 가게의 운명은 이미 아무도 모르게 바뀌었지.',
			'사쿠야에 비하면 한참 멀었네.',
		],
		description: [
			'홍마관의 주인이야. 멀리서 보면 어린아이지만, 가까이 다가가면 기세에 눌려 말도 못 할 정도야. 역시 흡혈귀 당주야! 하지만 궁니르를 던지는 모습은 어린아이로 보기는 힘드네... 아직 완전히 어른이 된 건 아니지만, 많은 사람들의 운명을 쥐고 있어. 엄청 작은 어깨지만, 거주자들을 지고 있으니깐. 뭔가 가장의 느낌이랄까. 그리고 레밀리아씨도 사람들이 생각하는 것처럼 이기적이진 않아.',
			null,
			'설명',
		],
		evaluation: {
			bad: '처음부터 별 기대도 안 했어.',
			exbad: '이런 걸 만들면, 어떻게 될 진 알고 있겠지?',
			exgood: '이런 맛있는 음식만이 흡혈귀의 고귀한 지위에 걸맞는 법이야!',
			good: '이번엔 꽤 괜찮네. 드디어 기대할 가치가 있겠어.',
			lackmoneyangry: '이래서 사쿠야가 그 많은 돈을 준거였구나!',
			lackmoneynormal: '내가 직접 돈 관리를 하는 건 처음이라…',
			norm: '우리 메이드들보다 훨씬 심하잖아.',
			repell: '흥. 네 위치를 깨닫게 해줘야겠네...',
			seenRepell: '집에서 사쿠야가 만든 요리를 먹는 게 훨씬 낫겠어.',
		},
		name: '레밀리아',
		spellCards: {
			negative: [
				{
					description:
						'레밀리아가 자신의 위엄을 드러내, 왼쪽 아래에 있는 주문 패널을 붉은 안개로 덮습니다. 60초간 지속됩니다.',
					name: '야부「홍무이변재림」',
				},
			],
			positive: [
				{
					description:
						'레밀리아가 홍마관 주인의 이름으로 한밤 중 연회를 엽니다. 낮이 끝나면, 야작식당은 「불야성 레드」 상태가 되고(이미 낮이 끝났다면 즉시 효과를 받습니다) 일을 시작합니다. 「불야성 레드」： 일반 손님의 예산이 기본적으로 500엔 이상이 됩니다. 동료의 작업 속도가 100% 증가하고, 사쿠야가 일할 땐 최대 속도가 됩니다. 다음 번 주문을 할 확률이 100%가 됩니다. 스펠카드가 발동할 때, 레밀리아가 가게에 있다면, 영업 종료가 60초 늦춰집니다. 추가로, 일반 손님이 300%의 속도로 등장합니다. 레밀리아가 없다면 희귀 손님이 떠날 때, 그날 밤 보상 스펠 카드를 얻은 수만큼 요정 메이드를 소환합니다.',
					name: '홍부「불야성 레드」',
				},
			],
		},
	},
	5000: {
		chat: [
			'오늘도 엄청 피곤하네——',
			'오늘 하루도 끝이에요!',
			'나에게 상을 주는 거예요!',
			'근육통이——',
		],
		description: [
			'영원정의 레이센씨와 이름이 같은 달의 사자야. 아마 내가 지상에서 올라와서 그런지 더 잘 대해주는 것 같아. 가끔 지상에 가고 싶어하는 모습을 보이는데, 과거에 뭔 일이 있었는지는 모르겠어… 아니면 그냥 달의 사자들의 훈련이 힘든걸지도 몰라.',
			'알고 보니 레이센은 예전엔 약을 찧는 토끼였는데, 자신의 일이 질려서 환상향으로 도망쳤다가 여러 일들을 겪고 달의 사자가 되었다고 해. 어쩐지 지상을 그리워하는 것 같더라니. 그치만 지금도 달의 사자 노릇을 하는 걸 싫어하나봐. 참 안팎으로 힘들게도 사는구나……',
			'후회에 잠겨 살아가는건 어떤 기분일까? 만약 시간을 되돌릴 수 있다면, 그때는 다른 선택을 했을까? 그 선택의 결과는 행복했을까? 이런 질문들을 입 밖으로 꺼내진 못했어……그렇지만 과거에 얽매여있는 것보단 떨쳐내고 앞으로 나아가는 게 더 좋지 않을까? 언젠가 자유로워지길 바래.',
		],
		evaluation: {
			bad: '오늘도 이런 식인건가...…',
			exbad: '오늘은 슬픈 날이네...…',
			exgood: '제 영웅이세요!!!',
			good: '덕분에 피로가 풀린 거 같아요! 고마워요 미스티아씨!',
			lackmoneyangry: '제 물건을 팔아도 돈을 못 내요!',
			lackmoneynormal: '열심히 번 돈이었는데...…',
			norm: '고마워요. 이제 기운 좀 차릴 수 있어요.',
			repell: '이게 제 운명인가봐요.',
			seenRepell: '이 세상 어디에나 부당한 취급은 있네요.',
		},
		name: '레이센',
		spellCards: {
			negative: [
				{
					description:
						'레이센이 땅에 광기의 탄막을 쏩니다. 영향을 받은 손님은 30초간 광기에 빠져 음료에 "도수 높음" 태그가 없다면 최악의 평가를 내립니다. 각주: 광기끼리는 간섭을 한다는데... 과연?',
					name: '「광란의 만취」',
				},
			],
			positive: [
				{
					description:
						'화톳불을 소환해 성대한 잔치를 벌입니다. 현재 있는 토끼 한 마리당 무작위 식재료나 음료를 한 개 얻습니다. 다음 30초간 토끼가 새로 나타나도 효력이 발휘합니다. 식재료를 얻을 확률은 80%, 음료를 얻을 확률은 20%입니다.',
					name: '「달토끼 화톳불 잔치」',
				},
			],
		},
	},
	5001: {
		chat: [
			'가끔은 복숭아 말고도 먹어볼까나~',
			'좋아하는 것을 먹어, 귀여운 삶을 살아야지.',
			'벌써 5번째 식사네!',
			'미식의 경지란, 눈으로 보고 먹는 것.',
		],
		description: [
			'와타츠키 자매의 언니. 친절하고 온화하시지만, 가끔은 어린아이같은 면모도 보이셔. 훈련 도중에 몰래 복숭아와 과자를 가져다 줘서 달토끼들에게 인기가 높다고 해.',
			'토요히메씨는 정말정말 복숭아를 사랑하시고, 여유로우셔. 그녀처럼 강한 사람이 그렇게 아무 걱정 없이 살 수 있을까? 어떤 환경에서도 이렇게 순수하게 사는 것도 어쩌면 능력일지도?',
			'토요히메씨도 하고 싶으셨던 일이 있었구나. 언제부터 은퇴하겠다는 생각이 드셨을까? 어쩌면 처음부터 달의 사자의 리더에 임명되고 싶지 않았을 수도 있어. 지금까지 은퇴하시지 않은 건 적임자가 없어서 그렇고, 또 다른 이유는 아마......요리히메씨를 위해서 그런 거 아닐까?',
		],
		evaluation: {
			bad: '복숭아가 더 맛있는데.',
			exbad: '음식을 계속 낭비하지 않게 하려면...…',
			exgood: '엄청 맛있네! 혹시 가게에서 살아도 되니?',
			good: '맛있다! 좀 더 먹어야겠어——',
			lackmoneyangry: '복숭아를 두고 가잖니?',
			lackmoneynormal: '돈에 너무 집착하면 더러워진단다.',
			norm: '음식을 낭비하지 않는게 제일 중요한 법.',
			repell: '나쁜 참새네——',
			seenRepell: '사람들을 괴롭히면 안 되잖니.',
		},
		name: '와타츠키노 토요히메',
		spellCards: {
			negative: [
				{
					description:
						'토요히메가 무작위 희귀 손님 3명을 "행방불명"시킵니다. 해당 손님들은 오늘 가게에 찾아오지 않습니다.',
					name: '회삭 「천지무형」',
				},
			],
			positive: [
				{
					description:
						'토요히메가 바다와 산을 잇고, 환상향과의 연결을 만들어냅니다. 특정 지역의 손님들이 "면"을 통해 장사하는 지역으로 찾아오게 됩니다. 토요히메의 능력을 통한 지역 회전율은 독립되어있으며, 손님 회전율은 기존의 33%입니다.',
					name: '주위 「산해천중」',
				},
			],
		},
	},
	5002: {
		chat: [
			'잠시 쉬어갈까.',
			'내일 훈련 계획을 짜야겠군.',
			'식후에 운동 좀 해야겠군.',
			'야식 먹는 사람들이 이렇게나 많은 줄은 몰랐는데.',
		],
		description: [
			'와타츠키 자매의 동생. 엄격하고 진지한 성격을 지녔어. 토끼들의 전투, 학습, 예법을 가르치는 등, 달의 사자 리더로서 해야할 일들을 도맡아 하고 있어. 실제로 토끼들이 전투를 한 적은 없지만, 훈련은 엄격하게 진행되다보니 토끼들은 농땡이피우면 큰 벌을 받게 된대.',
			'성격이 너무 딱딱하고, 훈련에서의 엄격함 때문에 토끼들이 잘 다가가지를 않는대. 느긋한 그녀의 언니와는 별개로 요리히메씨는 언제나 긴장을 풀지 않아. 똑똑할수록 생각을 너무 많이 하는 거려나……',
			'그녀의 스승의 뜻을 이어받아 달의 도시에 무언가 기여를 하고 싶어해. 그러다보니 항상 위기감 속에 살고 있지. 엄격한 훈련 또한 토끼들이 전쟁에서 죽지 않도록 하기 위해서였던거야. 요리히메씨는 혼자서 모든 것을 짊어진, 정말 강인하고 부드러운 사람이구나……',
		],
		evaluation: {
			bad: '……40점.',
			exbad: '0점!',
			exgood: '이 정도면 만점!',
			good: '나쁘지 않네. 90점.',
			lackmoneyangry: '두 번 다시 달의 도시에 발을 못 들이게 해주마!',
			lackmoneynormal: '이 가격은……내일 다시 얘기하도록 하지.',
			norm: '60점.',
			repell: '선전포고라고 받아들이면 되는건가?',
			seenRepell: '군대에선 불공평이란 있을 수 없는 일이다.',
		},
		name: '와타츠키노 요리히메',
		spellCards: {
			negative: [
				{
					description:
						'요리히메가 전설의 힘을 봉인시킵니다. 앞으로 30초동안 "전설적" 태그가 붙은 음식이나 "전설적" 태그가 붙은 재료를 첨가한 음식을 만들 수 없습니다.',
					name: '계벌 「신들의 심판」',
				},
			],
			positive: [
				{
					description:
						'요리히메가 신령을 불러일으켜, 「신광의 월계관」을 하나 얻습니다. 제공한 음식에 "전설적" 태그가 붙었다면 추가로 하나 더 얻습니다. 희귀 손님이 완벽 이하의 평가를 줄 시 「신광의 월계관」을 하나 소모해 기적을 일으켜 평가를 완벽으로 끌어올립니다.',
					name: '신소 「신들의 전언」',
				},
			],
		},
	},
	5003: {
		chat: [
			'소크라테스도 많이 먹어♡～',
			'마계에도 이런 가게가 있다니♡',
			'혹시 좀 도와줄까?',
			'얌전히 기다려볼까나~',
		],
		description: [
			'성실하고, 열심히 일하는 친절한 소녀야. 폭신폭신 마법 상점을 운영하고 있어. 그리고 소크라테스라는 쿨한 성격의 고양이도 기르고 있어.',
			'엘렌씨는 도움이 필요한 사람을 만나면, 도와주려고 열과 성을 다하셔. 엄청 친절한 마법사라고 할 수 있지! 그리고 엘렌씨는 일에 대한 열정이 있으셔서 그런지, 이야기할 때마다 기운이 넘치는 느낌이야.',
			'겉모습은 어린아이지만, 실체는 몇 천 년을 살아온 대마법사야. 정말 세상일은 알기 어렵네! 이렇게 오래산 요괴를 여럿 보았지만, 이렇게 순수하고 착한 마음을 가지고 있는 건 엘렌씨가 처음이야!',
		],
		evaluation: {
			bad: '으~음, 고생했어..…',
			exbad: '일에 더 집중해주면 좋겠는데...…',
			exgood: '엄청 맛있어서 소크라테스도 반짝이고 있어!',
			good: '나도 소크라테스도 모두 만족이야~!',
			lackmoneyangry: '미안해, 돈 좀 더 열심히 일해서 벌어야겠어...…',
			lackmoneynormal: '더 열심히 노력해서 돈을 벌어야겠어...…',
			norm: '식사 대접, 고마워!',
			repell: '소크라테스는 여기 출입금지야?',
			seenRepell: '손님은 가리지 않고 받아야지.',
		},
		name: '엘렌',
		spellCards: {
			negative: [
				{
					description:
						'소크라테스가 동료들을 위협합니다. 30초동안 동료들의 이동 속도가 30%, 작업 속도가 50% 감소합니다.',
					name: '「울타르의 고양이」',
				},
			],
			positive: [
				{
					description:
						'다음 30초동안 손님들의 주문을 정상적으로 처리하고 나면 폭신폭신 캔디를 드랍합니다.',
					name: '「사랑의 캔디 하우스」',
				},
			],
		},
	},
	5004: {
		chat: [
			'이 실험 데이터들은 아직 검증이 더 필요하겠어...…',
			'연구하느라 밥 생각도 못 했네.',
			'조금만 먹고 연구해야지.',
			'기다리는 동안 계산이라도 해야겠어.',
		],
		description: [
			'마계에서 (아마도 위험한) 연구를 하고 있는 학자?씨. 자기를 신령이라고 칭하시지만 보통 악령이라 여겨져. 뭐가 됐든 강한 강인함과 자신감이 느껴지는데, 도대체 무슨 존재일까?',
			'미마씨가 키리사메 가문의 마법 실험에서 태어났다고 들었을 때 엄청 놀랐어! 하지만 미마씨는 신념이 강하셔서 누군가의 조종 따위는 안 받으신 거 같아. 그래서 미마씨는 몇 백년 동안 키리사메 가문하고 싸우면서까지도 진리를 탐구하고 추구한다는 신념을 잃지 않으신 거 같아.',
			'미마씨가 마리사씨의 스승님이셨구나! 어쩐지 좀 닮은 구석이 있더라니... 끝없이 자신의 지식을 탐구하는 것도 그렇고, 자신의 나약한 모습을 절대 안 보여주려고 하는 것도 그렇고...... 겉으로 보면 완전 다른 모습이지만, 이 외롭고 결단있는 두 분의 과거는 어떤 식이었을까?',
		],
		evaluation: {
			bad: '애송이가 전문가를 어떻게 따라올 수 있겠어.',
			exbad: '진리를 모독하는 경박한 놈 같으니.',
			exgood: '밀레니엄 난제를 해결한 것만 같아!',
			good: '해답의 공식을 찾은 것만큼 기분이 좋잖아!',
			lackmoneyangry: '내가 누구인지 까먹었나보네. 기강 좀 다져볼까——?',
			lackmoneynormal: '좀 비싸긴 하지만, 나쁜 건 아냐.',
			norm: '전혀 새로울 게 없는 상식이야.',
			repell: '어라? 이딴 식으로 하면, 어떻게 될지 잘 알텐데?',
			seenRepell: '효율적인 방법을 쓰는구나. 꽤 똑똑하잖아.',
		},
		name: '미마',
		spellCards: {
			negative: [
				{
					description:
						'악령의 원한을 받습니다: 다음 30초동안 요스즈메의 노래의 효과를 얻을 수 없고, 특수 조리기구의 효과 또한 받지 못합니다.',
					name: '「신성모독의 대가」',
				},
			],
			positive: [
				{
					description:
						'필드에 「유현봉마진」이 존재하지 않는다면 마법진을 생성하고, 존재하고 있다면 에너지를 2 얻습니다. 「유현봉마진」: 미마가 아닌 희귀 손님이 스펠 카드를 발동할 시 에너지를 1 얻습니다. 에너지가 7 쌓이면, 모든 에너지를 소비해 다음과 같은 효과를 얻습니다. 몽부 「한 티끌의 시간」 필드에 있는 모든 방문객의 예산이 회복되고, 다음 20초동안 요리를 만들 때 식재료를 소모하지 않은 채 순식간에 완성시킵니다. 손님들은 무조건 최고의 평가를 내립니다.',
					name: '「유명의 리인카네이션」',
				},
			],
		},
	},
	5005: {
		chat: [
			'인간 세계에 다시 가고 싶네.',
			'사실 인간 세계에도 이런 가게는 있어.',
			'이렇게 마계에 있는 것도 나쁘진 않아.',
			'마계가 이렇게 활기찬 건 오랜만이네.',
		],
		description: [
			'마계를 몰래 빠져나와 바깥 세계로 여행(일)가는 마계인. 전동 여행 가방을 들고 다녀. 자신의 여행 과정을 "블로그"라는 곳에 올린다는데, 바깥 세계에서 인기가 엄청 많대. 인간들은 다른 사람이 가는 여행을 보는 걸 좋아하나?',
			'루이즈씨는 여행을 공유하시기도 하지만, 창의적인 디자인도 공유하셔. 엄청 창의적이시기도 하고, 옷 디자인도 잘하시고, 칭찬도 잘하시고, 디저트도 잘 만들어주시고... 나도 루이즈씨처럼 멋있는 사람이 되고 싶다.',
			'아무리 루이즈씨처럼 마음씨 좋은 사람이라도 모든 사람들의 공감을 얻을 수는 없구나. 서로를 이해하는 건 원래 어려운 법이긴 하지....그래도 루이즈씨는 "좋아하는 일"을 그만둘 생각이 없으신 거 같아. 하시는 일이 잘 됐으면 좋겠네. 계속 응원해야겠어.',
		],
		evaluation: {
			bad: '이건 블로그에 올려도 아무 관심도 안 받는다구.',
			exbad: '이런 걸 블로그에 올리면 신고 먹을 것 같은데.',
			exgood: '추천 글로 블로그에 올려야겠어!',
			good: '블로그에 올리고 싶을 정도로 맛있네!',
			lackmoneyangry: '유명 관광지에서도 이렇게까진 안 받는다고!',
			lackmoneynormal: '내가 생각했던 것보다 비싸네...…',
			norm: '딱 적당한 수준이네.',
			repell: '손님을 쫓아내는 관광 명소엔 미래가 없는데…',
			seenRepell:
				'아무리 유명한 곳이라도 손님을 그렇게 막 대할 자격은 없어.',
		},
		name: '루이즈',
		spellCards: {
			negative: [
				{
					description:
						'영업 종료 기점으로 60초가 지나면 남아있는 손님들을 모두 내쫓고 강제로 문을 닫습니다.',
					name: '「잃어버린 유리구두」',
				},
			],
			positive: [
				{
					description:
						'루이즈가 마법의 카메라를 소한합니다. 희귀 손님이 완전히 만족하지 않고 예산도 남은 채로 가게를 떠난다면, 카메라가 자동으로 그를 촬영해 「여행 블로그」를 기록합니다. 당일 영업 종료 시 「여행 블로그」가 방출되며(영업이 이미 끝난 경우 즉시 방출) 피사체를 투영해 다시 가게로 오게 만듭니다. 희귀 손님의 투영은 스펠 카드를 발동할 수 있으며, 원본과 동일한 입맛을 갖고 있지만 투영의 예산과 주문 한도는 원본 피사체가 떠난 시점으로 저장됩니다.',
					name: '「전설의 걸리버」',
				},
			],
		},
	},
	5012: {
		chat: [
			'밥 먹으러 밖에 나온 것도 오랜만이네……',
			'이제야 좀 오랫동안 잘 수 있겠네.',
			'오랫동안 고생했구나.',
			'네 노력은 쭉 보고 있었단다.',
		],
		description: [
			'환상향을 만든 요괴의 현자. 가장 오래된 요괴라는 소문이 있어. 평소 모습을 잘 안 보이고, 성격이 좀 나쁘시지만, 누구도 모르게 환상향의 안전을 지키고 있어... 많은 사람들이 그녀를 이해하지 못 하지만, 그래도 환상향을 누구보다 좋아한다는 건 확실해.',
			null,
			null,
		],
		evaluation: {
			bad: '이런건 스키마로 던져버려야겠네.',
			exbad: '이런건 스키마에 들어올 자격도 없어.',
			exgood: '잘 했는걸! 좀 더 고평가받아야겠어!',
			good: '괜찮네. 이름값은 하는구나.',
			lackmoneyangry: '환상향에서 이런 식의 날강도질은 용납할 수 없는걸?',
			lackmoneynormal: '장사하는 게 좀 지나치는구나.',
			norm: '내가 생각한거랑은 꽤나 다른걸.',
			repell: '우리 잠깐 스키마에서 대화 좀 나눌까?',
			seenRepell: '내가 바란 환상향은 이렇지 않았는데 말야.',
		},
		name: '야쿠모 유카리',
		spellCards: {
			negative: [
				{
					description:
						'무작위로 위치를 변경하는 스키마를 여럿 개방합니다. 스키마에 가까이 가면 빨려들어가 다른 무작위 스키마로 나오게 됩니다. 스키마에 빨려들어가면 들고 있던 음료를 잃게 됩니다. 스키마는 30초간 지속됩니다.',
					name: '「존재와 부재의 경계」',
				},
			],
			positive: [
				{
					description:
						'당일 영업 종료 전 해당 스펠 발동 시, 남은 시간이 44초 이상인 모든 버프의 시간을 동결시켜 영업이 끝날 때까지 효과를 연장시킵니다. 스펠이 두 번째로 발동되거나 영업 종료 후 발동될 시, 남은 시간이 44초 이상인 모든 버프의 시간이 현재 남은 시간의 10%만큼 늘어납니다(최대 17초).',
					name: '「인간과 요괴의 꿈나라」',
				},
			],
		},
	},
	9000: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	9001: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	9002: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	9003: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	9004: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	10000: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	10001: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	10002: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	11000: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	11001: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
} as const satisfies Readonly<
	Partial<Record<number, ILocalizedSpecialGuestText>>
>;
