import type { ILocalizedSpecialGuestText } from '@/domain/data/localization/types';

export const SPECIAL_GUEST_LOCALIZATION_ZH_TW = {
	0: {
		chat: [
			'我作為鄰居來捧場了哦老闆娘！',
			'……別這麼看着我！我來到店裏並不會影響店鋪的衞生啦！',
			'你家附近的蟲子……？和我沒關係啦！',
			'為了蟲族的復興！現在我們推出“昆蟲的通知“——為什麼要讓我閉嘴！',
			'夜晚的螢火蟲不是很美好嗎？駐足多看一會吧。',
		],
		description: [
			'喜歡蟲子的老友。雖然咱們已經認識了很久，但我還是受不了圍在她身邊的那羣蟲子。',
			'這傢夥表面上是個螢火蟲妖怪，其實是強大的上古蟲族的末裔哦，所以才總擺出一副了不起的樣子。',
			'我很瞭解她，雖然看起來脾氣不太好，但其實是很為朋友着想的傢夥！誰能想到，就是這麼個小小的螢火蟲，希冀着用自己的微末光芒，孤獨又決然地照亮這衰敗已久的一族呢？',
		],
		evaluation: {
			bad: '哦！謝謝。',
			exbad: '居然這麼對我，就讓你看看蟲子的厲害！',
			exgood: '居然吃到這麼合我心意的菜……一定要有所回報才行！',
			good: '看來你很懂蟲族的品味！',
			lackmoneyangry: '連莉格露大人的錢都想搶，你膽子挺大！',
			lackmoneynormal: '算我欠你的人情啦~下次放心來找我幫忙吧！',
			norm: '哇，不錯嘛！',
			repell: '居然敢趕螢火蟲大人！？',
			seenRepell: '哎，真沒勁。',
		},
		name: '莉格露',
		spellCards: {
			negative: [
				{
					description:
						'喚出大量讓人討厭的飛蟲，一口氣將店內的客人統統驅趕，對於小吃店來説，是非常可怕的技能！',
					name: '蠢符「夜蟲龍捲」',
				},
			],
			positive: [
				{
					description:
						'喚出大量螢火蟲，讓店內的氣氛更加美妙，客人刷新時間減少30%，持續60s。',
					name: '燈符「螢光現象」',
				},
			],
		},
	},
	1: {
		chat: [
			'“黑夜給了我們黑色的眼睛”，不就是為了讓人尋找黑暗嘛~',
			'你看我像不像聖人被釘在十字架上？',
			'你這裏太亮了，我的眼睛有點不舒服。',
			'最近有些人喊我三小姐，你知道這是為什麼嗎？',
			'為了來你這裏就餐，我連身邊的黑暗都減弱了。',
		],
		description: [
			'喜歡黑暗的老友，總覺得她腦子空空的樣子。但不得不説，和我很合得來。無論是第一點還是第二點。',
			'這傢夥總是到處漂盪，我從來都不知道她在做什麼。一段時間沒見，就能從她口中聽到些新鮮的詞彙……她到底是去哪了呢？',
			'相識越久，越覺得自己對她的過去一無所知，就算問她她也只會説不記得了。不過就算如此，我們也依然是好友，永遠都會是好友~',
		],
		evaluation: {
			bad: '是——這樣嗎——',
			exbad: '這就是所謂的黑暗料理嗎？',
			exgood: '在你的料理下，感覺肉都會發光了！',
			good: '很好吃哦！',
			lackmoneyangry: '你的價格就像人類採用了十進制！',
			lackmoneynormal: '就帶了這麼多啦……',
			norm: '挺好吃的哦~',
			repell: '為什麼不讓我吃啦？',
			seenRepell: '你也會像那樣趕我走嗎？',
		},
		name: '露米婭',
		spellCards: {
			negative: [
				{
					description:
						'在廚房裏放出黑霧，讓你無法辨識哪些是廚具，哪些是食櫃，持續20秒消失。',
					name: '暗符「境界線」',
				},
			],
			positive: [
				{
					description:
						'隨機獲得圖鑑中記錄的三種肉類食材(如圖鑑記錄的肉類食材只有兩種，則獲得兩種)。為什麼月光會產生肉，為什麼最愛吃肉的露米婭會把肉送給你，考慮這些會變笨。',
					name: '月符「月光射線」',
				},
			],
		},
	},
	2: {
		chat: [
			'我才不是嘴饞，我只是來監督你的。',
			'你要好好工作，一定要按時把債務完成！',
			'別以為給我做點好吃的就可以放寬貸款哦。',
			'下次要不要把我家的貓咪們也帶過來呢？',
			'吃不下的食物可以打包嗎？我想帶給我家貓咪吃。',
		],
		description: [
			'與其説是凶兆的黑貓，不如説是兇巴巴的黑貓……',
			'老是脱口而出要監視我們什麼的，就那麼怕我們賴賬嗎？明明一直都很準時還債的啊！',
			'我説，這傢夥果然有什麼不可告人的目的吧？總覺得她在拙劣地隱瞞着什麼……不過這孩子性格這麼直，我能感受到她對我是沒有惡意的！所以，不管她是不是真的隱瞞了什麼，我都會對她一如既往的~',
		],
		evaluation: {
			bad: '也就這種程度吧',
			exbad: '這種東西連野貓都不吃！',
			exgood: '好、好好粗！不是！好好吃！！',
			good: '看在這麼好吃的份上，就誇你一下吧！',
			lackmoneyangry: '看來給你的貸款利息確實是太高了……',
			lackmoneynormal: '沒、沒帶夠，下次貸款考慮給你優惠點！',
			norm: '還、還不錯！',
			repell: '走就走！我才不稀罕！',
			seenRepell: '不要放過每一個客人，給我好好賺錢還債啊！',
		},
		name: '橙',
		spellCards: {
			negative: [
				{
					description:
						'讓顧客開始腦內擼貓，變的平和。減少了客人的出現率。',
					name: '方符「奇門遁甲」',
				},
			],
			positive: [
				{
					description:
						'隨機自動獲得三種魚類食材，偶然會出現高級貨。為什麼會產生魚，為什麼最愛吃魚的橙會把魚送給你，考慮這些會讓人變得糾結。',
					name: '仙符「鳳凰卵」',
				},
			],
		},
	},
	3: {
		chat: [
			'沒想到，我居然有朝一日能夠踏進妖怪的餐館裏。',
			'我能來的次數不多，所以我很珍惜這樣的機會。',
			'在這種地方，可以得到許多有趣的情報。',
			'作為稗田家第九代家主，我的責任重大。',
			'如今，幻想鄉緣起到底是為了什麼而繼續寫下去呢……',
		],
		description: [
			'人類村子中的名門望族、編撰《幻想鄉緣起》的稗田家家主，是個了不起的大小姐。',
			'明明是才華橫溢的大小姐，但是身體卻很糟糕。即便拖着這樣的身體，她也偶爾會來店裏做客，真是讓人又驚喜又擔憂啊。',
			'雖然這位大小姐看起來是無可挑剔的優雅，但骨子裏似乎透着一股倔強和任性呢。輪迴轉生嗎……就算這樣，現在的她，也確實是一個小孩子沒錯吧？',
		],
		evaluation: {
			bad: '多謝招待。',
			exbad: '……實在是讓人難以恭維。',
			exgood: '即便是輪迴多世，我也從未吃過如此美味的料理！',
			good: '能夠嘗此美味，今天真是不枉此行。',
			lackmoneyangry: '黑心商家，一定要記下來！',
			lackmoneynormal: '我的傭人沒有隨行，身上帶的錢不夠，請見諒……',
			norm: '多謝款待。',
			repell: '我一定會把你寫到《幻想鄉緣起》裏！',
			seenRepell: '我還以為你會和別的妖怪不一樣……',
		},
		name: '稗田阿求',
		spellCards: {
			negative: [
				{
					description:
						'被阿求曝光一件經營上的糗事，導致店內氣氛一下掉落到冰點。店裏的客人聽到這個也會降低心情。',
					name: '口授「黑心店家的黑心歷史」',
				},
			],
			positive: [
				{
					description:
						'獲得一張名小説家的簽名色紙，可以用來換些特別的東西！',
					name: '撰書「這也全都是妖怪幹的嗎」',
				},
			],
		},
	},
	4: {
		chat: [
			'食物的歷史也是非常久遠的。',
			'總覺得，滿月時的記憶似乎不太完整……',
			'單純的事件是不能稱為歷史的，只有將其記載下來，方為歷史',
			'最近孩子們對課程似乎有點意興闌珊，是不是應該再增加些課程呢？',
			'有時候，料理中承載的不止酸甜苦辣，還有思念。',
		],
		description: [
			'在人類村子開私塾的妖怪。哎呀，總覺得她與其説是妖怪，倒不如説更像是人類呢。',
			'明明是妖怪，卻深受人類的信賴，收集了不少信仰心吧？在村民們的心中，她比巫女更可靠。聽説還在村子裏代理着巫女的工作。',
			'一邊擔憂着人類，一邊擔憂着妖怪，真是偉大啊，所謂賢者就是指這樣的存在吧？她似乎有着另一個形態，一個我應該沒有見過的形態，但卻又隱約覺得自己見過……',
		],
		evaluation: {
			bad: '勤加練習的話一定可以做得更好。',
			exbad: '食之無味，即便棄之也不可惜。',
			exgood: '太美味了！這是沉澱了歷史的技術才能做出來的佳餚！',
			good: '很美味，看來你下了不少功夫。',
			lackmoneyangry: '這個定價恐怕不太適合幻想鄉的居民。',
			lackmoneynormal: '抱歉，下次我會注意點的。',
			norm: '味道不錯，相信你不會止步於此。',
			repell: '如果你是我的學生，我就上頭槌了！',
			seenRepell: '這種行為實在太沒有教養了。',
		},
		name: '上白澤慧音',
		spellCards: {
			negative: [
				{
					description:
						'吃我頭槌噠！被慧音老師的頭槌擊中將會眩暈20秒。上下左右亂打可以快速恢復。',
					name: '國符「秘笈·頭槌」',
				},
			],
			positive: [
				{
					description:
						'三種神器·劍隨機獲得兩種蔬菜。三種神器·鏡接下來的15s內，料理不會消耗任何材料。三種神器·玉打開心靈之鎖，隨機解鎖一名未完全解鎖全部喜好的稀客的一個信息。三種神器·鄉對你的店大加好評的慧音老師使用特報宣傳你的店鋪，吸引了大量居民前來就餐。——三種神器有四件不是常識嗎？',
					name: '國符「三種神器」',
				},
			],
		},
	},
	5: {
		chat: [
			'仙人也不是只吃“霞”的',
			'最近村子似乎成立了動物保護協會，真是一個不錯的組織。',
			'我已經離開太久了，如今的幻想鄉變了太多，我需要好好適應。',
			'唉，一個個傢夥都是要人操心的。',
			'最近巫女的評價還好嗎？我會督促她繼續努力的。',
		],
		description: [
			'一本正經的謎之仙人。總覺得她和一般的仙人哪裏不太一樣……不過我也沒見過別的仙人就是了。',
			'仙人説話都是這樣一板一眼嗎？和她對話有種挨訓的感覺……不過能讓主食霞的仙人來自己的店裏光顧，還是挺有成就感的~',
			'雖然有點囉嗦，但真是個熱心的傢夥，是不是有點像（有點嚴厲的）鄰家姐姐的感覺呢？氣質和一開始相比變了不少，該説是更柔和了嗎？',
		],
		evaluation: {
			bad: '還得再多修煉修煉才行。',
			exbad: '難以下嚥！',
			exgood: '此絕味，竟叫無欲之仙沉淪！',
			good: '味道極佳，值得稱讚！',
			lackmoneyangry: '這種違背常識的定價透露着醜惡的慾望。',
			lackmoneynormal:
				'不小心超過預算了……要不，免費讓你去我那兒修煉作為補償吧。',
			norm: '還不錯！但不能就此自滿哦。',
			repell: '不知腐鼠成滋味，猜意鵷雛竟未休。',
			seenRepell: '驊騮拳跼不能食，蹇驢得志鳴春風！',
		},
		name: '茨木華扇',
		spellCards: {
			negative: [
				{
					description:
						'客人們被仙人強行帶去修行，沒有了世俗的慾望，在30秒內，只會點最便宜的食物和綠茶。',
					name: '「斷惡修善的禁慾考驗」',
				},
			],
			positive: [
				{
					description:
						'因為華扇很滿意你的料理，於是讓自己馴養的老虎表演節目助興，結果你卻得到了打賞…！每隔一定時間，在場排隊和就座的客人，每人隨機打賞1-30元。',
					name: '「猛獸的藝術用法」',
				},
			],
		},
	},
	6: {
		chat: [
			'説到經營，我可是前輩哦……你那是什麼眼神啊！',
			'不能理解的事情就不要去理它，要不然在幻想鄉可活不下去。',
			'首先應當認真思考，並陳述了自己的想法後再問他人。',
			'我不是那種會動粗的人，所以才能好好地活這麼長時間。',
			'你這兒還是太簡陋了，要不要去我店裏選幾個道具，算你便宜哦。',
		],
		description: [
			'自詡為普通的商人，買賣全憑興趣，十分亂來。作為經營者前輩來説，應該是一個很好的反面教材吧？不過，偶爾也能淘到一些有用東西就是了。',
			null,
			null,
		],
		evaluation: {
			bad: '普普通通吧。',
			exbad: '就這種水平也敢開店？',
			exgood: '太好吃了！麻雀難道是料理的天才嗎！？',
			good: '可以啊！居然做得這麼好！',
			lackmoneyangry: '怎麼有人賣東西比我還離譜啊？！',
			lackmoneynormal: '錢不太夠……下次你去我那，我給你打個九九折吧！',
			norm: '偶爾換換口味也不錯呢。',
			repell: '你以後也別想到我的店裏來了！',
			seenRepell: '你有沒有一點身為經營者的自覺啊！？',
		},
		name: '森近霖之助',
		spellCards: {
			negative: [
				{
					description: '已經解鎖的稀客喜好信息，會隨機被隱藏…',
					name: '「虛構的情報」',
				},
			],
			positive: [
				{
					description:
						'獲得一張香霖堂購物7折的打折卡，僅限次日使用，過期作廢。',
					name: '「香霖堂購物節」',
				},
			],
		},
	},
	7: {
		chat: [
			'明明是妖怪開的店，為什麼人比神社都多！？',
			'既然是面向人類經營，衞生方面可要給我好好注意。',
			'今天沒有鬧事的吧？發生什麼要及時告訴我。',
			'看着妖怪和人類共食，身為巫女感覺還是挺微妙的。',
			'這種好像挺賺錢啊，我要不要也開一家店呢？',
		],
		description: [
			'貧窮且兇狠的巫女小姐……讓人懷疑她真的是人類嗎？總之，千萬要小心不要惹她生氣。',
			'靈夢小姐真是一點都不客氣啊……不過，不知不覺也受了她不少照顧呢。開始有點明白為什麼有那麼多妖怪聚集在她身邊了。',
			'所謂刀子嘴豆腐心，説的就是靈夢小姐這樣的人吧。雖然看起來挺沒心沒肺的，但那雙眼睛卻總是能直視前方。博麗的巫女是靈夢小姐真是太好了。',
		],
		evaluation: {
			bad: '也沒比我做的好多少嘛。',
			exbad: '給我吃這種東西是想被退治嗎！？',
			exgood: '這一頓，就算花光所有錢也是值得的！',
			good: '好吃！不枉我特意攢錢來吃！',
			lackmoneyangry: '敢誆我的錢？我看你是想被退治了！！！',
			lackmoneynormal: '你以前參加我家的宴會也沒給錢，總得給我打個折吧。',
			norm: '做得不錯嘛。',
			repell: '可惡，我沒退治你，你居然敢趕我走！？',
			seenRepell: '要是之後被投訴了我可不管。',
		},
		name: '博麗靈夢',
		spellCards: {
			negative: [
				{
					description:
						'發動三色爆炸氣團攻擊你，封印你菜單上的三個料理，在接下來的30秒內，無法製作。',
					name: '靈符「夢想封印」',
				},
			],
			positive: [
				{
					description:
						'發動一次保護結界，可以完全防禦下一個稀客的懲罰符卡。',
					name: '夢符「二重結界」',
				},
			],
		},
	},
	8: {
		chat: [
			'最近宴會次數減少了啊，看來有什麼在悄悄地發生着吧？',
			'你的事我很清楚哦，因為一直看着呢。',
			'解嘲破惑有常言，酒不醉人人自醉。',
			'喝酒就是要在這種熱鬧的地方才有味道嘛。',
			'差不多該覺察到心中的壓力了吧。',
		],
		description: [
			'沒想到現在的幻想鄉居然還有鬼存在，第一次見到的時候真的嚇了一跳！不過……她真的是鬼嗎？',
			'毫無疑問，她就是鬼。雖然平時擺着一副小小的身姿和迷迷糊糊的模樣，但言語間的氣魄，有時會瞬間像一座山一樣壓下來。真不愧是傳説中的山中王者啊。',
			'鬼雖然是很可怕的種族，但是一旦成為朋友，就是最值得信賴的夥伴！萃香小姐雖然總是醉醺醺的，但是心思清明着呢。那種豪情逸致，真讓人嚮往啊。',
		],
		evaluation: {
			bad: '就着酒的話，勉強也可以吃兩口',
			exbad: '佐上這樣的菜餚，真是糟蹋了我的酒！',
			exgood: '沒想到，這世上居然有比酒更讓我垂涎的料理！',
			good: '美酒佳餚，不醉不休！',
			lackmoneyangry: '失望的宴會……',
			lackmoneynormal: '錢不夠了。下次請你喝酒吧！',
			norm: '不錯的下酒菜！',
			repell: '是鬼離開了太久，讓你忘了我的恐怖嗎？',
			seenRepell: '居然在宴席上驅趕客人，真是無趣。',
		},
		name: '伊吹萃香',
		spellCards: {
			negative: [
				{
					description:
						'出現三隻可愛的豆萃香，從你的酒櫃裏偷走三瓶最高級的酒。明明那麼可愛，為什麼做些可恨的事情呢！！？',
					name: '「百萬鬼夜行」',
				},
			],
			positive: [
				{
					description:
						'出現一隻可愛的豆萃香贈送一種酒水給你，偶然會出現超高級貨。為什麼萃香會把自己最愛的酒送給你？因為酒要一起喝更快落。',
					name: '酒吞奧義「鬼進酒」',
				},
			],
		},
	},
	9: {
		chat: [
			'雖然在我看來是個破落的小店，但在地上也算是不錯了吧。',
			'天界那羣老頑固，一點兒都不懂變通！',
			'地上雖然比不上天界的富饒，不過勉強還是能呆一陣子的。',
			'有本天人來光顧的店，那些愚民們一定會爭先恐後地過來吧。',
			'地上稀奇古怪的東西真不少，雖然不入流，倒也挺有趣的。',
		],
		description: [
			'傳説中氣焰囂張、目中無人的不良天人，如果可以的話，真不想招待這樣的客人啊……',
			'我得為之前説過的話道歉，怎麼能對客人生出不想招待的念頭呢？就算她氣焰囂張、目中無人、口無遮攔、毫無常識、鼻子比天高，我都必須要好好招待她！儘量吧……',
			'其實，這傢夥也不是那麼討厭啦。雖然嘴巴是壞了點（是很壞），但説不定……是個相當天真的傢夥呢。似乎在天界過得不是很舒心，如果在地上能讓她好好釋放壓力就好了。',
		],
		evaluation: {
			bad: '哼，就地上人而言，差不多也就這種程度吧。',
			exbad: '鹹若齧檗吞針！',
			exgood: '甚合吾心！沒想到這種貧瘠之地竟能烹飪出此等佳餚！',
			good: '此等美味，就算放在天界也毫不遜色。',
			lackmoneyangry: '哼，吾來汝店，本即無上榮光。',
			lackmoneynormal: '哼，這一頓也就值這麼多！',
			norm: '區區地上人，做得還挺像樣的。',
			repell: '蚍蜉撼大樹，可笑不自量！',
			seenRepell: '斗筲之人，何足算也。',
		},
		name: '比那名居天子',
		spellCards: {
			negative: [
				{
					description:
						'從天而降的要石破壞桌椅，嚇走桌面上的客人，該桌椅在60s內需要修理，期間無法再使用，所以也無法再接待新的客人。',
					name: '「天罰的石柱」',
				},
			],
			positive: [
				{
					description:
						'源自天界的天人釋放的強大能量，能使全部正在就餐的顧客的心情暴漲至85%。',
					name: '「全人類的緋想天」',
				},
			],
		},
	},
	10: {
		chat: [
			'放心吧，我只是喜歡偷……借書，從來不吃霸王餐。',
			'可惡，今天又輸給靈夢那個傢夥了呀！',
			'偶爾像這樣吃一頓也不錯Da☆Ze',
			'這麼多人看着，我不會跑單的啦！',
			'魔法就是光和熱，料理其實也差不多吧。',
		],
		description: [
			'非常開朗健談的人類魔法使，獨自住在人煙罕至的魔法森林裏修行，不管是人類還是妖精、妖怪都能輕鬆與之打成一片。對蘑菇似乎有很深刻的研究！',
			'雖然看起來無所事事，其實也經營着一家“霧雨魔法店”。因為她喜歡收集卻從不整理的性格，這家店常常被誤以為是垃圾回收站。客人可想而知也是沒有的。',
			'雖然性格上有着心術不良的地方，但本性正直，和她一起的感覺很愉快！她從不願讓人看到她努力的樣子，但我們都知道……這個自小就離家修行的小女孩，如果可以更多地依靠別人就好了。',
		],
		evaluation: {
			bad: '一般般吧',
			exbad: '這什麼東西啊，還不如生吞蘑菇呢！',
			exgood: '你是偷偷藏了什麼魔法嗎？居然會有這麼好吃的料理！',
			good: '這個菜，感覺可以成為宴會的主角！',
			lackmoneyangry: '我去借點錢再來吃！',
			lackmoneynormal: '賬我已經付啦。你感覺箱子裏的錢少了？不關我事哦——',
			norm: '味道不錯誒，教教我怎麼做唄~',
			repell: '相信我！我這回真的帶錢了！',
			seenRepell: '這樣不太友好啊——',
		},
		name: '霧雨魔理沙',
		spellCards: {
			negative: [
				{
					description:
						'隨機偷走2樣東西，可能是食材、料理或酒水，損失高級貨時讓人欲哭無淚。而且偷完東西後不付錢直接走人，讀書人偷東西的事，不叫強盜！',
					name: '魔符「拿來吧你」',
				},
			],
			positive: [
				{
					description:
						'隨機自動獲得三種菌類食材，偶然會出現高級貨。為什麼星星會產生菌類，為什麼最愛吃菌類的魔理沙會把菌類送給你，考慮這些會變得不快樂。',
					name: '流星「超級英仙座」',
				},
			],
		},
	},
	15: {
		chat: [
			'我可沒有偷懶哦——雖然確實是偷偷溜出來的。',
			'咲夜小姐的飛刀就像是長了眼睛一樣。',
			'大小姐什麼時候才把那本漫畫的下冊借回來呢？',
			'得趕在被女僕長發現前回去~',
			'飯前飯後都不適宜運動，稍微打個盹就是最合適不過了~',
		],
		description: [
			'沒想到給惡魔之家的看門的妖怪居然是個熱血親切的大姐！可惜愛睡覺，每次想去找她聊聊都看到她在打盹。',
			'美鈴小姐獨自守衞着這麼大的洋館，連個輪班的都沒有，難怪會睡眠不足啦。要是在我力所能及的範圍內，能幫到她一點點忙就好了。',
			'原來美鈴小姐的家鄉在海的另一邊。但是幻想鄉是沒有海的，美鈴小姐是不是已經回不去了？她的家鄉有很多耳熟能詳的名菜，我努力學習做給她吃，或許可以緩解一些她的思鄉之情~',
		],
		evaluation: {
			bad: '能吃飽就行吧……',
			exbad: '太過分！居然拿這種東西來敷衍我！',
			exgood: '能吃到這樣的菜，就算腦袋扎滿刀子也無憾了！',
			good: '不愧是我冒着被刀子扎的風險也要來吃的菜。',
			lackmoneyangry: '區區門衞吃不起你家的菜！',
			lackmoneynormal: '我的工資只剩這麼多了……',
			norm: '唔……還算好吃吧？',
			repell: '老闆娘好無情啊！',
			seenRepell: '老闆娘原來是這樣的……',
		},
		name: '紅美鈴',
		spellCards: {
			negative: [
				{
					description:
						'召喚出暴力熊貓，隨機摧毀一張桌子，如果桌子上有客人會恐懼跑路，降低10點店內氣氛值，而且在90秒內該桌由於修理而無法接待客人。',
					name: '「NOver say no to pOnda」',
				},
			],
			positive: [
				{
					description:
						'吃HIGH了的美鈴開始表演雜耍，接下來的30秒內，每2秒提升1點店內氣氛，且期間稀有客人完成訂單後獲得的好感度提高！',
					name: '華符「芳華絢爛」',
				},
			],
		},
	},
	24: {
		chat: [
			'不老不死只意味着，永不得救贖的孤獨。',
			'炭火不夠的話，儘管來找我！',
			'要是擁有了前往月亮的方法，那家夥會返回月亮嗎……',
			'從不盡的火誕生的，是無論多少次都會復活的不死鳥。',
			'不要隨地亂扔煙蒂啊。',
		],
		description: [
			'隱居在竹林裏的不可思議的人類，慾望極低，對世間追逐的一切都沒有興趣。因為曾經吃了什麼奇怪的東西而成為不老不死之身（不能亂吃東西啊）。',
			'妹紅小姐真是帥氣啊，雖然是人類，卻強到沒邊，性格也很豪邁。據説愛吃辣的人性格都很爽快，妹紅小姐可是無辣不歡呢。',
			'她比我想象中的要心思細膩，過去似乎經歷了很多難以想象的苦難。即便如此，她仍然心存良善，一直暗中幫助別人。這樣的她，一定會獲得幸福的！',
		],
		evaluation: {
			bad: '還得多下點功夫。',
			exbad: '又硬又硌牙，想必比你的肝還要難啃！',
			exgood: '活着……真是太美妙了！',
			good: '在我的漫長人生中，這樣美味的料理也屬罕見。',
			lackmoneyangry: '時代的進化還不及你的定價變化之快！',
			lackmoneynormal: '我過得向來清貧，就只有這麼多錢了……',
			norm: '我覺得你應該能做得更好。',
			repell: '……也罷。我已經習慣了。',
			seenRepell: '己所不欲，勿施於人。',
		},
		name: '藤原妹紅',
		spellCards: {
			negative: [
				{
					description:
						'接下來的30秒，無論提供多好的料理，最高只能獲得客人普通的評價。',
					name: '藤原「滅罪寺院傷」',
				},
			],
			positive: [
				{
					description:
						'妹紅釋放的火焰增加了廚具的功率，20秒內所有廚具的料理速度加快50%。',
					name: '不死「火鳥 鳳翼天翔」',
				},
			],
		},
	},
	25: {
		chat: [
			'不勞者不得食，我是不是也該做點什麼呢？',
			'那五個美麗的難題，能不能解決已經無所謂了。',
			'我不是家裏蹲，只是永琳每次都要囑咐半天所以我才懶得出門。',
			'幻想鄉的雨PH值為6哦，就是幾乎不含酸性的意思。',
			'七色的優曇花很美，七色的料理感覺卻很噁心呢。',
		],
		description: [
			'住在永遠亭的公主殿下，據説來自月亮。放着好好的月之公主不做，跑到幻想鄉來當家裏蹲到底是為什麼呢？',
			'外表看起來是氣質優雅的公主殿下，實際行事卻有些無賴……有點理解為什麼她能成為那隻黑兔子的主人了（黑形容的是心哦）……',
			'原來高貴的公主也會和普通人一樣煩惱工作的事情。輝夜小姐和我也沒什麼不同嘛。作為工作了數載的前輩，我得好好為迷惘的後輩打氣呢！',
		],
		evaluation: {
			bad: '這樣的東西不值得我出門一趟。',
			exbad: '竟敢呈此等穢物來招待我！',
			exgood: '地上有這麼美味的食物，誰還會想回到月亮上呢？',
			good: '饌玉炊金，其味無窮。',
			lackmoneyangry: '地上都是這般坑蒙拐騙嗎！？',
			lackmoneynormal: '唔，月亮和地上的物價可能不太一樣。',
			norm: '地上的食物一直是不錯的。',
			repell: '無禮的地上妖怪！',
			seenRepell: '突然感覺沒什麼興致了。',
		},
		name: '蓬萊山輝夜',
		spellCards: {
			negative: [
				{
					description:
						'減少相當於現實時間30秒的營業時間，到時間時會強行終止營業。',
					name: '神寶「蓬萊的玉枝 夢色之鄉」',
				},
			],
			positive: [
				{
					description: '增加相當於現實時間30秒的營業時間。',
					name: '「永夜歸返 世間開明」',
				},
			],
		},
	},
	27: {
		chat: [
			'生活就是魔法意大利面的結合。',
			'被唸叨得煩了，就姑且出來走走吧。',
			'我的書並沒有亂放，所有的書都在它們自己想呆的位置上。',
			'魔法的力量，其實就是科學那種東西。',
			'烹飪和魔法的結合，或許會很有趣呢。',
		],
		description: [
			'總是穿着睡衣躲在樹蔭下的奇怪的魔法使。似乎不在意別人的眼光，對潮流什麼的也不感興趣。雖然頭腦很好，不過看起來弱不禁風的樣子。比起頭腦好，身體好更重要啊。',
			'帕秋莉小姐總是手不離書，一直盯着書本看眼睛不會累嗎？而且書上説的也不一定都是對的啊，像這樣光讀書不出門，就算知識淵博，常識卻稍微有些不足呢。',
			'師父原來身患貧血癥和哮喘症，真是讓人擔心啊（我只在這裏叫一下應該可以吧？）。雖然認識這麼久，師父對我的態度依然不太親切，但卻教了我不少知識，我可不能辜負她。',
		],
		evaluation: {
			bad: '食不言，寢不語。',
			exbad: '不堪一試！這種水平也敢開店？',
			exgood: '即便博覽羣書，也很難有這等廚技造詣啊。',
			good: '這種沁人心脾的口感到底是怎麼做出來的？',
			lackmoneyangry: '呵呵！麻雀之食貴於玉，薪貴於桂。',
			lackmoneynormal: '咳咳，我有點不舒服，先回去了……',
			norm: '要是能讀點書，應該能做得更好。',
			repell: '人而無禮，胡不遄死！',
			seenRepell: '哼，朽木難雕。',
		},
		name: '帕秋莉',
		spellCards: {
			negative: [
				{
					description:
						'接下來製作的料理，有50%概率會變成黑暗料理，持續30秒。',
					name: '金水符「水銀之毒」',
				},
			],
			positive: [
				{
					description:
						'接下來的30秒內，給客人上含有“文化底藴”標籤的料理，必然獲得最高等級的評價。',
					name: '知識的奇妙冒險「文化之風」',
				},
			],
		},
	},
	28: {
		chat: [
			'本小姐是最強的！',
			'嘿嘿，我的冰可是連飛鳥都能打落哦！',
			'能不能別把我當成隨處可見的普通妖精？',
			'泡菜的話，醃之前就吃掉好了。',
			'中場休息！捉迷藏什麼的吃飽再繼續玩吧~',
		],
		description: [
			'自稱最強的、長着冰之羽翼的妖精，那樣的翅膀也能飛起來真是神奇啊。當然神奇的還有她的腦迴路，老是做一些和大家相反的選擇，總之別太深究她説的話就好了。',
			'雖然是冰之妖精，卻是個熱血的傢夥！説不定她真的是最強的妖精，尤其是那股勇往直前的氣勢，真是見了棺材也不掉淚、撞了南牆也不回頭。了不起了不起！',
			'我發現，和她在一起的時候，會不知不覺就被她的氣勢帶走，這就是領袖的氣質嗎？！不過這種感覺很輕鬆，説不定我們很合拍呢！難道説我也是笨蛋嗎？哈哈開玩笑啦~',
		],
		evaluation: {
			bad: '別以為這樣就能把我打發掉！',
			exbad: '像這種東西，就應該和英吉利牛肉一起被冰凍起來！',
			exgood: '好吃得舌頭都要融化了！',
			good: '好吃！以後就讓你跟着本小姐混吧！',
			lackmoneyangry: '咱！沒！錢！',
			lackmoneynormal: '咱們妖精哪來那麼多錢。',
			norm: '吃飯的時候説話會咬到舌頭。',
			repell: '居然敢把最強的咱趕走——',
			seenRepell: '趕人就不好玩了啊。',
		},
		name: '琪露諾',
		spellCards: {
			negative: [
				{
					description:
						'隨機凍住3隻廚具，如果廚具中有正在製作或完成但還未拿走的料理，則會直接被凍碎，持續30秒。——琪露諾大人是最強的！',
					name: '凍符「完美凍結」',
				},
			],
			positive: [
				{
					description:
						'隨機獲得三種帶有“可加冰”標籤的平價酒水，並且獲得2-5枚冰塊。',
					name: '「甜美的冰霜小妖精」',
				},
			],
		},
	},
	29: {
		chat: [
			'人類光是遇到我，就已經花光所有的運氣了。',
			'沒想到鳥腦袋也能把生意做得這麼有模有樣啊。',
			'哦哦！還挺熱鬧的嘛！一直放任着不管，現在就是“回收”的時候！',
			'你還太嫩了啊。一會兒讓我來教教你什麼是真正的經營之道吧~',
			'遇到我就能變得幸運哦！不過呢，只有幸運的人才能遇到我。',
		],
		description: [
			'突然出現在店裏的妖怪兔，總是壞笑着來找茬，只要她的耳朵出現在視線範圍裏，我的PTSD就犯了。',
			'雖然總是高價強賣我東西，而且還狡猾地打包賣什麼的……但有些東西的確對我來説很有用……',
			'一直讓靈夢小姐退治她也挺可憐的…總之要是經濟寬裕的話，讓她來店裏也不是壞事，聽説能看到她的話，就能獲得一般人想象不到的幸運？',
		],
		evaluation: {
			bad: '還沒兔子們搗的年糕好吃。',
			exbad: '讓我付錢吃這種東西？給我賠錢還差不多！',
			exgood: '這味道到底是怎麼回事……老闆娘！你能發大財！！！',
			good: '小麻雀做得還真不錯啊。也來教教我家的兔子嘛~',
			lackmoneyangry: '我可沒有點這些菜！你自己上的菜自己買單吧。',
			lackmoneynormal: '我就只帶了這麼多，愛要不要吧~',
			norm: '這樣就想讓我掏錢……算了，也還行吧。',
			repell: '臭麻雀……給我走着瞧！',
			seenRepell: '這種無良的店，連敲詐的價值都沒有。',
		},
		name: '因幡帝',
		spellCards: {
			negative: [
				{
					description:
						'明明已經特別“關照”了你，但是果然還是讓你把恐懼刻在DNA裏才可以啊，再一次激活強買強賣功能，讓你嗚呼哀哉。如果膽敢不買，將發動另一張符卡——惡作劇 「Combo消失術」中斷你的Combo，並且在30秒內無法再獲得Combo。',
					name: '想起「那年的素兔的恐怖」',
				},
			],
			positive: [
				{
					description:
						'所有食材採集點的冷卻時間清零，原地復活，並且次日進行採集活動時，可以額外獲得1-2份食材。',
					name: '生機「四十葉草般的幸運」',
				},
			],
		},
	},
	30: {
		chat: [
			'這個世界會提供什麼料理呢？期待期待',
			'這個世界的人不像我們那邊稜角分明呢',
			'這個世界的大家都好可愛，連我都可愛了！',
		],
		description: [
			'MC幻想鄉的板娘，通過“聯動之門”穿越過來的異世界人，同時也擔當駐夜雀食堂的形象大使，不斷邀請着夜雀食堂世界的居民去MC幻想鄉做客，積極地推進着兩邊的生態發展中。',
			null,
			null,
		],
		evaluation: {
			bad: '我遠道而來就為了個這？',
			exbad: '你們就拿這樣的東西招待異世界的旅人嗎？！',
			exgood: '太好吃了！我要介紹給我們世界的每一個人！',
			good: '好吃好吃！不枉我穿越通道來這邊一次呀！',
			lackmoneyangry: '這邊世界流行宰客嗎？',
			lackmoneynormal: '啊，差點預算就被爆破了',
			norm: '挺期待的，但也就那麼回事吧。',
			repell: '嗚嗚，我要找kk投訴你開黑店！',
			seenRepell: '哇——這個世界的老闆娘這麼生猛的嗎！',
		},
		name: '萌澄果',
		spellCards: {},
	},
	31: {
		chat: [
			'桑尼：哈哈哈，今天會用什麼來招待我們呢！',
			'露娜：我們的畫風跟其他人真的不一樣啊…',
			'斯塔：三個人一起坐…説實話有點擠啊…',
			'桑尼：老闆娘！快把最上好的東西端出來吧！',
			'露娜：幸好有帶一些錢…不過大家要省着點花呀',
			'斯塔：真想偷偷的溜進後廚學兩招',
		],
		description: [
			'蹦蹦跳跳的三妖精討伐大作戰中的主角，通過“聯動之門”穿越過來的異世界妖精。因為無盡的好奇心和行動力，在本世界也受到了大家的歡迎，看到她們就感到元氣滿滿。',
			null,
			null,
		],
		evaluation: {
			bad: '拿這東西忽悠妖精你的良心不會痛嗎？',
			exbad: '這玩意兒！狗都不吃！',
			exgood: '好、好吃！HIGH起來了！',
			good: '你加什麼東西呀？！為什麼會這麼好吃！？',
			lackmoneyangry: '宰客啦！老闆娘宰客啦！',
			lackmoneynormal: '差一點就要付不起錢被關在瓶子裏了……',
			norm: '也就那麼回事吧。',
			repell: '哇——這個世界欺負柔弱的妖精！',
			seenRepell: '什麼叫黑心老闆娘啊，我們算是見識了！',
		},
		name: '蹦蹦跳跳的三妖精',
		spellCards: {},
	},
	36: {
		chat: [
			'我的麟是麒麟的麟哦！很厲害吧。',
			'這兒的客人比我們醫館多多了。',
			'今天又因為扎針的時候下手太重被客人投訴了……',
			'竹林那邊的赤腳醫生是從哪裏冒出來的？',
			'我沒什麼耐心，一會兒上菜可別讓我等太久啊！',
		],
		description: [
			'在村子裏的醫館擔任護士的人類，性情直率純粹，在醫護的方面非常細心，對入院治癒後仍不愛惜自己身體的病人恨鐵不成鋼。面對這種病人，她會偷偷在下針的時候加大力度……',
			null,
			null,
		],
		evaluation: {
			bad: '這也沒比藥好吃多少……',
			exbad: '別以為老孃登場少就好欺負啊！',
			exgood: '積攢了一天的疲勞被治癒了！',
			good: '好、好吃！就連妖怪做飯都比我好吃……',
			lackmoneyangry: '胡扯！別以為你亂開價我會搭理你！',
			lackmoneynormal: '我就只有這麼多錢了……',
			norm: '還不錯吧。',
			repell: '趕我走？下次別讓我在醫館看到你！',
			seenRepell: '區別待遇真沒意思。',
		},
		name: '冴月麟',
		spellCards: {
			negative: [
				{
					description:
						'大口吃飯有害身體健康！飯要細嚼慢嚥！包括排隊人物在內的所有客人，用餐時間增加到200%，但此技能效果優先級低於立刻完食類buff。',
					name: '「飯要一口一口吃才健康！」',
				},
			],
			positive: [
				{
					description:
						'在冴月麟的特殊處理下，食物被去除了高熱量等有害要素，客人能夠更健康的攝入營養，同時體味美食的樂趣，包括排隊人物在內的在場所有客人30%增加1次額外續單，每位客人概率獨立計算。通過此種方式增加的額外續單將無視預算上限。',
					name: '「扶我起來，我還能吃」',
				},
			],
		},
	},
	37: {
		chat: [
			'生前好好行善積德，才不會在死後受我凌虐。',
			'善惡到頭終有報。',
			'我殘暴？呵呵，皆是那些幽靈罪有應得。',
			'同情心什麼的根本就不需要。',
			'人類啊，好好珍惜活着的幸福吧。',
		],
		description: [
			'來自八寒地獄的鬼卒，據説鬼卒的工作就是凌辱墮入地獄的罪人，好可怕！無論穿着打扮還是性格都是喧譁派，時常操着不像這個時代的混混的口頭禪，好鬥又好強，不是在打架，就是在找架打的路上。真怕她哪天會憋不住把我的店拆了……',
			null,
			null,
		],
		evaluation: {
			bad: '地上的食物就這種水平嗎？',
			exbad: '你想下地獄嗎！？',
			exgood: '我都想破格把你擄到八寒地獄來做飯呢！',
			good: '地上的食物果然有意思！',
			lackmoneyangry: '敢敲詐我？有本事就來地獄討吧！',
			lackmoneynormal: '憑什麼是你來定價？我説了算！',
			norm: '也就這樣吧。',
			repell: '可惡！你要是將來落在我手上……',
			seenRepell: '哼，地上也一樣是欺善怕惡。',
		},
		name: '立空汐',
		spellCards: {
			negative: [
				{
					description:
						'接下來的120秒內，製作所有含有“清淡”或“素”標籤的料理，最終只能做出黑暗料理。',
					name: '拷問「頞部陀」',
				},
			],
			positive: [
				{
					description:
						'使用空間能力將在場所有就餐客人封閉起來，只要顧客還吃得下並且有能消費得起的料理，就必須消費，直到花費額度至少到達預算的70%上限才會解除，在解除前，客人無法離開桌子，只能繼續點單。持續60秒。',
					name: '「不玩盡興還想走？！」',
				},
			],
		},
	},
	38: {
		chat: [
			'地獄的改革，勢必會引發一場激烈的鬥爭……',
			'今日的執著，會造成明日的後悔。',
			'一切惡法，本是虛妄。',
			'在無盡的未來裏，有無數種可能。',
			'那個妖怪賢者……呵呵，原來如此。',
		],
		description: [
			'新地獄的行政高官，八寒地獄鬼神長，似乎也是新地獄行政和司法方面的高級顧問。這樣的大人物為什麼會到我的店裏來呢……難道我的店在地獄也有很名嗎？',
			null,
			null,
		],
		evaluation: {
			bad: '不進則退，不得則亡。',
			exbad: '痛苦的經驗總是最有力的教訓。',
			exgood: '地上有如此珍饈，讓人幾欲流連忘返。',
			good: '不錯，憑著去時走錯路的經驗，回來時就順利了。',
			lackmoneyangry: '買賣不公者終墮刀鋸地獄。',
			lackmoneynormal: '定價不公也是罪。我只能按規則來付這筆錢。',
			norm: '我所看到的……你的水平不應如此。',
			repell: '即便是幻想鄉也無法接受地獄來客嗎？',
			seenRepell: '任何人都不該被時間輕易抹去。',
		},
		name: '時焉侑',
		spellCards: {
			negative: [
				{
					description:
						'接下來的60秒間，無論上的食譜如何合襯客人的心意，得到的評價都是隨機的一種。',
					name: '律符「顛倒錯亂」',
				},
			],
			positive: [
				{
					description:
						'通過能力，在120秒內辨識客人的剩餘預算與點單次數。',
					name: '因果「推理與判斷之眼」',
				},
			],
		},
	},
	39: {
		chat: [
			'終於可以輕鬆地來光顧了！',
			'之前太失禮了，老闆娘能不計前嫌真是太好了。',
			'唉，侍奉幽幽子大人累得快讓我的骨頭散架了。',
			'老闆娘如果有什麼需要幫忙的，儘管開口！',
			'如果冥界也有一家食堂那我就輕鬆多了。',
		],
		description: [
			'侍奉着冥界之主的庭師兼侍衞、廚師……也就是説，她不僅要一個人照顧兩百由旬的西行寺庭院，還要守衞西行寺家以及主人的安危，同時還要照顧大胃王主人的飲食需求！無論哪一個都是重擔呢，希望她能在夜雀食堂得到一些治癒吧！',
			null,
			null,
		],
		evaluation: {
			bad: '誒——不應該是這個味道吧？',
			exbad: '就算是惡作劇也太過分了！',
			exgood: '啊——這就是我無論如何都無法實現出來的味道嗎！',
			good: '嗚嗚，我要是也能做出這個味道就好了！',
			lackmoneyangry: '爺爺説過，被敲詐的時候要掉頭就走！',
			lackmoneynormal: '對不起！我只能付得起這麼多……',
			norm: '我應該也可以做到這種程度吧？',
			repell: '為、為什麼啊……',
			seenRepell: '被趕走的人也太可憐了……',
		},
		name: '魂魄妖夢',
		spellCards: {
			negative: [
				{
					description:
						'客人耐心衰減速度翻倍，且每2秒減少1點氣氛，持續60秒。',
					name: '天上劍「天人之五衰」',
				},
			],
			positive: [
				{
					description:
						'教授你高超的劍術技巧，在60秒內製作料理台的料理時能瞬間完成。',
					name: '獄界劍「二百由旬之一閃」',
				},
			],
		},
	},
	40: {
		chat: [
			'我對夢裏的味道念念不忘，所以就來了。',
			'唔，麻雀的小碎骨有點太多了……',
			'這家店的老闆娘真的不能吃嗎？好可惜……',
			'不要緊張，把我視為普通客人就好了喲。',
			'進食的時候被這樣警惕地盯着，我會不好意思的哦。',
		],
		description: [
			'差點吞噬了幻想鄉的可怕的傢夥。原以為恢復神志後就會世界和平，結果一見面就想吃了我！？現在偶爾也會到食堂用餐，有時候會看着我咽口水……我這輩子都不想再見到這個亡靈。',
			null,
			null,
		],
		evaluation: {
			bad: '唔，這不是我印象中的味道呢。',
			exbad: '這東西看起來還不如老闆娘好吃——',
			exgood: '這就是那個讓我念念不忘的味道！',
			good: '果然偶爾要出來吃一下外面的美食呢~',
			lackmoneyangry: '哎呀，忘記帶錢了呢~',
			lackmoneynormal: '要結賬了嗎？我看看，這麼多就夠了吧~',
			norm: '和我印象中的味道還差了一點。',
			repell: '我不會把你的店吃垮的啦~',
			seenRepell: '誒？小麻雀真沒勁……',
		},
		name: '西行寺幽幽子',
		spellCards: {
			negative: [
				{
					description:
						'接下來直到營業結束為止，所有的料理不加滿5個檔位的料，都會收到差評。',
					name: '「加料加量不加價」',
				},
			],
			positive: [
				{
					description:
						'接下來直到營業結束為止，客人會瞬間吃下所有的料理。再次觸發時此符卡轉化為「墨染浮櫻化醉蝶」幽幽子釋放1/3/5/8（隨使用次數提升）隻蝴蝶飛向保温箱，每隻蝴蝶吞噬保温箱中存儲的一個料理，轉化為等同於4倍料理價格的金錢（享受小費倍率加成）。',
					name: '「食物瞬間消失術」',
				},
			],
		},
	},
	41: {
		chat: [
			'這裏也是夢境世界嗎？',
			'新的希望之面……不是很想戴呢。',
			'和大家炙熱的情緒戰鬥過後，我學習到了很多。',
			'夜雀食堂……是個很適合收集人氣的場所。',
		],
		description: [
			'同時由六十六個面具組成的付喪神，平時基本上是不苟言笑的樣子，偶爾眼神對上的話還會馬上避開。一開始可能會覺得她性格冷淡，其實她只是習慣了依賴面具，所以無法理解情緒。某種程度來説，她就像嬰兒一樣單純，實際上她在妖怪中也算是剛出生不久啦！現在她正在為了能夠理解情緒而相當努力地修行着，相信她最後一定能露出屬於自己的笑容！',
			null,
			null,
		],
		evaluation: {
			bad: '不太行……這是失望的表情。',
			exbad: '好難吃……這是愠惱的表情。',
			exgood: '太完美了！這是超級滿足的表情。',
			good: '好吃。這是開心的表情。',
			lackmoneyangry: '被坑錢了！這是憤怒的表情。',
			lackmoneynormal: '錢包空了……這是慚愧的表情。',
			norm: '還可以吧。這是平靜的表情。',
			repell: '被趕走了……這是無語的表情。',
			seenRepell: '怎麼可以這樣對待客人？這是訝惱的表情。',
		},
		name: '秦心',
		spellCards: {
			negative: [
				{
					description:
						'秦心演奏暗黑能樂影響全場顧客的情感，使小費率下降到0，持續66s。',
					name: '喪心「七情六慾 解憂」',
				},
			],
			positive: [
				{
					description:
						'場上不存在情緒面具時，召喚當日對應的情緒面具，持續30秒。若場上存在情緒面具，則在30秒內強化情緒面具的效果。',
					name: '華心「喜怒哀樂 變幻」',
				},
			],
		},
	},
	1000: {
		chat: [
			'只有嗅覺敏鋭的商人，才能將商業情報作用發揮到極致。',
			'當你沒有決定要成功時，你就已經決定要失敗了。',
			'船在港灣裏很安全，但這不是造船的目的。',
			'潛在顧客不在乎你。他們在乎自己，對與他們無關的東西他們不願讀也不願聽。',
			'對實業家而言只有一條規則：以儘可能低的成本，做質量最好的產品，付儘可能高的工資。',
			'是不是也應該讓一些河童專門去專研廚藝呢……',
		],
		description: [
			'如果説河童都是些唯利是圖的商人，作為小頭目的她更是其中的佼佼者！雖然説商人趨利也沒什麼好指責的，但是再多一點人情味不是也挺好嗎？',
			'荷取小姐的頭腦真是相當好啊，堪稱是商業和技術的天才！一直以為河童性本趨利，可是她們卻願意在技術上一擲千金，我真是搞不懂她們了……',
			'能夠抓住一切機會、將危機轉化為商機的能力，真是讓我歎為觀止。在她身上學到的一切，值得我用一輩子去消化！',
		],
		evaluation: {
			bad: '胡亂加工不是正數的加法，而是負數的加法。',
			exbad: '這種程度是怎麼讓食堂風靡幻想鄉的？這是廣告欺詐吧！',
			exgood: '我享受到的服務已經超過了交易本身，必須要給予答謝！',
			good: '邀請你到山裏開店真是明斷啊！',
			lackmoneyangry: '這定價與其説是做生意，不如説是搶劫！',
			lackmoneynormal: '雖然我最近賺了些錢，也經不住這樣的高度消費！',
			norm: '食品的加工是非常深奧的，你得多儲備一些知識才行。',
			repell: '這樣做生意是不會長久的。',
			seenRepell: '老闆娘，你還是不明白生意該怎麼做。',
		},
		name: '河城荷取',
		spellCards: {
			negative: [
				{
					description:
						'引發水患，招來洪水，巨大的波浪將會沖走隨機3~5名顧客。',
					name: '水符「山洪暴發」',
				},
			],
			positive: [
				{
					description:
						'接下來的120秒內，夥伴都可以通過“延展手臂”遠程上菜上酒。',
					name: '河童「延展手臂」',
				},
			],
		},
	},
	1001: {
		chat: [
			'今天那局棋真是恰逢敵手啊。這樣才有意思！',
			'即使沒有入侵者，也萬不可掉以輕心。',
			'都説河童是天才，但無論是劍術還是棋術都是我的手下敗將。',
			'組織規模越大，需要的規則越多。',
			'那隻鴉天狗不知道又在打什麼主意……',
		],
		description: [
			'常常在妖怪山上巡邏的白狼天狗，嗅覺、聽覺非常靈敏，被稱為山上的千里眼，能迅速發現入侵者。正因為有這樣的守衞在，我們這種小妖怪平時根本不敢上山。',
			'因為妖怪之山基本沒什麼侵入者，所以守衞的工作非常清閒。夜雀食堂開張以後，她對於工作之餘多了個去處似乎非常高興，面上雖然沒怎麼顯露，但尾巴暴露了心情。',
			'性格原本也算是一板一眼的，熟悉以後經常能聽到她那些毫無城府的牢騷，還時不時能看到她露出乖巧、呆萌的一面。比想象中的好應付啊……早知道這樣，我就早點到山上來了！',
		],
		evaluation: {
			bad: '早知道就只喝酒了。',
			exbad: '壓榨勞動人員的錢包卻只給吃這種東西嗎！？',
			exgood: '不愧是風靡幻想鄉的食堂，多謝款待！',
			good: '美味的食物能把一天的疲勞全部消除！',
			lackmoneyangry: '這定價嚴重違反了山中的秩序！',
			lackmoneynormal: '守衞的工資果然是太低了，連頓飯也差點吃不起……',
			norm: '就着酒吃也還行吧。',
			repell: '我們這種底層天狗就連吃飯也要被瞧不起嗎？',
			seenRepell: '這一點也不利於山中的團結！',
		},
		name: '犬走椛',
		spellCards: {
			negative: [
				{
					description:
						'封鎖前往食堂的道路，禁止任何客人前來，持續30秒。',
					name: '「戒嚴令」',
				},
			],
			positive: [
				{
					description:
						'接下來的120秒內，將會有大量白狼天狗客人上門。',
					name: '「天狗例行小酌」',
				},
			],
		},
	},
	1002: {
		chat: [
			'偶爾是不是也回去一趟比較好呢……',
			'最近人偶損耗得有點厲害，等下回去得好好修補一下。',
			'明天表演什麼人偶劇比較好呢……',
			'這家店開了才知道竟然有這麼多魔法使……',
		],
		description: [
			'住在魔法森林的魔法使，有着金色的頭髮和白皙的皮膚，外貌精緻得就像人偶一樣。據説，她的家裏也盡是些人偶。被她操縱的那些人偶栩栩如生，感覺還……蠻瘮人的。',
			'這些人偶真的是被操縱的嗎？無論是誰見了都會有這樣的疑問。雖然她看起來對別人漠不關心，但是待人接物卻都非常周到，這就是所謂的都市派嗎？',
			'想要走進她的心房真是不容易啊。她矜持而又好客，温柔而又疏離。她之所以製作這麼多人偶，會不會是因為孤獨呢？',
		],
		evaluation: {
			bad: '還不如人偶做的飯……',
			exbad: '明明用魔力就可以不用進食，為什麼還要受這個罪！',
			exgood: '美味得彷彿是只存在於童話世界裏的幻想！',
			good: '就是因為有這種美食，我才一直保持人類的進食習慣~',
			lackmoneyangry: '這是什麼新型騙局嗎？絕對是敲詐吧！？',
			lackmoneynormal: '最近買材料花了不少錢，沒計劃好預算……',
			norm: '還過得去吧。',
			repell: '……我本來也沒打算吃。',
			seenRepell: '吃飯就是圖個氣氛，氣氛不到位食物也會變難吃。',
		},
		name: '愛麗絲',
		spellCards: {
			negative: [
				{
					description:
						'向廚房丟出一枚魔法瓶，炸飛一個廚具，持續60秒。',
					name: '魔符「狡猾的獻祭」',
				},
			],
			positive: [
				{
					description: '愛麗絲的人偶幻化為客人，填充剩餘的全部座位。',
					name: '「和人偶一起玩的孩子」',
				},
			],
		},
	},
	1003: {
		chat: [
			'小看這人世可是會吃苦頭的哦？',
			'血池的恐懼、悲歡、憎惡、怨恨也很美味呢。',
			'我的信條是“坐收漁利”。',
			'剛欲同盟的成員多半都是些各行其是的傢伙。',
			'吃掉這個小麻雀的話，我是不是也能做出這麼美味的食物——',
		],
		description: [
			'畜生界什麼同盟的盟主，傳説中的饕餮的動物靈，是個什麼都能吸收的不得了的大胃王！性格會受吞下的事物的影響，如今似乎有了對美食的追求，偶爾會到店裏來做客……體型和模樣都像個小孩子，希望不會被哪個不怕死的妖怪給小瞧了吧……',
			null,
			null,
		],
		evaluation: {
			bad: '我不是為了這種東西跑到地上來的——！',
			exbad: '血池的恐懼、悲歡、憎惡、怨恨，你也想感受一下嗎！？',
			exgood: '只有這種舌尖上的享受，才配得上我無限的胃袋！',
			good: '一直以來小瞧地上了，這一趟來得值！',
			lackmoneyangry: '連我錢都想訛？先看看你有沒有這個本事！',
			lackmoneynormal: '這家飯店不講理的程度和畜生界有得一拼。',
			norm: '和黑水的味道差不多吧。',
			repell: '真以為我不會對你下手？',
			seenRepell: '地上和畜生界也沒什麼不同，無趣。',
		},
		name: '饕餮尤魔',
		spellCards: {
			negative: [
				{
					description:
						'暴走的尤魔將會吞噬掉隨機3~5個食材、1~3個酒水，並吞噬1個廚具，使該廚具當晚無法使用。血池地獄挑戰中，會額外恢復5%的HP。',
					name: '「剛欲獸神饕餮的晚餐」',
				},
			],
			positive: [
				{
					description:
						'所有尤魔以外的客人都只會點最貴的食物與酒水，且這些訂單不消耗預算，持續30秒。',
					name: '「饕餮的饕餮之宴」',
				},
			],
		},
	},
	1004: {
		chat: [
			'人間煙火氣，最撫凡人心。',
			'滿肚子的食物，人才不會空虛。',
			'酸甜苦辣都是滋味，每頓飯都值得被用心對待。',
			'四方食事，不過一碗人間煙火。',
			'本來無東西，何處有南北。',
		],
		description: [
			'原本是安置在魔法之森的地藏石像，因為森林的魔力而得到了生命——森林裏居然藴藏着能夠將存在本身進行變化的魔力，難怪有那麼多魔法使住在這，這對修行來説也太便利了！',
			'還以為地藏像會更穩重一點，結果也就是剛認識的時候會擺個架子，稍微見多幾次面就把話匣子全打開了嘛。是個直率的女孩呢。',
			'好不容易成為了擁有自我的生命體，結果還是個家裏蹲，這不是很可惜嗎！？我一定要想辦法讓這傢伙提起幹勁！',
		],
		evaluation: {
			bad: '這不會是用臭水溝炒的菜吧？',
			exbad: '蹩腳的人和難吃的菜一樣，看到就想吐。',
			exgood: '好滿足！五藴皆空不如五臟俱飽~',
			good: '難得出一趟門，總算沒有白跑一趟！',
			lackmoneyangry: '跟地藏要錢也太難看了，這一頓就當做是你的佈施吧。',
			lackmoneynormal: '不夠的錢等我下次化緣回來再補上吧。',
			norm: '這菜適合生存，不適合生活。',
			repell: '我不是來化緣的，我帶了錢！',
			seenRepell: '是法平等無有高下。',
		},
		name: '矢田寺成美',
		spellCards: {
			negative: [
				{
					description:
						'業火燒掉隨機的三個Buff紙張，其帶來的效果也會隨之失效。',
					name: '地藏「業火救濟」',
				},
			],
			positive: [
				{
					description:
						'接下來的60秒內，客人在結賬時，額外會支付50%的小費作為化緣。',
					name: '魔符「即席菩提」',
				},
			],
		},
	},
	1005: {
		chat: [
			'總覺得河童們最近是不是興奮得有些異常……',
			'現在的我，應該能被幻想鄉的大家記住了吧？',
			'我要讓守矢之名響徹幻想鄉！',
			'那兩位大人都是好事卻不愛湊熱鬧的人呢。',
			'雖説吃宵夜會長胖……不過我今天走了很多地方，應該沒問題！',
		],
		description: [
			'數年前與守矢神社一起突如其來的巫女。據説來自外界，與她一起來的還有兩位神明……以及一座湖。這件事實在太離奇了，直到現在都感覺怪嚇人的。',
			'和喜歡宅在屋裏喝茶的博麗巫女不同，早苗小姐非常勤奮，隨處都能看到她在努力收集信仰的身影。以人類之身來收集信仰真是了不起啊，似乎是什麼現人神呢。',
			'博麗神社在幻想鄉有着特殊的、絕對的地位，無論是守矢神社還是早苗小姐，想超越博麗之名都很艱難。不過，在早苗小姐的兢兢業業下，現在大家都記住了守矢巫女之名，真是太好了！',
		],
		evaluation: {
			bad: '這種程度的東西是無法凝聚人心的。',
			exbad: '用這種東西招待信徒只會讓信仰心下降！',
			exgood: '就連我都忍不住想去信仰你了！',
			good: '美味的食物果然可以收集信仰！',
			lackmoneyangry: '再怎麼非常識，這頓飯也太貴了吧！',
			lackmoneynormal: '幻想鄉的消費水平比外面世界還高啊……',
			norm: '想用這個來收集信仰的話，還需要再精進一些吧。',
			repell: '欸？欸欸欸！？',
			seenRepell: '這種待客態度是無法凝聚信仰的。',
		},
		name: '東風谷早苗',
		spellCards: {
			negative: [
				{
					description:
						'早苗釋放五芒星，使你陷入封印狀態，接下來的30秒內無法獲得buff。',
					name: '奇迹「白晝新星」',
				},
			],
			positive: [
				{
					description: '引發奇迹之力，生成三個酒水和三個食材。',
					name: '神德「五穀豐穰米之浴」',
				},
			],
		},
	},
	2000: {
		chat: [
			'被地上厭惡的地底世界，是我們的天堂。',
			'洞窟雖然是黑暗的，但是我的網很明亮哦。',
			'最近街道那邊好熱鬧呀，偶爾去玩玩吧~',
			'只有抵住最黑的暗，才能收穫最光的亮。',
		],
		description: [
			'在黑暗的風穴遇到的親切的指路人。因為知道自己惹人討厭所以幾乎不會到村裏去，明明那麼可愛……真希望地上的大家也能認識她呢！',
			'山女小姐原來是類似地底偶像一樣的存在呢！不愧是她。不過，與她那可愛的性格相對的是，她的愛好似乎異於常人……',
			'雖然一直被誤會乃至成為“被厭惡者”，山女小姐也並不在意。我能感覺到，她確實深愛着這個地底世界。能有這樣豁達的心境，真是了不起的境界啊。',
		],
		evaluation: {
			bad: '我不是想打擊你，但是味道確實不太好……',
			exbad: '還不如蛛網裏的獵物好吃。',
			exgood: '能在黑暗的洞窟吃到這麼美味的食物真是太棒了！',
			good: '氛圍和食物都是滿分哦~',
			lackmoneyangry: '這家店比黑蜘蛛還要黑！',
			lackmoneynormal: '我還不太習慣地上的消費水平……',
			norm: '傳説中的夜雀食堂應該不止這種程度……',
			repell: '就算我們什麼都沒做也會遭到厭惡嗎？',
			seenRepell: '瞧不起被厭惡者就別在這裏開店了。',
		},
		name: '黑谷山女',
		spellCards: {
			negative: [
				{
					description:
						'被山女的蛛網纏住了！移動速度將會下降80%，持續30秒。',
					name: '細索「犍陀多繩索」',
				},
			],
			positive: [
				{
					description:
						'接下來的30秒內，排隊客人會被偶像吸引，即使本日營業結束也不會離去。',
					name: '「地下偶像狂歡夜」',
				},
			],
		},
	},
	2001: {
		chat: [
			'你站在橋上看風景，看風景的人在樓上看你。',
			'所有人看起來都這麼幸福，我好嫉妒啊——',
			'橋從此端通往彼端的連繫，被寓意着從現世通往彼世的路途。',
			'為什麼隔壁的菜看起來那麼美味，我好嫉妒啊——',
			'Line',
		],
		description: [
			'原本以為她是個親切開朗的妖怪，結果一轉身就看到她在背地裏説我壞話……以嫉妒為食的妖怪，不煽動別人的嫉妒心就會活不下去嗎？感覺很可憐吶。不過她似乎不這麼覺得。性格也陰晴不定，真是難以理解。',
			'橋姬既是橋的妖怪，也是橋的守護神。帕露西小姐其實在日復一日地守望着他人平安地從地上世界與地下世界往來……這麼説來，她也是個很偉大的妖怪呢。',
			'我發現，帕露西小姐熟知所有人的優點！雖然大家都説帕露西小姐很善妒，但她的內心深處其實很憧憬大家吧？能夠更進一步瞭解她真是太好了！',
		],
		evaluation: {
			bad: '隔壁桌的菜絕對比我的好吃！',
			exbad: '這麼稀巴爛的廚藝是怎麼開店的？',
			exgood: '美味得讓我一時間甚至連嫉妒都忘了——',
			good: '這般治癒人心的美味，真是讓人嫉妒啊——',
			lackmoneyangry: '我要把這個黑店釘在樹上！',
			lackmoneynormal: '大家的口袋就那麼富裕嗎？',
			norm: '總覺得別人碗裏的更香……',
			repell: '居然趕走我而不去趕走別的客人，好嫉妒啊——',
			seenRepell: '居然趕走別的客人而不來趕走我，好嫉妒啊——',
		},
		name: '水橋帕露西',
		spellCards: {
			negative: [
				{
					description:
						'符卡一旦發動，夥伴內心會對你賺錢卻不分給她們強烈的嫉妒，當夜結算時收取翻倍佣金。',
					name: '恨符「丑時參拜」',
				},
			],
			positive: [
				{
					description:
						'帕露西煽動所有在座客人的嫉妒心，將所有在座的客人的預算拉到與在座最富客人同等的水準。',
					name: '「嫉妒與透支」',
				},
			],
		},
	},
	2002: {
		chat: [
			'一個兩個都往地上鑽，地上真的那麼有趣嗎？',
			'酒就是越熱鬧才越好喝。',
			'酒杯就不必了，我的酒器是隨身攜帶的。',
			'真熱鬧啊，比嗓門的話沒有人能比得過鬼。',
		],
		description: [
			'很久以前就離開了幻想鄉、有着大姐頭氣魄的鬼，性格剛毅且乾脆利落。如今在管理着舊地獄街道上的温泉。偶爾去泡一泡温泉吧！',
			'原來勇儀小姐曾經是山中四天王之一。傳聞説她有異常程度的怪力，腕力即便在鬼之中也幾乎無可匹敵。沒想到我也能結識到這麼厲害的妖怪……果然還是有點緊張啊。',
			'本來以為鬼已經對人類失去興趣……但勇儀小姐其實在偷偷羨慕着在地上自由往來的同伴的身影。既然對地上感興趣，那就去地上玩吧！鬼就該是這樣嘛！',
		],
		evaluation: {
			bad: '這菜的味道有點配不上我的酒啊。',
			exbad: '這樣的料理簡直是糟蹋我的酒！',
			exgood: '好馬配好鞍，好酒配好菜！',
			good: '温泉後的飽餐時光足以治癒人心。',
			lackmoneyangry: '敢宰鬼的黑店也是第一次見。',
			lackmoneynormal: '鑽錢眼子可不太好啊——',
			norm: '有好酒相送，菜隨便吃吃就行了。',
			repell: '膽子真不小啊——',
			seenRepell: '無趣之舉。',
		},
		name: '星熊勇儀',
		spellCards: {
			negative: [
				{
					description:
						'勇儀生成三重警戒圈，限制你的移動，持續60秒。三步必殺·第一重：安全範圍；三步必殺·第二重·罪人之枷：移動速度下降50%，直到離開範圍；三步必殺·第三重·怪力亂神：進入該範圍將被立即擊暈30秒。',
					name: '四天王奧義「三步必殺」',
				},
			],
			positive: [
				{
					description:
						'使用星熊杯將一定數量的酒水升級成更高一級的酒水。100%升級3杯1級酒水；75%升級2杯2級酒水；50%升級1杯3級酒水。',
					name: '「接着奏樂接着舞」',
				},
			],
		},
	},
	2003: {
		chat: [
			'距離太遠的話，就讀不到了……',
			'趕緊吃完回去工作吧。',
			'好不容易擠出一些時間，也該犒勞一下自己。',
			'美食不僅是味覺感受，更是一種精神享受。',
		],
		description: [
			'傳説中能夠讀心的覺妖怪，名字也是覺。大概是對自己的種族或能力很自豪吧？因為日以繼夜都在工作，所以沒什麼搭話的機會……',
			'覺小姐真是我見過最操勞的領主了。雖然有寵物們幫忙幹雜活，但是行政方面的工作似乎只有她能做。為了工作似乎放棄了很多日常愛好，唯獨不能放棄讀心。累到虛脱可不好啊。',
			'我明白為什麼寵物們那麼依戀覺小姐了。被繁重的工作埋沒，心中還能一直牽掛着妹妹和寵物。在清冷的外表下的這份温柔，確實是會讓人念念不忘呢。',
		],
		evaluation: {
			bad: '難得過來一趟，有些失望。',
			exbad: '這一頓比工作積攢的精神壓力更大。',
			exgood: '真可謂層層疊疊，色香味齊全啊！',
			good: '阿燐的眼光向來不錯。',
			lackmoneyangry: '我很清楚成本是多少。',
			lackmoneynormal: '抱歉，把零花錢分給寵物後沒剩多少了……',
			norm: '吃食只是為了支撐自己不會倒下。',
			repell: '不是説要為我準備健康料理嗎？',
			seenRepell: '一個人的禮貌是一面照出它肖像的鏡子。',
		},
		name: '古明地覺',
		spellCards: {
			negative: [
				{
					description:
						'隨機發動一名已解鎖稀客（不包括覺自己）的懲罰符卡。',
					name: '想起「不高興的事情」',
				},
			],
			positive: [
				{
					description:
						'隨機發動一名已解鎖稀客（不包括覺自己）的獎勵符卡。',
					name: '想起「高興的事情」',
				},
			],
		},
	},
	2004: {
		chat: [
			'以阿空的性格來説，要時時刻刻盯着核熔爐的火力，真是難為她了。',
			'今天送來的怨靈有點多啊。',
			'下次叫上覺大人一起來吧。',
			'覺大人有好好吃飯嗎……',
		],
		description: [
			'被稱作火車的貓妖，是地靈殿之主的左右手。能夠和屍體和怨靈對話似乎很方便！不過……説到火車就是偷屍體啊。就是因為這樣所以被厭惡吧？唔唔，對別人的興趣説三道四似乎不太好……',
			'仔細想想，人類剛死掉的時候，應該會茫然吧？如果能在猝然長辭之際遇到開朗善談的阿燐，或許能中和一些對死亡的恐懼。',
			'活在偏見下的“凶兆的黑貓”，原來要經歷那麼艱辛的事。偏見真是不可取啊。幸好阿燐遇到了覺小姐。一個好的主人可以改變寵物的一生。希望阿燐今後可以一直過着無憂無慮地偷屍體的生活~。',
		],
		evaluation: {
			bad: '是我看走眼了嗎……',
			exbad: '還不如吃腐肉呢，呸呸！',
			exgood: '美味到即便是厭食症也會化身饕餮的程度！',
			good: '這樣的好東西真是吃一次少一次啊！',
			lackmoneyangry: '你都強買強賣，就別怪咱吃霸王餐了！',
			lackmoneynormal: '最近手頭有點緊……',
			norm: '這種程度真的能讓覺大人提起食慾嗎……',
			repell: '大姐，你太傷咱的心了。',
			seenRepell: '驕傲自滿可是會招來損失的。',
		},
		name: '火焰貓燐',
		spellCards: {
			negative: [
				{
					description:
						'阿燐在離去時，將會在原先的座位上留下一隻地底怨靈，繼續以阿燐的興趣愛好點單，地底怨靈無法被主動驅趕，也不會付款，只有按照正常流程進行滿足才會消失。',
					name: '「死灰復燃」',
				},
			],
			positive: [
				{
					description:
						'接下來的30秒內，給客人上含有“中酒精”標籤的酒水，必然獲得最高等級的評價。',
					name: '貓符「貓醉步」',
				},
			],
		},
	},
	2005: {
		chat: [
			'等待美食出爐的時間是快樂的~',
			'享受美食的時間是最快樂的~',
			'天要下雨，菜要下飯。',
			'腦子裏裝不下的東西，就用肚子來裝。',
		],
		description: [
			'看守灼熱地獄遺址的地獄鴉，有着火焰般熱烈爽快的性格。外表看起來和其他地獄鴉不太一樣，唯獨腦袋空空這一點讓我感到很親切。',
			'阿空的外表之所以大放異彩，原來是因為她的體內寄宿了神靈八咫烏！自地獄的黑暗誕生而來的地獄鴉，與棲息於太陽的八咫烏，真是奇妙的組合啊！不過……讓她擁有這麼強大的力量真的沒問題嗎？',
			'最近突然覺得，沒有比阿空更適合擁有這種力量的人選了。擁有異常強大的力量，卻沒有使用這種力量的頭腦，這就是一種幸運吧？腦袋空空的阿空很可愛哦！不過我也常被説腦袋空空呢~',
		],
		evaluation: {
			bad: '火熱程度太低了。',
			exbad: '還不如讓我扔到灼熱地獄烤一烤。',
			exgood: '我得到了比灼熱地獄還要熱烈的感受！',
			good: '這一頓很火熱啊！',
			lackmoneyangry: '假裝忘記帶錢吧……反正我是鳥腦袋嘛。',
			lackmoneynormal: '鳥腦袋只能裝這麼多錢啦。',
			norm: '多謝老闆娘招待~',
			repell: '當心我把你烤了哦！',
			seenRepell: '幹嘛要把人趕走啊……',
		},
		name: '靈烏路空',
		spellCards: {
			negative: [
				{
					description:
						'下一次沒有成功完美演唱的料理，會使該廚具將發生核燃炸燬，當晚無法使用，排隊的一部分客人也會被嚇得抱頭鼠竄。',
					name: '獄光「擴散地獄火」',
				},
			],
			positive: [
				{
					description:
						'接下來的60秒內，煮鍋與蒸鍋核功率過載，能瞬間完成料理。',
					name: '「地獄的託卡馬克裝置」',
				},
			],
		},
	},
	2006: {
		chat: [
			'貪吃不胖，美夢不空~',
			'只要填飽肚子就不會感到空虛啦！',
			'怪誕評審好酷——啊呀！那不就是我嘛！',
			'等啊等——會等來什麼呢——',
		],
		description: [
			'地靈殿之主的妹妹，封閉了第三隻眼的覺！由於封閉了內心所以存在感也變得很低，神秘的身影讓她在地底收穫了許多追崇者。總是掛着燦爛的笑容，但誰也無法知道她真正的內心是怎麼想的。就連她自己也不知道。',
			null,
			null,
		],
		evaluation: {
			bad: '明明肚子空空卻不想吃呢。',
			exbad: '把小麻雀裝飾在家裏一定很好看~',
			exgood: '這麼棒的老闆娘裝飾在家裏一定很好看！',
			good: '姐姐説肚子吃得鼓鼓的就表示吃飽了！',
			lackmoneyangry: '為什麼吃飯要付錢啊？',
			lackmoneynormal: '我就隨便帶了點錢，你都拿去好了~',
			norm: '吃飽啦——',
			repell: '怎麼啦怎麼啦？是沒看到我嗎？',
			seenRepell: '戀戀喜歡熱鬧啦！',
		},
		name: '古明地戀',
		spellCards: {
			negative: [
				{
					description:
						'接下來的60秒內，普客點單全部變成被戀戀遮住的盲單，需要通過查詢圖鑑喜好來完成。',
					name: '「自我極意無意識」',
				},
			],
			positive: [
				{
					description:
						'接下來的60秒內，顧客點單、吃飯、店員操作等所有需要冷卻時間的動作，全部無冷卻、無意識發動，達到理論速度的極限。',
					name: '「自在極意無意識」',
				},
			],
		},
	},
	3000: {
		chat: [
			'我又來了！嚇~一跳了嗎？',
			'這裏變得更熱鬧了！好開心啊——！',
			'伺機尋找目標……好！一會兒就嚇那個傢伙吧！',
			'今天又沒有嚇到人……',
		],
		description: [
			'寄宿在怪異唐傘上的靈，因為一直沒有人使用，不知不覺就付喪神化了。是個只要見到別人被嚇了一跳，就會快樂得手舞足蹈的傢伙。',
			'這傢伙的性格好麻煩啊！本來以為是個開朗親切的妖怪，結果動不動就哭鼻子……我拿這種傢伙最沒辦法啦！好在她總是很快就能振作起來！',
			'儘管偶爾會露出悲觀的一面，但她內心深處卻是個爽朗堅毅的妖怪。雖然總是遭遇挫折，卻總是花樣層出地努力着呢。這份能量，希望我也可以擁有！',
		],
		evaluation: {
			bad: '無法帶來一點驚喜。',
			exbad: '難吃到嚇我一跳。',
			exgood: '驚——！好吃到嚇人！',
			good: '好吃到嚇我一跳！',
			lackmoneyangry: '我沒有錢哦！嚇到了吧——！？',
			lackmoneynormal: '這些錢都是小孩子們給我的……',
			norm: '還不錯，就是少了點驚喜。',
			repell: '哭……我真是太沒用了……',
			seenRepell: '我能理解這種被嫌棄的感覺。',
		},
		name: '多多良小傘',
		spellCards: {
			negative: [
				{
					description:
						'小傘讓傘妖變大出現在排隊區驚嚇排隊人員，所有排隊中的普通客人被嚇跑。',
					name: '「超極巨幻影唐傘」',
				},
			],
			positive: [
				{
					description:
						'接下來30秒內，帶有“獵奇”標籤的食物製作速度提高30%且額外提供30%續單率。',
					name: '雨符「雨夜怪談」',
				},
			],
		},
	},
	3001: {
		chat: [
			'那個倒黴死神發現自己的船漏水了嗎？',
			'白天大家都那麼剋制了，晚上大鬧一場也可以吧？',
			'我也很羨慕今朝有酒今朝醉的生活啊——',
			'吃飽了還得載那個傢伙去魔界……',
		],
		description: [
			'居然讓醉心於讓船沉沒的妖怪來擔任聖輦船的船長，命蓮寺真是從裏到外都讓人無法理解。這傢伙能在任何水面引發水難事故，以後得更加注意廚房積水！',
			'雖然拜入佛門已經有千年之久，卻還是一點佛門弟子的自覺都沒有。過去在海上胡作非為慣了，至今仍瞞着住持到處惡作劇。不過對命蓮寺不利的事，她是絕對不會做的。',
			'恣性灑脱的船長，甘願成為佛門弟子，受佛門管束(其實也不太管得住)，只為報答千年前的恩情。果然不能以貌取人呀。村紗小姐她，有着一顆有情有義的金子般的心呢。',
		],
		evaluation: {
			bad: '也就和船上的備用食物差不多。',
			exbad: '比船上的備用食物還要難吃！',
			exgood: '你做的料理散發着和聖輦船一樣的光輝！',
			good: '不錯喲！我的船正缺一位你這樣的廚娘。',
			lackmoneyangry: '錢太沉了，我的船載不動吶——',
			lackmoneynormal: '地上的生活成本比海上高多了。',
			norm: '我也不是什麼挑食的人。',
			repell: '我一定要把你從船上扔下去！',
			seenRepell: '真遺憾，我就是衝着熱鬧來的啊——',
		},
		name: '村紗水蜜',
		spellCards: {
			negative: [
				{
					description:
						'腳底引發漩渦潮旋，造成昏厥，5秒無法行動(可通過上下左右搖桿減少時間)，之後的20秒間，上下左右移動方向相反。',
					name: '溺符「深海漩渦」',
				},
			],
			positive: [
				{
					description:
						'獲得 「船幽靈附身」 狀態，持續15秒，擁有此狀態時所獲得的其他獎勵符卡（不包括此符卡），都將延長有效時間，延長的長度等於獲得新符卡時、本符卡的剩餘時間。',
					name: '「船靈流連不散」',
				},
			],
		},
	},
	3002: {
		chat: [
			'你聽説過幽靈食堂的都市傳説嗎？',
			'最近的人類是不是都缺根筋？',
			'孤獨才是享受美食的最好狀態。',
			'好不容易找到的容身之處，我絕不離開。',
		],
		description: [
			'古老的真相不明的妖怪——鵺。長得和傳説完全不一樣真可惜……雖然也是命蓮寺的弟子，但總是見到她獨自在寺院附近無所事事地遊蕩，似乎不太合羣的樣子。',
			'她就像是被忽視、通過惡作劇來吸引大家注意力的彆扭的孩子。內心希望融入寺中，卻笨拙地不知道該怎麼表達……明明活了這麼久，還是不諳世故呢。',
			'越是在意就越容易畏縮……結果她的內心就和她的形象一樣無法被人看清，這難道就是“無法名狀之物”的寂寞嗎？但她如今已經展露出自己的真相，大家以後也一定會慢慢理解她的率真的！',
		],
		evaluation: {
			bad: '馬馬虎虎吧。',
			exbad: '這種東西不值得我展露真相。',
			exgood: '展露真相就是為了品嚐這樣的美味！',
			good: '這就是美食的真相嗎！？',
			lackmoneyangry: '平安時代的強盜都沒有你猖獗！',
			lackmoneynormal: '自平安時代攢下來的錢已經快見底了……',
			norm: '看來你還沒有挖掘出美食的真相。',
			repell: '反正我也獨來獨往慣了。',
			seenRepell: '我就是為了感受一下熱鬧才來的。',
		},
		name: '封獸鵺',
		spellCards: {
			negative: [
				{
					description:
						'開動飛碟轉盤，必然Miss，結果為以下四種情況的一個：紅紅綠：接下來的15秒，無論上什麼菜都必然獲得極度不滿的評價;綠綠〇：接下來的15秒，食材與酒水消耗量提高到3倍;藍藍〇：接下來的15秒，收入減少66%;紅紅藍：同時獲得以上三種Buff。',
					name: '噁心「東方紅紅藍」',
				},
			],
			positive: [
				{
					description:
						'開動飛碟轉盤，必然中獎，結果為以下四種情況的一個：紅紅紅：接下來的15秒，無論上什麼菜都必然獲得最高等級的評價;綠綠綠：接下來的15秒，食材和酒水不會被消耗;藍藍藍：接下來的15秒，收入提高100%;紅綠藍：同時獲得以上三種Buff。',
					name: '開心「東方紅綠藍」',
				},
			],
		},
	},
	3003: {
		chat: [
			'平淡無奇的鍋碗瓢盆裏，盛滿了人類的一生。',
			'若能讓吾把這個盤子摔了，店裏的生意會更上一層樓。',
			'後廚的火力夠嗎？需要吾幫忙添一把火嗎？',
			'與火為伴的廚子生活説不定挺適合吾……',
		],
		description: [
			'通過長時間自己詛咒自己從而沉眠的古代人。大概是睡了太久，思考方式也跟古時候一樣，與普通人完全脱節……目前在努力學習現代知識，結果來説變得更加不倫不類了。',
			'如果不提她那套落伍的作風，其實她也蠻有仙人那種風格，尤其對風水什麼的似乎很有研究。我是搞不懂啦……要不下次裝修的時候請她幫忙看看好了。',
			'無法完全割捨過去，就説明對過去還留有懷念吧？儘管這樣，布都小姐還是毅然決然地成為尸解仙的實驗品。我雖然無法理解人類的這份忠心，但也感到非常敬佩！',
		],
		evaluation: {
			bad: '只能算是無功無過吧。',
			exbad: '火候把握不好的話就讓吾來助汝燒一把吧！',
			exgood: '國之宴席也莫過於此！',
			good: '口腹之慾都要被勾起來了！',
			lackmoneyangry: '貴店的物價恐怕連國庫都能掏空。',
			lackmoneynormal: '差點就在眾目睽睽下吃霸王餐了！',
			norm: '多謝款待。',
			repell: '小人無節，棄本逐末！',
			seenRepell: '禮者，人道之極也。',
		},
		name: '物部布都',
		spellCards: {
			negative: [
				{
					description:
						'本符卡發動的30秒內，只能使用1個托盤進行服務。被禁用托盤內的還未拿走的物品會被焚燬。',
					name: '傳薪「浴火捏盤」',
				},
			],
			positive: [
				{
					description:
						'符卡觸發後的10秒內，根據客人評價獲得酒水獎勵:「普通」評價獲得1級酒水;「滿意」評價獲得2級酒水;「完美」評價獲得3級酒水。',
					name: '聖童女「太陽神的貢品」',
				},
			],
		},
	},
	3004: {
		chat: [
			'小麻雀離煙火氣有點太近了呢……',
			'我可愛的部下們受你關照了喲~',
			'四方食事，不過一碗人間煙火。',
			'想吃仙人的妖怪不少，給仙人做飯的還是第一次見呢。',
		],
		description: [
			'經常見到她在神廟附近晃盪嬉玩的樣子，似乎對修行不太熱心……但又十分熱衷於向別人傳達修道的好處。實在搞不明白她到底在想什麼。是個看起來很正統，行為和思想卻很另類的仙人。',
			'想要做成一件事就會不計後果地去達成，就算自己的行為不被人理解，她也會擺出一副理所當然的態度。要説她是被慾望驅使，又覺得恰恰相反……她所做的那些事，與其説是為了慾望，或許只是單純的性格使然。',
			'邪仙不一定就是邪惡的仙人。僅僅由於思考和行動都不夠妥當就被斷絕天人之路，確實是讓我有些費解……我只知道青娥小姐非常有個性！如果成為天人就要泯滅個性，那我希望青娥小姐還是一直保持這個樣子比較好。',
		],
		evaluation: {
			bad: '是我看走眼了嗎？',
			exbad: '要不是走火入魔怎麼可能會來吃這種東西！',
			exgood: '努力活着才能吃到這樣的美味呢~',
			good: '美食當前還嚷嚷着辟穀就太不解風情了~',
			lackmoneyangry: '我像是身上有很重銅臭味的人嗎？',
			lackmoneynormal: '小麻雀也挺會宰客的呢~',
			norm: '還要再加把勁哦~',
			repell: '你可要想清楚喲……',
			seenRepell: '是我看走眼了嗎？',
		},
		name: '霍青娥',
		spellCards: {
			negative: [
				{
					description:
						'接下來30秒，稀客進入走火入魔狀態，每次結賬，無論評價高低，都有30%概率放一次懲罰符卡。如果本來就放懲罰符卡的情況，則多放一次。',
					name: '入魔「走火入魔」',
				},
			],
			positive: [
				{
					description:
						'30秒內夥伴在食堂區域移動時可以穿過客人或障礙物。',
					name: '邪術「天下無牆」',
				},
			],
		},
	},
	3005: {
		chat: [
			'三餐正常，四餐滿意。',
			'美食和風景，可以抵抗全世界所有的悲傷和迷惘。',
			'死了以後就什麼都不用擔心了。',
			'遇酒且呵呵，人生能幾何!',
		],
		description: [
			'古代人的亡靈。過去似乎懷有很深的怨恨，所以性質上是妖怪們最害怕的怨靈。有點不太敢接觸她呢……',
			'實際接觸後，發現屠自古小姐的性格確實是直爽又豁達，還充滿活力。一點也不像是怨靈呢。大概是怨恨已經消散得差不多了吧？能讓心胸豁達的屠自古小姐變成怨靈，一定是相當痛苦的事情……',
			'沒想到沒想到，讓屠自古小姐變成怨靈的元兇竟然是布都小姐！可她們兩人的感情還是很要好的樣子！？屠自古小姐的心胸何止是豁達的程度，她大概離成佛只有一步之遙了。',
		],
		evaluation: {
			bad: '還不如我自己瞎折騰弄得好吃。',
			exbad: '拿糟糠來糊弄我嗎！？',
			exgood: '有此美食作伴就算千年孤獨也不在話下！',
			good: '這般美味比仇恨更讓人惦記。',
			lackmoneyangry:
				'什麼黑店！太子大人給的家用竟然堪堪支付一頓飯錢！？',
			lackmoneynormal: '我的錢和我的怨恨都消散得差不多了。',
			norm: '聊勝於無。',
			repell: '你就不怕我怨恨你嗎？',
			seenRepell: '麻雀老闆的心眼也太小了……',
		},
		name: '蘇我屠自古',
		spellCards: {
			negative: [
				{
					description:
						'下一次沒有成功完美演唱的料理，將會引來天雷，擊暈一個夥伴30秒。',
					name: '天罰「天雷暴擊」',
				},
			],
			positive: [
				{
					description:
						'藉助電光的加持，30秒內自己和夥伴的移動速度提升30%！',
					name: '雷影「電光石火」',
				},
			],
		},
	},
	3009: {
		chat: [
			'葉子變的錢非常便利哦~',
			'這種傳統與現代交融的風格頗合老朽心意。',
			'老朽還年輕着吶——',
			'那邊的……嚯嚯嚯，這麼拙劣的變身可騙不了老朽。',
		],
		description: [
			'妖怪狸的首領，有着相應的威嚴和領導風範，擅長變幻術。不過再如何擅長變幻的妖獸，想要完全藏起尾巴和耳朵都是不可能的。另外尾巴的大小其實是妖力的計量表，或許她從最初開始就沒有藏起自己尾巴的打算。',
			null,
			null,
		],
		evaluation: {
			bad: '有點讓老朽失望啊——',
			exbad: '竟敢戲弄老朽？讓你見識什麼是真正的惡作劇！',
			exgood: '這是值得狸貓來報恩的一頓款待吶！',
			good: '嚯嚯嚯——不愧是老朽寄望的妖獸——',
			lackmoneyangry: '老朽沒有用葉子結賬就已經很講義氣了！！！',
			lackmoneynormal: '葉子老朽倒是有很多，錢就只有這些了。',
			norm: '只有這種程度嗎？',
			repell: '現在的妖怪怎麼連敬老的美德都忘了——',
			seenRepell: '還是回去和狸貓們喝酒更有趣~',
		},
		name: '二巖猯藏',
		spellCards: {
			negative: [
				{
					description:
						'接下來的30秒內，收到的都是葉子變成的錢幣，晚間結算時才會發現，這期間獲得的金錢全部不會成為收入。用葉子付錢的行為真是太可惡了！',
					name: '「懲罰無良商家的最好辦法」',
				},
			],
			positive: [
				{
					description:
						'召喚若干狸貓，變化成所有就座客人的樣子（不包括猯藏本人），並且重新加入到排隊隊列中。狸貓變化的客人，喜好與預算和變化對象無異，但所有狸貓變化成的稀有客人整晚只能釋放一次變化對象的符卡。',
					name: '「魔卡小狸十般變化」',
				},
			],
		},
	},
	4000: {
		chat: [
			'今天的素材也不太能用呢……',
			'想要獲得情報就要深入羣眾。',
			'勞逸結合才是長久之道喲~',
			'新聞和做菜一樣，加點料更香~',
		],
		description: [
			'每天在幻想鄉各處奔走，收集題材來寫成新聞的鴉天狗。也是大名鼎鼎的《文文。新聞》的作者。之所以説大名鼎鼎，並不是這個報紙有多出色，而是派發得實在太多了……',
			'本來就很強的她，再加上有新聞這種強力的武器，導致文文小姐在幻想鄉裏經常不被待見。不過看着如此拼命工作的她，感覺也會受到鼓舞呢。如果她的新聞能少些胡扯就好了。',
			'報紙真的是非常偉大的東西！文文小姐創作的報刊，記錄了幻想鄉的過去，雖然稍微有些失真的地方……但也還是有值得回憶的地方！希望文文小姐最終能夠找到適合她的新聞風格。',
		],
		evaluation: {
			bad: '喂喂，做成這樣沒關係嗎……',
			exbad: '爛到這種程度也足夠上頭條了！',
			exgood: '這個菜絕對能成為頭條！',
			good: '這個菜有成為爆款的潛力呢。',
			lackmoneyangry: '感謝我沒有報導這種漫天要價的行為吧！',
			lackmoneynormal: '自費做了太多報紙，差點連夜宵也吃不起。',
			norm: '作為新聞素材的話感覺無波無瀾呢~',
			repell: '喂喂！？不怕我報導出去嗎？',
			seenRepell: '把客人都趕走我還怎麼打探情報？',
		},
		name: '射命丸文',
		spellCards: {
			negative: [
				{
					description:
						'引發猛烈的暴風席捲食堂，接下來30秒內無法進行投擲上菜。同時在報紙上對黑心店鋪進行抨擊，使明星店加成明天起消失。',
					name: '「筆槍紙彈禁制之道」',
				},
			],
			positive: [
				{
					description:
						'使用報紙大肆宣傳店鋪，明天開始店鋪變為“明星店”，3天后恢復正常。“明星店”：提高10%客人預算與5%客流量,“招牌”標籤成為流行標籤。若店鋪已是明星店或當晚已宣傳，則此符卡轉化為「食堂風起廚神無雙」成品帶有“招牌”標籤的今日菜單上的料理將成為明星料理。製作明星料理時若料理時間小於5秒則瞬間完成；在輿論的裹挾下，追捧“流行·喜愛”標籤的客人食用明星料理後額外提高30%續單率，返還當單酒水消耗的預算，並100%增加1次續單上限（增加續單上限效果每桌客人只觸發一次），持續30秒。',
					name: '「八衢潮流風靡幻想」',
				},
			],
		},
	},
	4001: {
		chat: [
			'孤獨是毒也是藥。',
			'毒取少量即為藥。',
			'飲酒過量可是對身體的毒喲。',
			'向日葵要是也有毒就好了。',
		],
		description: [
			'獨居在劇毒的鈴蘭田野的付喪神，因為才出生不久，所以經驗和知識都嚴重地不足，也不懂得該怎麼與人相處。總在偌大的鈴蘭田野裏自言自語甚至手舞足蹈的樣子，可愛中透着一些詭異……性格倒是直來直往。',
			'雖然成為了妖怪，但身體似乎還是人偶的樣子。所以就算體內充盈了毒也不會感到任何不適。對人類的友好度很低，以前還會在食物裏下毒來操縱人類……因為太年輕下手不懂得區分輕重，在她的心志成長起來以前，一定要特別注意！',
			'誰能想到毒人偶其實是這麼單純的孩子呢？你教給她什麼，她就會吸收什麼。看着新生妖怪一點、點地成長起來原來是這種感覺！因為我自己也很年輕，所以很少有作為前輩的經歷。現在我想為這個孩子保駕護航，讓她幸福地成長……雖然我可能還沒有她強。',
		],
		evaluation: {
			bad: '鈴鈴不太喜歡這種味道。',
			exbad: '完全無法和鈴鈴的毒相比！',
			exgood: '這是除了毒以外能讓我感受到的最大滿足！',
			good: '我和鈴鈴一致好評！',
			lackmoneyangry: '鈴鈴説你們就是黑店！',
			lackmoneynormal: '我和鈴鈴好不容易攢下來的錢快見底了……',
			norm: '所謂料理也沒有比毒藥出彩很多嘛。',
			repell: '我要讓這雙驅趕我的手爛掉！',
			seenRepell: '鈴鈴説她突然沒什麼興致了。',
		},
		name: '梅蒂欣',
		spellCards: {
			negative: [
				{
					description:
						'移除 「劇毒中和」 狀態；製作料理時鈴鈴會額外為料理追加特殊的“憂鬱之毒”標籤，食用帶有該標籤的食物的客人不會續單，持續30秒。',
					name: '鈴蘭「凋零花園」',
				},
			],
			positive: [
				{
					description:
						'移除 「凋零花園」 狀態；梅蒂欣操縱料理中可能存在的有害元素，使料理時的標籤不再產生衝突，持續30秒，並立即獲得帶有“中酒精”標籤的酒水1瓶。',
					name: '分解「劇毒中和」',
				},
			],
		},
	},
	4002: {
		chat: [
			'我對無聊的戰鬥不感興趣。',
			'花兒們看起來也很高興。',
			'這裏從來沒有過這樣的氛圍。',
			'花間有酒，獨酌何礙。',
		],
		description: [
			'雖然看起來是一副高雅的淑女形象，但不知道為什麼，很多人將她視作“花之暴君”。雖然恐怖的傳説滿天飛，但大家其實都沒有見過她欺負人類或者弱小妖怪。真實的她，究竟是一位怎樣的人呢？',
			'只要見過她照顧花兒的樣子，那些有關她的謠言就會不攻自破。但我還是不明白，她有那麼強大的妖力，為什麼會容忍謠言滿天飛，為什麼要默默地承受那些惡意中傷呢？',
			'大錯特錯！她從來都沒有“忍受”過那些謠言，因為她根本就不在乎。於是連澄清都變得多此一舉。幽香小姐最為強大之處，正是她的心。我想，並不是強大的妖力讓她睥睨眾人，真正讓她立於不敗之地的，是她純粹又乾淨的自我。',
		],
		evaluation: {
			bad: '如此相待，最隨和的花兒也不會願盛開。',
			exbad: '呵——！我接受你的挑釁——！',
			exgood: '你擁有的是讓心花皆綻放的能力！',
			good: '心情就像緩緩打開的花蕾一樣呢。',
			lackmoneyangry: '我沒有留下一記魔炮你就該感恩戴德了。',
			lackmoneynormal: '漫天要價是無法延續生意的。',
			norm: '這樣是無法獲得花兒的青睞的。',
			repell: null,
			seenRepell: null,
		},
		name: '風見幽香',
		spellCards: {
			negative: [
				{
					description:
						'用微笑的表情走到自己所在座位那一排的最上方，然後一發魔炮將這排所有的桌子轟飛，當夜不可修復，並嚇跑所有在這些位置用餐的客人。',
					name: '「決鬥Spark!!!!」',
				},
			],
			positive: [
				{
					description:
						'在場上種下一朵鮮花並利用能力使其生長，滿心情時額外種下一朵，每朵生長的鮮花每24s生產25小費。幽香以外的稀客釋放獎勵符卡時，隨機一朵生長的鮮花將吸收符卡之力而盛放，吸引當地出沒的稀有客人造訪食堂，被鮮花吸引來的稀有客人會摘走這朵鮮花。鮮花盛放期間客人用餐結束後額外提高15心情，15秒後鮮花凋謝，獲得1層 「落英綴裳」 ：可以抵擋一次中斷Combo的失誤。',
					name: '「花鳥風月羣芳沐」',
				},
			],
		},
	},
	4003: {
		chat: [
			'温温吞吞永遠都無法革命成功。',
			'弱小的妖怪們，和我一起站起來吧！',
			'總有一天我會把你收入麾下。',
			'依戀“家的味道”也太軟弱了！',
		],
		description: [
			'擅長花言巧語的天邪鬼。打着要顛倒幻想鄉的口號，蠱惑了許多年輕氣盛的妖怪甚至人類來當手下，但卻因為資金不足無法善待他們，甚至找天狗刊登廣告騙遊客來收取過路費……無論怎麼看，都是個亂來的傢伙。',
			'正邪小姐真的想下克上嗎？感覺她對造反成功之後的事情並沒什麼興趣。或許她只是從與社會作對中汲取樂趣，並不是真的想改變這個社會。',
			'看着同伴一個接一個地離開，一般人多少都會覺得此路不通吧？但是正邪小姐完全沒有想過放棄。在如今人人都悠閒地過着普通日子的幻想鄉中，她是少有的不達目的絕不罷休的那一類。從某種程度來説，還蠻讓我敬佩的……',
		],
		evaluation: {
			bad: '軟弱的味道。',
			exbad: '我要顛倒正是這種將糟糠奉為美食的世界！',
			exgood: '力量滿滿！此刻的我無論什麼都能將其顛倒！',
			good: '力量源源不絕！這就是美食的威力嗎？',
			lackmoneyangry: '小費就當做是你孝敬的保護費了！',
			lackmoneynormal: '靠開食堂來斂財真是絕妙的主意啊。',
			norm: '“一般”顛倒過來還是“一般”。',
			repell: '你以為這是誰的地盤！？？',
			seenRepell: '弱小妖怪什麼時候才可以不被欺壓！？',
		},
		name: '鬼人正邪',
		spellCards: {
			negative: [
				{
					description:
						'下克上的階級反轉時間！將自身的預算與全場最高預算水平的客人預算翻轉，並在接下來的15秒內持續將自己以外的全場所有客人的預算降低到全場最低預算客人水平。',
					name: '逆轉「顛倒世界」',
				},
			],
			positive: [
				{
					description:
						'發動令事物翻轉程度的能力，顛倒客人的喜好，令全場自身以外客人的厭惡標籤反轉為喜好標籤，持續30秒。當場上包括排隊客人在內的普通客人數量之和不少於7時，此符卡轉化為逆弓「天壤夢弓的詔敕」使場上包括排隊客人在內的普通客人額外獲得1次續單上限與25%預算，每位普通客人最多可以受到此效果影響3次。',
					name: '欺符「超限效應」',
				},
			],
		},
	},
	4004: {
		chat: [
			'來這裏就可以聽到好故事嗎？',
			'輝針城從來沒有這麼熱鬧過……',
			'她應該也常來這裏吧？',
			'謝謝你給這座寂寞的城帶來塵囂。',
		],
		description: [
			'非常崇拜一寸法師的小人族的城主，性格剋制認真，是一個有着英雄夢的勇者廚。嚮往冒險的深閨公主還真是新鮮呢。擅長和果子這一點和氣質很相襯！',
			'明明很嚮往勇者的冒險，也做了非常多的準備，但是卻遲遲沒有踏上旅程。對於能否留下完美的傳説這件事非常在意。會不會有些在意過頭了……',
			'終於解開心結的針妙丸小姐勇敢地踏上了道路，而那些“憑著一股勇氣就可以拯救世界”的故事就是她的精神道標。從她身上我也明白到，太在意結果就會寸步難行，果然還是隨心而動比較適合我！',
		],
		evaluation: {
			bad: '就算是作為路上的充飢之物都不夠格呀。',
			exbad: '這道菜難吃得能侵蝕內心的勇氣！',
			exgood: '這道菜讓我充滿了踏上旅程的勇氣！',
			good: '這道菜給我的體驗就像讀勇者故事一樣！',
			lackmoneyangry: '雖然是貴族，卻是破敗了的……',
			lackmoneynormal: '小人族閉關太久，外面的物價已經這麼高了嗎？',
			norm: '勉強能在路上作充飢之物吧。',
			repell: '你竟然驅趕未來的勇者大人！？',
			seenRepell: '身為勇者，我不能容許這種事發生。',
		},
		name: '少名針妙丸',
		spellCards: {
			negative: [
				{
					description:
						'在萬寶槌釋放的魔力的影響下，身體將會被放大到原先的三倍，持續30秒。',
					name: '小槌「你給我變大吧！」',
				},
			],
			positive: [
				{
					description:
						'使用萬寶槌敲擊收銀台，疊加1層 「萬寶槌之力」 。萬寶槌充盈的魔力將在營業結束時使營業額膨脹，第1層 「萬寶槌之力」使收入提高7%，之後每層使收入提高2%。',
					name: '寶槌「通貨膨脹危機」',
				},
			],
		},
	},
	4005: {
		chat: [
			'太晚睡對皮膚不好……',
			'節食減肥絕對不是美麗之道。',
			'大晚上的感覺也好熱呀……',
			'是不是應該把頭髮也剪一下呢……',
			'老闆娘辛苦了~',
		],
		description: [
			'穩重温婉的狼女，給人一種親切的鄰家大姐姐的感覺。不知是不是因為月人在竹林裏住下的緣故，那裏與月亮相關的妖怪似乎很多，影狼小姐也是其中一員。',
			'影狼小姐似乎很在意皮膚，這麼愛美的狼人還真是第一次見呢。草根妖怪的日常真是平和又熱鬧。偶爾忍不住也會想……如果我不開店，大概也在過着這樣的生活吧。',
			'影狼小姐作為狼的部分，是在外面世界已經絕種的本州狼。一度被敬仰、被崇拜，最後卻落得滅絕下場真可憐。幻想鄉的人類和妖怪要多多愛護我們獸(禽)類呀！',
		],
		evaluation: {
			bad: '看來老闆娘的廚藝也不是很穩定嘛。',
			exbad: '這樣的料理感受不到任何善意。',
			exgood: '老闆娘做的菜才是真正的圓滿！',
			good: '我能品嚐出料理裏的善意哦！',
			lackmoneyangry: '掉下來的毛如果能變成錢就好了。',
			lackmoneynormal: '宵夜還真是一不小心就會吃過量……',
			norm: '在我心裏你應該能做得更好。',
			repell: '草根妖怪也是有尊嚴的！',
			seenRepell: '為什麼不能和平相處呢？',
		},
		name: '今泉影狼',
		spellCards: {
			negative: [
				{
					description:
						'接下來的30秒內，所有客人的料理如果沒有添加“飽腹”標籤，會觸發最差評價，同時原本厭惡“飽腹”標籤的客人，則必然觸發最差評價。',
					name: '餓狼「暴食的月下舞踏」',
				},
			],
			positive: [
				{
					description:
						'喚醒客人內心深處原始的野性，使他們在接下來30秒內愛上“肉”與“山珍”標籤，在對料理評分時作為自身的喜好進行評價，原本喜好這些標籤的客人食用相關料理時必然觸發最高評價。',
					name: '狼魂「野性覺醒」',
				},
			],
		},
	},
	4008: {
		chat: [
			'芙蘭那孩子的精力真是用不盡啊……',
			'一會也帶點回去給芙蘭嚐嚐吧。',
			'這家店的命運説不定已經悄悄地改變了。',
			'和我們家的女僕比起來還差得遠呢。',
		],
		description: [
			'紅魔館的主人。遠遠看去還以為是個幼童，走近卻被她的氣勢壓得不敢説話，不愧是響徹一方的吸血鬼領主！但任性起來真的和小孩子很像……雖然她還不太成熟，但她背負着許多人的命運。明明是那麼小小的肩膀，卻把一大家子全都庇護在自己的羽翼下，還真有點一家之主的感覺。蕾米小姐，也不完全像大家認為的那樣以自我為中心呢。',
			'簡介',
			'簡介',
		],
		evaluation: {
			bad: '我一開始就沒有對你抱有任何期待。',
			exbad: '做出這樣的東西，果然應該用神槍刺穿你吧？',
			exgood: '只有這樣的美味才能夠配得上吸血鬼的尊貴身份！',
			good: '這次真的不錯呢，總算值得一點期待了。',
			lackmoneyangry: '咲夜只給我準備了這麼多錢！',
			lackmoneynormal: '我還不習慣自己帶錢出門……',
			norm: '和我們家的女僕比起來還差得遠呢。',
			repell: '哼。看來我是太縱容你了啊——',
			seenRepell: '還是回家吃咲夜做的吧。',
		},
		name: '蕾米莉亞',
		spellCards: {
			negative: [
				{
					description:
						'蕾米莉亞展現自己的威嚴，釋放血霧覆蓋左下角的訂單區域，持續60秒。',
					name: '夜符「紅霧異變再臨」',
				},
			],
			positive: [
				{
					description:
						'蕾米莉亞以紅魔之主的名義在午夜時刻召開盛宴，本日結束時使食堂進入 「紅色不夜城」 狀態（若已結束則立即觸發），持續至營業結束。「紅色不夜城」：普通客人的預算不會低於500；夥伴的工作速度提高100%，如果是咲夜則將工作速度提高至極限；客人的續單率提高100%；發動時如果蕾米莉亞本人此時依然在場，則接下來60秒內不會閉店，並以300%的速率繼續刷新普通客人。否則在場上的最後一位稀客離開時，依照當晚觸發的獎勵符卡數量召喚對應數量的妖精女僕前來。',
					name: '紅符「紅色不夜城」',
				},
			],
		},
	},
	5000: {
		chat: [
			'今天也好累啊——',
			'忙碌的一天終於結束了！',
			'現在是犒賞自己的時間！',
			'肌肉好痠痛——',
		],
		description: [
			'似乎因為我來自地上，所以對我很親切的月之使者，和永遠亭的鈴仙小姐有着一樣的名字。偶爾會表現出對地上的嚮往，不知道是不是過去發生了什麼……也可能是因為月之使者的訓練太辛苦了吧。',
			'原來鈴仙曾經是一隻搗藥兔，因為厭煩無休止的搗藥逃到幻想鄉而發生了許多事，所以才成為一名月之使者。難怪她會對地上表現出眷戀。不過她似乎也不喜歡月之使者的工作，感覺她從內到外都過得好辛苦啊……',
			'一直活在後悔中是一種怎樣的心情呢？如果時間可以重來，她就不會從搗藥的工作中逃走了嗎？那樣她就會感到幸福嗎？這些問題我都沒能問出口……不過，與其徘徊在過去，還是向前看比較好吧？希望她有朝一日能得到真正的自由。',
		],
		evaluation: {
			bad: '今天也是就這樣過去了嗎……',
			exbad: '真是糟糕的一天……',
			exgood: '這就是我的光！！！',
			good: '謝謝老闆娘治癒了我這一天的疲憊！',
			lackmoneyangry: '就算把我賣了我也付不起呀！',
			lackmoneynormal: '打工的錢快花完了……',
			norm: '謝謝，我恢復力氣了。',
			repell: '這就是屬於我的命運吧。',
			seenRepell: '這個世道到處都是不公的對待。',
		},
		name: '鈴仙',
		spellCards: {
			negative: [
				{
					description:
						'鈴仙向場上打出一顆狂氣之彈，持續影響場上的客人，狂氣持續30秒。受到狂氣影響的客人食用高酒精以外的飲料必定給出最低評價。批註：狂氣與狂氣之間會發生干涉…是什麼意思？',
					name: '「酒醉迷亂」',
				},
			],
			positive: [
				{
					description:
						'召開一場盛大的篝火盛宴，場上每隻存在的兔子生成1個隨機食材或1瓶隨機酒水，接下來30秒內出現新的兔子時會同樣生成食材或酒水。生成食材的概率為80%，生成酒水的概率為20%。',
					name: '「月兔的篝火盛宴」',
				},
			],
		},
	},
	5001: {
		chat: [
			'偶爾也要吃吃桃子以外的呢。',
			'吃喜歡的東西，過可愛的人生。',
			'今天的第五頓飯啓動！',
			'吃貨最高境界就是眼見為食。',
		],
		description: [
			'綿月家的姐姐。性格和藹温柔，偶爾會露出孩子氣的一面。除了偶爾會在月之使者訓練時給兔子們帶小點心，幾乎沒有參與月之使者的訓練，因此很受月兔的喜愛。',
			'豐姬小姐真是相當——相當喜歡桃子，以及相當——相當優哉遊哉。像她這麼強大的人，真的可以這樣什麼都不用操心嗎？無論在什麼環境下都能活得這麼天真，這應該也算是一種能力吧？',
			'原來豐姬小姐心裏也有想要完成的事呢。她是從什麼時候開始產生想要隱退的想法呢？或許從一開始，她就只是被迫繼承月之使者首領的工作吧。至今沒有隱退，一來是沒有合適的繼任者，二來……恐怕還是為了依姬小姐吧？',
		],
		evaluation: {
			bad: '還是去吃桃子好了。',
			exbad: '要不是為了不浪費食物……',
			exgood: '好吃到我想在店裏住下來了喲！',
			good: '好吃！還想吃更多更多——',
			lackmoneyangry: '我不是已經把桃子留下了嗎？',
			lackmoneynormal: '太計較錢財會失了風度喲。',
			norm: '不浪費食物是我的底線。',
			repell: '小麻雀太壞了——',
			seenRepell: '不可以欺負人喲，小麻雀。',
		},
		name: '綿月豐姬',
		spellCards: {
			negative: [
				{
					description:
						'豐姬從當地出沒稀客以及當晚邀請稀客中隨機選擇3個還未出現的角色，使她們“神隱”，今晚無法前來夜雀食堂。',
					name: '晦朔「天地未形」',
				},
			],
			positive: [
				{
					description:
						'豐姬連接海與山，鏈接幻想鄉的一個地點，使該區域的普通客人與稀有客人可以穿越“面”前來。通過豐姬的能力鏈接的地區刷新效果分別獨立，刷新速率為原先的33%。',
					name: '方圓「山海千重」',
				},
			],
		},
	},
	5002: {
		chat: [
			'這時候來冥想一下吧。',
			'等餐時順便做一下明天的訓練計劃吧。',
			'吃完後再做做運動吧。',
			'沒想到有這麼多人有吃夜宵的習慣。',
		],
		description: [
			'綿月家的妹妹。個性認真嚴謹，，擔負着兔子們的戰鬥、學習、禮法的訓練——幾乎包攬了月之使者首領該做的所有活兒。雖然實際上幾乎沒有戰鬥，但對待訓練卻很嚴格，兔子們要是偷懶就會被嚴厲懲罰。',
			'因為性格太過於一板一眼，對待訓練又十分嚴厲，兔子們都不太親近她。和清閒自在的姐姐相反，依姬小姐似乎一直處於無法放鬆的狀態，可能聰明人總是容易想太多……',
			'依姬小姐繼承了師父的意志，想要為月之都做出貢獻，所以她才時刻保持着危機感。嚴格操練士兵，也是不希望她們在戰爭中死去。將所有一切背負下來的依姬小姐，真是堅強又温柔啊……',
		],
		evaluation: {
			bad: '……40分。',
			exbad: '0分！',
			exgood: '這個值得滿分！',
			good: '不錯，可以有90分。',
			lackmoneyangry: '我不可能放任你在月都胡來！',
			lackmoneynormal: '這定價……明天來談一談吧。',
			norm: '60分。',
			repell: '我可以理解為這是你下的戰書嗎？',
			seenRepell: '軍隊不能出現不公。',
		},
		name: '綿月依姬',
		spellCards: {
			negative: [
				{
					description:
						'依姬引發神蹟將部分傳説封印，接下來30秒內，帶有“傳説”標籤的料理或使用帶有“傳説”標籤的食材製作的料理無法被製作。',
					name: '誡罰「諸神聖裁」',
				},
			],
			positive: [
				{
					description:
						'依姬召喚神靈，附加一層「神耀桂冠」，如果本次提供的料理帶有“傳説”標籤，則額外附加一層。當稀有客人產生不為完美的評價時，消耗一層「神耀桂冠」引發神蹟，將評價提升至完美。',
					name: '神詔「眾神諭使」',
				},
			],
		},
	},
	5003: {
		chat: [
			'蘇格拉底也要多吃點哦♡～',
			'魔界也有這樣的店真是太好了♡',
			'有沒有我能幫得上忙的地方呢？',
			'耐心等待就好～',
		],
		description: [
			'勤勞、善良熱情的小女孩，開着一家“蓬松松愛蓮”魔法店，還養了一隻叫做蘇格拉底的、個性有點酷的貓。',
			'只要遇到需要幫助的人，愛蓮小姐就會盡十二分努力去幫助，是個非常友好的魔法使！愛蓮小姐對工作也一直保持着相當的熱忱，每次和她對話感覺自己也變得活力滿滿了。',
			'明明外表和個性看起來都很年幼，卻是個已經活了幾千年的大魔法使，真是完全看不出來！活得久的妖怪我也見了不少，但活了那麼久還能保持這份純真浪漫與善良的，愛蓮小姐真是獨一人！',
		],
		evaluation: {
			bad: '唔，辛苦了……',
			exbad: '工作需要再用心一些……',
			exgood: '好吃得蘇格拉底都變得亮晶晶了！',
			good: '我和蘇格拉底都很滿意哦！',
			lackmoneyangry: '對不起，我會更努力地工作賺錢的……',
			lackmoneynormal: '得更努力工作賺錢才行了……',
			norm: '多謝老闆娘款待！',
			repell: '不能帶蘇格拉底進來嗎？',
			seenRepell: '對待客人要一視同仁。',
		},
		name: '愛蓮',
		spellCards: {
			negative: [
				{
					description:
						'蘇格拉底威嚇場上的夥伴，使他們移動速度下降30%，工作速度下降50%，持續30秒。',
					name: '「烏撒的貓咪」',
				},
			],
			positive: [
				{
					description:
						'接下來30秒內，當完成場上客人的訂單且至少獲得普通評價後，在座位附近掉落一枚蓬松松糖果以供拾取。',
					name: '「戀愛的糖果屋」',
				},
			],
		},
	},
	5004: {
		chat: [
			'這組實驗數據還需要再驗證……',
			'回過神來已經幾天沒吃飯了啊。',
			'稍微吃點再繼續實驗吧。',
			'等待的時間繼續剛剛的計算吧。',
		],
		description: [
			'獨自在魔界進行着（危險？）研究的……學者？自稱是神靈，但被大家視為惡靈或邪靈。不管怎麼樣，能感受到她紮紮實實的強大和自信，她到底是怎樣的存在呢？',
			'魅魔小姐竟然誕生源自那個霧雨家的魔法實驗，真是太讓人驚訝了！不過，就算有着這樣的淵源，信念堅定的魅魔小姐也絕不會受任何人所有或支配。追求和探索真理是魅魔小姐一生的目標，就算因此和霧雨家決裂、打了上百年的仗也不曾改變過本心。',
			'原來魅魔小姐就是魔理沙小姐的師父！我早就應該想到的，她們倆真的有很多共同點！無論是追求知識的執著和專注這點，還是道德感方面……以及，從來不會展現自己軟弱和脆弱的一面……表面看起來完全不同的，這兩個孤獨又堅定的人，過去會是什麼樣子的呢？',
		],
		evaluation: {
			bad: '就像外行人做內行事一般讓人感到焦躁。',
			exbad: '就像在知識寶庫上輕浮蹦迪一般讓人憤怒。',
			exgood: '就像邂逅了未解之謎一般令人陶醉！',
			good: '就像終於尋得了公式得出理想結果一般令人振奮！',
			lackmoneyangry: '被小瞧了啊，忘記我的恐怖了嗎——？',
			lackmoneynormal: '略為小貴，無傷大雅。',
			norm: '就像胸無點墨的人炫耀自己的知識一般無聊。',
			repell: '哦？竟這樣對我，考慮清楚後果了嗎？',
			seenRepell: '最有效率的做法啊，腦子轉的很快嘛。',
		},
		name: '魅魔',
		spellCards: {
			negative: [
				{
					description:
						'受到惡靈纏怨：接下來30秒內無法獲得夜雀之歌類Buff，且無法觸發特殊廚具效果。',
					name: '「瀆神的代價」',
				},
			],
			positive: [
				{
					description:
						'如果場上不存在「幽玄封魔陣」則生成法陣，如果存在則為法陣填充2點能量。「幽玄封魔陣」：魅魔以外的稀客釋放任意符卡時，填充1點能量。能量達到7點時，消耗全部能量引發夢符「時空一粟」場上所有入座客人的剩餘預算回覆到上限，接下來20秒內，製作料理不消耗食材且瞬間完成，客人必定給出最高評價。',
					name: '「幽冥的輪迴」',
				},
			],
		},
	},
	5005: {
		chat: [
			'好想去人間界呀。',
			'其實人間界也有這樣的店哦。',
			'偶爾就這樣呆在魔界也挺好的。',
			'魔界難得有這麼熱鬧的時候呢。',
		],
		description: [
			'經常偷偷溜出魔界甚至去外界旅行(工作)的魔界人，幾乎隨身帶着一個可以自動行走的行李箱。工作內容是在一個叫做“博客”的地方分享自己的旅行過程，據説很受外面世界的人類歡迎。真奇怪，人類這麼喜歡看別人旅行嗎？',
			'原來露易茲小姐不僅僅分享旅行過程，也經常分享自己的創意設計。她不僅見多識廣，有非常多有趣的想法和創意，還很瞭解時尚，很會夸人，很會做甜品……真希望自己也能成為像露易茲小姐這樣優秀的人呀。',
			'就算像露易茲小姐這樣滿心滿意地為了人類而行動的人，也一樣無法得到所有人的認同。想要互相理解真不是一件容易的事啊。但就算這樣，露易茲小姐也沒有打算放棄熱愛的工作。希望她的未來能夠一直“不負熱愛”。',
		],
		evaluation: {
			bad: '這種水平就算發到博客也沒有人會關注。',
			exbad: '這要是發到博客會被扔爛番茄。',
			exgood: '我一定要在博客上推薦這道料理！',
			good: '美味得我都想發博客了！',
			lackmoneyangry: '旅遊景點的餐廳都沒有你家貴！',
			lackmoneynormal: '這好像高於一般定價了吧……',
			norm: '不温不火的水平呢。',
			repell: '趕客的景點是沒有未來的……',
			seenRepell: '再有名的景點也沒有傲慢對待客人的資格。',
		},
		name: '露易茲',
		spellCards: {
			negative: [
				{
					description:
						'當晚營業結束後，再經過60s，將會強制驅逐店鋪內的客人並關店。',
					name: '「遺落的水晶鞋」',
				},
			],
			positive: [
				{
					description:
						'露易茲召喚一架魔法相機停留在店內，若稀有客人本尊離開時未吃飽且預算未耗盡，則相機拍下該稀客並轉換為一份「旅者博客」。當日結束後「旅者博客」解放（若拍攝時當日已結束則立即解放），投影出其拍攝的客人形象再次光臨食堂，以此方式形成的稀客影像可以使用符卡，喜好與原先無異，但預算為其離開時的預算，續單上限為其離開時剩餘的可點單數。',
					name: '「傳奇的格列佛」',
				},
			],
		},
	},
	5012: {
		chat: [
			'久違地出來吃飯了呢……',
			'接下來可以睡個長覺了。',
			'一路走來真是辛苦你了。',
			'你的努力我都看在眼裏。',
		],
		description: [
			'創造了幻想鄉的賢者之一，據説是幻想鄉最古老的妖怪，雖然神出鬼沒而且性格有點不近人情，但其實一直以來暗中維護着幻想鄉的安全與穩定……雖然沒有得到多數人的理解，但恐怕也沒有像她一樣真摯地對待幻想鄉、愛着幻想鄉的人了。',
			'簡介2',
			'簡介3',
		],
		evaluation: {
			bad: '這種東西應該扔到隙間去。',
			exbad: '這種東西連呆在隙間的資格都沒有。',
			exgood: '做得好！你值得擁有更多！',
			good: '不錯，難怪享有盛名。',
			lackmoneyangry: '我不能允許幻想鄉存在這種漫天要價的行為！',
			lackmoneynormal: '小麻雀的生意經做得稍微有點過頭了喲。',
			norm: '似乎和我想象的有所出入。',
			repell: '要到隙間來談談嗎？',
			seenRepell: '我期待的幻想鄉並非這種模樣。',
		},
		name: '八雲紫',
		spellCards: {
			negative: [
				{
					description:
						'在場上開啓數個會變換位置的隙間，若接近隙間則會被吸入其中，然後隨機傳送到其他隙間處，同時托盤內的酒水會消失。隙間持續30秒。',
					name: '「現與隱的境界」',
				},
			],
			positive: [
				{
					description:
						'在當日結束前觸發時，凍結所有剩餘時間大於44秒的Buff時間，使之不再減少，直至當日結束。再次觸發或在當日結束後觸發，所有剩餘時間大於44秒的Buff時間增加當前剩餘時長的10%（每種類型的Buff至多通過此符卡增加17秒）。',
					name: '「人與妖的夢鄉」',
				},
			],
		},
	},
	9000: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	9001: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	9002: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	9003: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	9004: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	10000: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	10001: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	10002: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	11000: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
	11001: {
		chat: [],
		description: [null, null, null],
		evaluation: {
			bad: null,
			exbad: null,
			exgood: null,
			good: null,
			lackmoneyangry: null,
			lackmoneynormal: null,
			norm: null,
			repell: null,
			seenRepell: null,
		},
		name: null,
		spellCards: {},
	},
} as const satisfies Readonly<
	Partial<Record<number, ILocalizedSpecialGuestText>>
>;
