import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const DECORATION_LOCALIZATION_JA = {
	32: {
		description:
			'橙がくれた置き物。富と客を招き入れる程度の能力を持っているとか？店内のチップ率が15%上昇する。',
		name: 'まねき猫',
	},
	33: {
		description:
			'茨華仙がくれた盆栽。円満と富貴を象徴するもので、とても綺麗に咲いている。客が料理を食べる際に、料理への評価が普通以上であった場合、客の満足度が15上昇する。',
		name: '富貴牡丹',
	},
	34: {
		description:
			'本物の桃ではなく、おそらく比那名居天子の手作りだと思われる。食べられないが、強運を引き寄せるとのウワサも。客が料理を食べる際に、料理への評価が普通以上であった場合、15%の確率で必ず満足な評価を得る。',
		name: '強運の桃',
	},
	50: {
		description:
			'紅美鈴のかわりに夜雀食堂を守りにきたパンダの用心棒。白黒ハッキリしていて、千万の寵愛を一身に受ける、まさに国宝……ってことはむしろ守られる側なのでは！？店内の全ての客が15秒ごとに投げ銭をしてくれる。',
		name: 'パンダの胖ちゃん',
	},
	51: {
		description:
			'どうみてもそこらへんで捕まえてきた普通のウサギだが、てゐ自らが捕獲したためか、謎の幸運を持ち合わせているようだ…料理を作る際に15%の確率で食材を消費しない。',
		name: '幸せの素ウサギ？',
	},
	62: {
		description:
			'『東方華心伝』のコラボギフト、「喜」を表すマスク。店内に配置すると、客の予算が20%アップ。秦こころのスペルカード効果で強化されると、効果は200%に上昇。感情マスクのオブジェは、配置できるのは1つのみ。',
		name: '喜の面',
	},
	63: {
		description:
			'『東方華心伝』のコラボギフト、「怒」を表すマスク。店内に配置すると、料理時間が10%短縮。秦こころのスペルカード効果で強化されると、効果は75%に上昇。感情マスクのオブジェは、配置できるのは1つのみ。',
		name: '怒の面',
	},
	64: {
		description:
			'『東方華心伝』のコラボギフト、「哀」を表すマスク。店内に配置すると、客の追加注文の確率が5%アップ。秦こころのスペルカード効果で強化されると、効果は50%に上昇。感情マスクのオブジェは、配置できるのは1つのみ。',
		name: '哀の面',
	},
	65: {
		description:
			'『東方華心伝』のコラボギフト、「楽」を表すマスク。店内に配置すると、稀少な客が初めて評価をするとき、評価ランクが最低でも「普通」に。秦こころのスペルカード効果で強化されると、効果は最低でも「大満足」に。感情マスクのオブジェは、配置できるのは1つのみ。',
		name: '楽の面',
	},
	1003: {
		description:
			'成美からの贈り物で、家の近くに置くと、毎日参拝して素敵なご利益がもらえます。',
		name: '地蔵人形',
	},
	1004: {
		description:
			'幻想郷で流行した遠隔通話装置！それを使って友達の所に行かなくても通話できますよ！',
		name: '河童重工電話機',
	},
	2003: {
		description:
			'さとり妖怪の読心術が付いたレプリカで、店に飾ると、お客様一人一人の予算額が見えます。',
		name: 'さとりの目',
	},
	2004: {
		description:
			'恐ろしく不幸に見えるが、意外にも所有者の不幸を防ぐことができる。店頭に飾っておくと、Comboを中断したミスに耐えられる。',
		name: '仇返し人形',
	},
	3000: {
		description:
			'正体不明の力で造られた謎の機械。外の世界のある機械がインスピレーションになったという。思いがけない報酬を得られるかもしれないが、拗らせると破産につながるに違いない！',
		name: 'UFOスロットマシン',
	},
	4000: {
		description:
			'普通の釣り竿、簡単な釣りしかできなく、効率よく釣ることはできないだろう。地下室の展示棚で使うと、釣り場が地図に表示される。',
		name: '普通の釣り竿',
	},
	4001: {
		description:
			'細かい操作まで可能な釣り竿で、釣りができるだけでなく、宝箱を見つけることもできる！ とっても不思議！ 地下室の展示棚で使うと、釣り場が地図に表示される。',
		name: '高級釣り竿',
	},
	5012: {
		description:
			'不思議な道具で、一般客の来店を遮ることができる（カード効果を含む）',
		name: '門前払い',
	},
	5013: {
		description:
			'レア客の来店を遮ることができる不思議な道具（招待客を含む）',
		name: '面会謝絶',
	},
	5014: {
		description:
			'別次元からの「究極の贈り物」は、所有者を「創造主」にすることができる不思議な箱だ。',
		name: '創造者の箱',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
