import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const DECORATION_LOCALIZATION_KO = {
	32: {
		description:
			'첸에게서 받은 장식품입니다. 재물과 손님을 불러들이는 정도의 능력(?)이 있다고 합니다. 받는 기타 팁이 15% 증가합니다.',
		name: '마네키네코',
	},
	33: {
		description:
			'카센에게서 받은 분재입니다. 원만함과 부귀를 상징하는 꽃으로, 아름답게 피어 있습니다. 손님이 음식을 먹을 때마다 만족도가 15 상승합니다.',
		name: '부를 불러들이는 모란',
	},
	34: {
		description:
			'진짜 복숭아는 아니고, 텐시가 직접 만든 것 같습니다. 먹을 수는 없지만, 행운을 불러들입니다. 손님이 음식을 먹을 때마다, 15%의 확률로 반드시 만족한 평가를 내립니다.',
		name: '행운 넘치는 복숭아',
	},
	50: {
		description:
			'메이링을 대신해 밤참새식당을 지키기 위해 보내진 팬더입니다. 그 상징적인 흑백의 무늬가 역시 수많은 사람들의 총애를 한 몸에 받는, 그야말로 국보와도 같달까요... 잠깐, 그러면 오히려 이걸 지켜야 하는게 아닌가!? 모든 손님들이 매 15초마다 조금씩 팁을 줍니다.',
		name: '팬더 마스코트',
	},
	51: {
		description:
			'아무리 봐도 그냥 토끼 같지만, 테위가 직접 잡았다고 하니 무언가 행운이 깃들었나 봅니다... 요리 시 15%의 확률로 재료를 소모하지 않습니다.',
		name: '행운의 토끼?',
	},
	62: {
		description:
			'《동방화심전》 콜라보 선물. "기쁨"의 감정을 대표합니다. 가게에 배치할 시 손님의 예산이 20% 증가합니다. 하타노 코코로의 스펠이 발동하면 효과가 200%로 상승합니다. 감정의 가면은 한 종류만 배치할 수 있습니다.',
		name: '기쁨의 가면',
	},
	63: {
		description:
			'《동방화심전》 콜라보 선물. "분노"의 감정을 대표합니다. 가게에 배치할 시 조리 시간이 10% 감소합니다. 하타노 코코로의 스펠이 발동하면 효과가 75%로 상승합니다. 감정의 가면은 한 종류만 배치할 수 있습니다.',
		name: '분노의 가면',
	},
	64: {
		description:
			'《동방화심전》 콜라보 선물. "슬픔"의 감정을 대표합니다. 가게에 배치할 시 손님의 재주문율이 5% 증가합니다. 하타노 코코로의 스펠이 발동하면 효과가 50%로 상승합니다. 감정의 가면은 한 종류만 배치할 수 있습니다.',
		name: '슬픔의 가면',
	},
	65: {
		description:
			'《동방화심전》 콜라보 선물. "즐거움"의 감정을 대표합니다. 가게에 배치할 시 희귀 손님이 첫 평가를 낼 시 최소 보통 이상 평가가 나옵니다. 하타노 코코로의 스펠이 발동하면 무조건 완벽한 평가가 나옵니다. 감정의 가면은 한 종류만 배치할 수 있습니다.',
		name: '즐거움의 가면',
	},
	1003: {
		description:
			'나루미에게서 받은 선물입니다. 집 근처에 설치하면 매일 공물을 받을 수 있습니다.',
		name: '지장 인형',
	},
	1004: {
		description:
			'인기 있는 원거리 통신기기입니다. 이제 직접 만나지 않고서도 이야기할 수 있습니다.',
		name: '캇파 전화기',
	},
	2003: {
		description:
			'사토리 요괴가 속마음을 읽어주는 것의 복제품. 가게에 장식하면 모든 손님의 예산을 볼 수 있습니다.',
		name: '제 3의 눈',
	},
	2004: {
		description:
			'무섭고 불행해 보이지만 소유자를 보호하고, 대신 불행을 막아주는 인형. 가게에 장식하면 콤보가 끊기는 걸 한 번 막아줄 수 있습니다.',
		name: '저주의 인형',
	},
	3000: {
		description:
			'바깥 세계의 어떤 기계를 참고해서 만들어진 기계입니다. 알 수 없는 신비한 능력을 가지고 있습니다. 생각지도 못한 보상을 받을 확률이 있지만, 너무 푹 빠지면 파산으로 가는 길이 됩니다.',
		name: '벤토라 슬롯머신',
	},
	4000: {
		description:
			'평범한 낚싯대는 몇 가지 간단한 낚시 작업만 수행할 수 있으므로 그다지 효율적이지 않습니다. 지하 전시장에서 활성화하면 낚시터가 곳곳에 나타납니다.',
		name: '평범한 낚싯대',
	},
	4001: {
		description:
			'세밀하고 고급스러운 조작이 가능한 낚싯대. 낚시 외에도 보물상자를 발견할 수 있을지도 모릅니다! 환상적이네요! 지하 전시장에서 활성화하면 낚시터가 곳곳에 나타납니다.',
		name: '고급 낚싯대',
	},
	5012: {
		description:
			'스펠 카드 효과를 포함해 평범한 손님들이 출입하는 것을 막는 신기한 도구입니다.',
		name: '문전박대 부적',
	},
	5013: {
		description:
			'초대를 포함해 희귀 손님들이 오는 것을 막는 신기한 도구입니다.',
		name: '면회사절 부적',
	},
	5014: {
		description:
			'다른 차원에서 온 "궁극의 선물". 이 상자를 여는 자, "창조주"의 힘을 얻으리라.',
		name: '창조주의 상자',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
