import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const DECORATION_LOCALIZATION_ZH_TW = {
	32: {
		description:
			'橙贈送的擺件，也許有着招攬財富和客人程度的能力(?)。使店內的小費率額外增加15%。',
		name: '招財貓',
	},
	33: {
		description:
			'茨華仙贈送的盆栽，寓意着圓滿富貴，花很好看。客人對料理的評價若至少為普通，則心情額外增加15。',
		name: '富貴牡丹',
	},
	34: {
		description:
			'並不是真正的桃子，似乎是比那名居天子親手做的。雖然不能吃，但據説能帶來好運。客人對料理的評價若至少為普通，則有15%的概率提高評價至完美。',
		name: '強運桃子',
	},
	50: {
		description:
			'代替紅美鈴守護夜雀食堂的熊貓，全身黑白分明，據説是個集萬千寵愛於一身的國寶……這樣的話，是我守護它才對吧？！。店內所有的客人每15秒會進行1~20的打賞。',
		name: '胖滾君',
	},
	51: {
		description:
			'怎麼看都像是隨手抓來的兔子，但因為是帝抓來的，竟然有着奇妙的幸運…製作料理時有15%的概率不會減少食材。',
		name: '幸運的素兔？',
	},
	62: {
		description:
			'《東方華心傳》的聯動禮物，代表“喜”情緒的面具。擺放在店鋪中時，客人的預算提高20%。受到秦心的符卡效果強化後，效果提升至200%。情緒面具擺件只能選擇一個進行擺放。',
		name: '喜之面',
	},
	63: {
		description:
			'《東方華心傳》的聯動禮物，代表“怒”情緒的面具。擺放在店鋪中時，減少10%料理時間。受到秦心的符卡效果強化後，效果提升至75%。情緒面具擺件只能選擇一個進行擺放。',
		name: '怒之面',
	},
	64: {
		description:
			'《東方華心傳》的聯動禮物，代表“哀”情緒的面具。擺放在店鋪中時，客人的續單概率提高5%。受到秦心的符卡效果強化後，效果提升至50%。情緒面具擺件只能選擇一個進行擺放。',
		name: '哀之面',
	},
	65: {
		description:
			'《東方華心傳》的聯動禮物，代表“樂”情緒的面具。擺放在店鋪中時，稀有客人首次給出評價時，評價等級至少為普通。受到秦心的符卡效果強化後，效果改為至少為完美。情緒面具擺件只能選擇一個進行擺放。',
		name: '樂之面',
	},
	1003: {
		description:
			'成美給的禮物，可以放置在家附近，每天參拜會得到很棒的供品。',
		name: '地藏人偶',
	},
	1004: {
		description:
			'幻想鄉流行起來的遠程通話裝置！使用它不用到達朋友的面前也可以通話啦！',
		name: '河童重工電話機',
	},
	2003: {
		description:
			'是覺妖怪讀心眼的複製品，裝飾在店裏的話，可以看到每個客人的預算額度。',
		name: '覺之眼',
	},
	2004: {
		description:
			'雖然看起來可怕又不幸，但其實意外的能夠保護擁有者，會替擁有者抵擋不幸。裝飾在店裏，可以抵擋一次中斷Combo的失誤。',
		name: '仇返人形',
	},
	3000: {
		description:
			'使用真相不明的能力製造的迷之機器，據説靈感來源於外面世界的某種機器。有幾率獲得意外獎勵，但過度沉迷必定會導致破產！',
		name: '飛碟老虎機',
	},
	4000: {
		description:
			'普通的釣魚竿，只能進行一些簡單的釣魚工作，想必效率不高。在地下室的展示櫃中啓用後，各地會出現釣魚點。',
		name: '普通的釣魚竿',
	},
	4001: {
		description:
			'可以進行精細高級操作的釣魚竿，除了能夠釣魚，還能夠尋找到寶箱！非常神奇！在地下室的展示櫃中啓用後，各地會出現釣魚點。',
		name: '超級釣魚竿',
	},
	5012: {
		description: '神奇的道具，能夠屏蔽普通客人來店（包括符卡效果）。',
		name: '門無雜賓',
	},
	5013: {
		description: '神奇的道具，能夠屏蔽稀有客人來店（包括邀請客人）。',
		name: '杜門謝客',
	},
	5014: {
		description:
			'來自另一個次元的“終極禮物”，能讓擁有者成為“造物主”的神奇盒子。',
		name: '造物者之盒',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
