import type { IBadge } from './schema';

/* eslint-disable sort-keys -- Keep identity, display, DLC, then category details as the record data-table column order. */
export const BADGE_RECORDS = [
	{
		id: 1000,
		name: '地狱大胃王制霸的证明',
		description: '再次前往血池地狱挑战饕餮尤魔胜利后获得',
		dlc: 1,
	},
	{
		id: 2000,
		name: '怪诞妖怪制霸的证明-简单',
		description:
			'通过古明地觉的回忆重战怪诞料理赛并且在Easy或更高难度下取胜时获得',
		dlc: 2,
	},
	{
		id: 2001,
		name: '怪诞妖怪制霸的证明-普通',
		description:
			'通过古明地觉的回忆重战怪诞料理赛并且在Normal或更高难度下取胜时获得',
		dlc: 2,
	},
	{
		id: 2002,
		name: '怪诞妖怪制霸的证明-高级',
		description:
			'通过古明地觉的回忆重战怪诞料理赛并且在Hard或更高难度下取胜时获得',
		dlc: 2,
	},
	{
		id: 2003,
		name: '怪诞妖怪制霸的证明-疯狂',
		description:
			'通过古明地觉的回忆重战怪诞料理赛并且在Lunatic难度下取胜时获得',
		dlc: 2,
	},
	{
		id: 2500,
		name: '原始与野性徽章 ~ 银',
		description:
			'「妖怪兽道」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2501,
		name: '原始与野性徽章 ~ 金',
		description:
			'「妖怪兽道」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2502,
		name: '雨顺与风调徽章 ~ 银',
		description:
			'「人间之里」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2503,
		name: '雨顺与风调徽章 ~ 金',
		description:
			'「人间之里」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2504,
		name: '孤独与节制徽章 ~ 银',
		description:
			'「博丽神社」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2505,
		name: '孤独与节制徽章 ~ 金',
		description:
			'「博丽神社」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2506,
		name: '魔法与诅咒徽章 ~ 银',
		description:
			'「红魔馆」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2507,
		name: '魔法与诅咒徽章 ~ 金',
		description:
			'「红魔馆」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2508,
		name: '终古与刹那徽章 ~ 银',
		description:
			'「迷途竹林」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2509,
		name: '终古与刹那徽章 ~ 金',
		description:
			'「迷途竹林」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2510,
		name: '樱开与樱落徽章 ~ 银',
		description:
			'「白玉楼」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2511,
		name: '樱开与樱落徽章 ~ 金',
		description:
			'「白玉楼」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2512,
		name: '开端与结局徽章 ~ 银',
		description:
			'「鸟兽伎乐」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2513,
		name: '开端与结局徽章 ~ 金',
		description:
			'「鸟兽伎乐」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2514,
		name: '幽深与回响徽章 ~ 银',
		description:
			'「魔法森林」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2515,
		name: '幽深与回响徽章 ~ 金',
		description:
			'「魔法森林」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2516,
		name: '丰收与寂寥徽章 ~ 银',
		description:
			'「妖怪之山」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2517,
		name: '丰收与寂寥徽章 ~ 金',
		description:
			'「妖怪之山」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2518,
		name: '吞噬与破灭徽章 ~ 银',
		description:
			'「血池地狱」章节曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2519,
		name: '吞噬与破灭徽章 ~ 金',
		description:
			'「血池地狱」章节曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2520,
		name: '灼热与躁动徽章 ~ 银',
		description:
			'「旧地狱」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2521,
		name: '灼热与躁动徽章 ~ 金',
		description:
			'「旧地狱」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2522,
		name: '寂寥与偏爱徽章 ~ 银',
		description:
			'「地灵殿」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2523,
		name: '寂寥与偏爱徽章 ~ 金',
		description:
			'「地灵殿」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2524,
		name: '怪诞与常理徽章 ~ 银',
		description:
			'「怪诞料理大赛」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2525,
		name: '怪诞与常理徽章 ~ 金',
		description:
			'「怪诞料理大赛」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2526,
		name: '爱乐徽章',
		description: '完成「爱乐者的挑战赛」剧情后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2527,
		name: '博丽神社大祭徽章 ~ 银',
		description:
			'「博丽大祭」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2528,
		name: '博丽神社大祭徽章 ~ 金',
		description:
			'「博丽大祭」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2529,
		name: '静寂与晨暮徽章 ~ 银',
		description:
			'「命莲寺」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2530,
		name: '静寂与晨暮徽章 ~ 金',
		description:
			'「命莲寺」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2531,
		name: '阴阳与协调徽章 ~ 银',
		description:
			'「神灵庙大赛」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2532,
		name: '阴阳与协调徽章 ~ 金',
		description:
			'「神灵庙大赛」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2533,
		name: '风灵与芳华徽章 ~ 银',
		description:
			'「太阳花田」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2534,
		name: '风灵与芳华徽章 ~ 金',
		description:
			'「太阳花田」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2535,
		name: '朽梦与孑遗徽章 ~ 银',
		description:
			'「辉针城」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2536,
		name: '朽梦与孑遗徽章 ~ 金',
		description:
			'「辉针城」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2537,
		name: '幽闭与禁忌徽章 ~ 银',
		description:
			'「红魔馆的抓鬼游戏」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2538,
		name: '幽闭与禁忌徽章 ~ 金',
		description:
			'「红魔馆的抓鬼游戏」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2539,
		name: '奋进与守旧徽章 ~ 银',
		description:
			'「月之都」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2540,
		name: '奋进与守旧徽章 ~ 金',
		description:
			'「月之都」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2541,
		name: '梦幻与茶会徽章 ~ 银',
		description:
			'「魔界」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2542,
		name: '梦幻与茶会徽章 ~ 金',
		description:
			'「魔界」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2543,
		name: '困兽与搏斗徽章 ~ 银',
		description:
			'「天罗地网」章节所有曲目在「普通」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 2544,
		name: '困兽与搏斗徽章 ~ 金',
		description:
			'「天罗地网」章节所有曲目在「困难」难度下达成A及以上评价后获得的奖励',
		dlc: 2.5,
	},
	{
		id: 3000,
		name: '博丽大祭料理赛徽章',
		description: '参与博丽大祭对抗赛·神灵庙料理赛场获胜纪念',
		dlc: 3,
	},
	{
		id: 3001,
		name: '博丽大祭摇滚赛徽章',
		description: '参与博丽大祭对抗赛·命莲寺摇滚赛场获胜纪念',
		dlc: 3,
	},
	{
		id: 4000,
		name: '恶魔之妹制霸的证明-简单',
		description: '在红魔馆的抓鬼游戏中击败全部的芙兰朵露分身后获得',
		dlc: 4,
	},
	{
		id: 4001,
		name: '恶魔之妹制霸的证明-普通',
		description:
			'再次前往红魔馆地下室，并在Normal或更高难度下的抓鬼游戏中击败全部的芙兰朵露分身后获得',
		dlc: 4,
	},
	{
		id: 4002,
		name: '恶魔之妹制霸的证明-困难',
		description:
			'再次前往红魔馆地下室，并在Hard或更高难度下的抓鬼游戏中击败全部的芙兰朵露分身后获得',
		dlc: 4,
	},
	{
		id: 4003,
		name: '恶魔之妹制霸的证明-疯狂',
		description:
			'再次前往红魔馆地下室，并在Lunatic难度下的抓鬼游戏中击败全部的芙兰朵露分身后获得',
		dlc: 4,
	},
	{
		id: 5000,
		name: '创造与无限的证明',
		description: '获得神绮的造物者之盒后的奖励',
		dlc: 5,
	},
	{
		id: 5001,
		name: '捕获反狱王的证明·简单',
		description: '在剧情中捕获反狱王宫出口瑞灵后获得',
		dlc: 5,
	},
	{
		id: 5002,
		name: '捕获反狱王的证明·普通',
		description:
			'通过月都终端模拟，在至少激活了一个恶咒的情况下捕获反狱王宫出口瑞灵后获得',
		dlc: 5,
	},
	{
		id: 5003,
		name: '捕获反狱王的证明·困难',
		description:
			'通过月都终端模拟，在至少激活了两个恶咒的情况下捕获反狱王宫出口瑞灵后获得',
		dlc: 5,
	},
	{
		id: 5004,
		name: '捕获反狱王的证明·疯狂',
		description:
			'通过月都终端模拟，在激活三个恶咒的情况下捕获反狱王宫出口瑞灵后获得',
		dlc: 5,
	},
	{
		id: 5005,
		name: '万物皆可肉鸽？',
		description: '通过月都终端模拟，进入生存模式',
		dlc: 5,
	},
	{
		id: 5006,
		name: '肉鸽的灵魂在于选择',
		description: '生存模式中，首次激活三花的营业卡牌',
		dlc: 5,
	},
	{
		id: 5007,
		name: '你所不知道的卡牌黑市',
		description: '生存模式中，在一场夜间营业里累计激活18次三花的营业卡牌',
		dlc: 5,
	},
	{
		id: 5008,
		name: '强欲之夜雀',
		description: '生存模式中，累计抽取100张三花的营业卡牌',
		dlc: 5,
	},
	{
		id: 5009,
		name: '鱼肉菜蛋，营养管饱',
		description:
			'生存模式中，在一场夜间营业里激活了「万物丰穰」、「三头犬捕兽夹」、「三途川牛鬼鱼市」、「秘宝探测器」四种类型的卡牌',
		dlc: 5,
	},
	{
		id: 5010,
		name: '完美的黄金回旋！',
		description:
			'生存模式中，使用卡牌「怒押必中」以最高条件获得以下之一的酒水返还：晓/十四夜/火鼠裘',
		dlc: 5,
	},
	{
		id: 5011,
		name: '大吉猫咪的聚宝功',
		description: '生存模式中，首次激活三花的全局卡牌',
		dlc: 5,
	},
	{
		id: 5012,
		name: 'Buff栏要塞不下了！',
		description: '生存模式中，累计收集9种不同的全局卡牌',
		dlc: 5,
	},
	{
		id: 5013,
		name: '宝货盈门，金卡满堂',
		description: '生存模式中，累计收集24种不同的全局卡牌',
		dlc: 5,
	},
	{
		id: 5014,
		name: '鸟脑袋的地狱试炼官',
		description: '生存模式中，使用卡牌「鬼渡试炼」并成功完成一次试炼',
		dlc: 5,
	},
	{
		id: 5015,
		name: '一个筋斗，这头到那头',
		description: '生存模式中，移动力达到5',
		dlc: 5,
	},
	{
		id: 5016,
		name: '一元购',
		description: '生存模式中，香霖堂折扣率达到90%',
		dlc: 5,
	},
	{
		id: 5017,
		name: '粮粮粮粮粮草征收人',
		description:
			'生存模式中，香霖堂出售材料数不少于300%的情况下买空香霖堂的食材页面',
		dlc: 5,
	},
	{
		id: 5018,
		name: '风风火火闯九州',
		description:
			'生存模式中，妖怪兽道、人间之里、博丽神社、红魔馆、迷途竹林的雀食堂等级都达到3级且至少开过一次店',
		dlc: 5,
	},
	{
		id: 5019,
		name: '轮回·终末',
		description: '生存模式中，五种"危险卡牌"都抽取过至少一次',
		dlc: 5,
	},
	{
		id: 5020,
		name: '擦弹与决死',
		description:
			'生存模式中，任意一次营业在不超过营业额的110%的情况下极限过关',
		dlc: 5,
	},
	{
		id: 5021,
		name: '记忆开始收束？',
		description: '生存模式中，获得80种菜谱',
		dlc: 5,
	},
	{
		id: 5022,
		name: '千金散尽还复来',
		description: '生存模式中，最高收入达到10000',
		dlc: 5,
	},
	{
		id: 5023,
		name: '富可敌魔理沙',
		description: '生存模式中，最高收入达到30000',
		dlc: 5,
	},
	{
		id: 5024,
		name: '能收购八云钱庄程度的资产',
		description: '生存模式中，最高收入达到60000',
		dlc: 5,
	},
	{
		id: 5025,
		name: '香霖堂至尊VIP客户',
		description: '生存模式中，累计在香霖堂消费20000',
		dlc: 5,
	},
	{
		id: 5026,
		name: '收集狂',
		description: '生存模式中，收集率达到100%',
		dlc: 5,
	},
	{
		id: 5027,
		name: '胜利的法则已然确定',
		description: '生存模式中，完成20波次通关要求',
		dlc: 5,
	},
	{
		id: 5028,
		name: '生存模式制霸的证明',
		description: '完成全部的生存模式成就',
		dlc: 5,
	},
	{
		id: 5029,
		name: '代理巫女',
		description: '生存模式中，解决1次“异变乱流”',
		dlc: 5,
	},
	{
		id: 5030,
		name: '恶属性效果绝佳',
		description:
			'生存模式中，不通过喂饱幽幽子幻象的方式解决“异变乱流「墨染之樱」”',
		dlc: 5,
	},
	{
		id: 5031,
		name: '结束了…再一次…',
		description: '生存模式中，喂饱幽幽子幻象解决“异变乱流「墨染之樱」”',
		dlc: 5,
	},
	{
		id: 5032,
		name: '实石求石',
		description: '生存模式中，卡牌「汉诺塔垒石」数量达到9',
		dlc: 5,
	},
] as const satisfies Array<IBadge<number>>;
/* eslint-enable sort-keys */

export const BADGE_LIST = BADGE_RECORDS satisfies IBadge[];
