import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const BEVERAGE_LOCALIZATION_JA = {
	0: {
		description:
			'一番普通な飲み物。酒を一滴も飲めない下戸妖怪のために用意している。',
		name: '緑茶',
	},
	1: {
		description:
			'居酒屋の定番。ウィスキーをジュースと炭酸で割ったカクテル。アルコールを薄めると、誰でも飲める美味しい飲み物となる。',
		name: 'チューハイ',
	},
	2: {
		description:
			'居酒屋の定番。スピリッツをジュースと炭酸で割ったカクテル。チューハイとよく混同されるけど、それも美味しいから別にいいだろう。',
		name: 'サワー',
	},
	3: {
		description:
			'スパークリング日本酒。炭酸が入っているため甘酸っぱく、アルコールの度数も低いため、女性人気がとても高い。和製のシャンパンといっても良いだろう。',
		name: '氷の妖精',
	},
	4: {
		description:
			'幻想郷と縁がとても深い、とある偉人が副業として作っているビール。興味本位で醸造したものだったが、予想外に人気がでた。',
		name: '超ZUNビール',
	},
	5: {
		description:
			'純米酒。妖精の祝福を受けており、度数も高くない。口触りが柔らかく、価格も安い。居酒屋で人気のお酒です。',
		name: '日月星',
	},
	6: {
		description:
			'里の人たちが作る梅酒。その甘さに騙され、つい飲みすぎて潰れる者が後をたたないという。',
		name: '梅酒',
	},
	7: {
		description:
			'これを飲むと天狗でさえ喜んで踊るという逸話がある日本酒。妖怪の山で一度店を出して検証したいところだ。普通の日本酒と違い、薄い琥珀色である。',
		name: '天狗の舞',
	},
	8: {
		description:
			'ウォッカ、トマトジュース、レモンスライス、セロリを混ぜて作られたカクテルで、甘味・酸味・苦味・辛みの4つの味全てが楽しめる。真っ赤な色がとある洋館の吸血鬼を連想させることで、この名前がついた。',
		name: 'ブラッディ・レミー',
	},
	9: {
		description:
			'妖怪の山の上で秋の神々に庇護を受けながら育てられた大麦を用いて作った焼酎。',
		name: '神ノ麦',
	},
	10: {
		description:
			'鬼傑組の戦利品のうちの一つ。カワウソ霊が抗争の戦利品を地面に並べているのがお祭りのように見えたから名付けられた。かなり高級な純米大吟醸。',
		name: 'おそ祭り',
	},
	11: {
		description:
			'幻想郷の人々の口に合うよう改良されたウィスキー。ウィスキーの独特な香りをそのままに、口当たりを滑らかにした。',
		name: 'アカツキ',
	},
	12: {
		description:
			'雀が作った酒だと伝えられる。切り落とした竹の中に米を入れると、竹の中の水分でゆっくりと醸造される。この酒を飲むと延々と踊り続けてしまう、呪いのような美味しさがあると言われている。',
		name: '雀酒',
	},
	13: {
		description:
			'檸檬、ベルガモット、そしてメイド長が厳選した茶葉を使って淹れた、独特な香りがする紅茶。紅魔館の威厳を広めるため、ストレートな名付けとなっている。',
		name: '紅魔館ティー',
	},
	14: {
		description:
			'アイスクリームをコーヒーで溶かしたもの。苦いものは苦手だが、コーヒーの目覚まし効果が欲しい人にはとっておきの飲み物。「私はただ眠気対策がしたいだけよ、苦いのが嫌いなんてことはないわ」——パチュリー',
		name: 'アフォガート',
	},
	15: {
		description:
			'とある洋館のメイド特製のフルボディの赤ワイン。普通の時空で作られたものではないようで、霧のような酩酊感をもたらす。',
		name: '紅霧',
	},
	16: {
		description:
			'ほろ苦いオレンジの味がメインの、近頃流行りのカクテル。口当たりが柔らかく、鼻腔を蕩かす香りがする。「外界ではとても人気だと聞いたお嬢様方のリクエストで、外まで出向いて作り方を学んできました。結局苦みに耐えられず、オレンジジュースとベルモットを多めに入れたから、ただのオレンジジュースシロップとなってしまいました。」——匿名希望のメイド長',
		name: 'ネグローニ',
	},
	17: {
		description:
			'濃厚なスコッチウィスキーにアーモンドリキュールを混ぜて作るクラシックなカクテル。かなりハードボイルドな口当たりで、普通の妖怪では楽しめない。「強者たちはこれを好んで飲むと聞いたお嬢様方が気になるからと、レシピを取り寄せて作ってみました。美味しいと言いながら飲んでいただいたのですが、とても平気には見えませんでした。」——匿名希望のメイド長',
		name: 'ゴッドファーザー',
	},
	18: {
		description:
			'軽く楽しめる食後酒。ミントとクリームがメインのため、お酒よりもデザートに近い。「守矢の巫女が外から持ってきたレシピなんだって、堂々と自分の名をつけてるのよ！そもそも彼女は外界で酒が飲めるのかしら？まぁ、これはお酒なんて言えるものじゃないし、彼女にはお似合いね（舌打ち）」——匿名の巫女',
		name: '風祝',
	},
	19: {
		description:
			'とある東洋の国から伝わった金木犀の香りがする酒。冬至の日に酒を醸造すると、金色で甘い酒になるという。冷酒でも、熱燗にしても美味しい。',
		name: '桂花陳酒',
	},
	20: {
		description:
			'満月の夜よりも、明日を楽しみにしている十四夜が印象的かもしれない。そんな気持ちを込めて作られた高級な日本酒。この酒こそ迷いの竹林の月明かりに相応しい。',
		name: '十四夜',
	},
	21: {
		description:
			'火鼠の衣に包まなければ燃え上がってしまいそうな烈酒で、その辛さはほとんどの者が耐えられないほどの超激辛焼酎。',
		name: '火鼠の衣',
	},
	22: {
		description:
			'日本中で最高級と言われる茶葉。ちょっと低めの温度で時間をかけて淹れることがうま味を引き出すコツ。独特な味わいで、ほんのりとした甘みを感じさせる。',
		name: '玉露',
	},
	23: {
		description:
			'月の都の高度な技術で作られた炭酸水。ロケット花火のように泡が弾けて楽しい。レモンスライスを加えることで、完璧なソフトドリンクとなる。',
		name: 'ムーンロケット',
	},
	24: {
		description:
			'子供から大人まで、誰もがほっこりする純白の飲み物。数えきれない健康効果がある。',
		name: '牛乳',
	},
	25: {
		description:
			'外界から来た人気の飲み物らしい。赤色のグレープフルーツを生絞りした、とても爽やかで健康的な真夏日に飲みたい一品。',
		name: 'グレープフルーツジュース',
	},
	26: {
		description:
			'飲み口にガラス玉が挟まれていて、ガラス玉を押しこむことで飲めるようになる。冷たくしゅわっと弾けるような炭酸水は、まさに清涼感という単語が似合うだろう。一気に飲み干して夏を感じましょう。',
		name: 'ラムネ',
	},
	27: {
		description:
			'おいしいシャーベットの中に毛玉が溶けたような、レモン味のスムージー。蒸し暑い夏日に、何人の命を救ったのだろうか。',
		name: '氷毛玉のレモンティー',
	},
	28: {
		description:
			'大きい氷ブロックに夢幻のような甘いシロップとミントを入れて作った、夏の暑さを吹っ飛ばし皆を元気にする魔法のアイスドリンク。',
		name: 'でっかい氷菓！',
	},
	1000: {
		description:
			'最高級の日本酒は、口当たりが良く、果物の香りがする。光を避けて保存しなければならず、数時間日光にさらすだけで急激に変色する。',
		name: '大吟醸',
	},
	1001: {
		description:
			'希少な作物であるコーヒー豆を粉末にして作られた飲み物で、精神力と集中力を高めることができ、頭脳労働者には欠かせない不思議な飲み物である。',
		name: 'コーヒー',
	},
	1002: {
		description:
			'妖精たちが露を採集し、花の蜜と混ぜた甘い飲み物。妖精たちは自分の成果を忘れてしまうため、動物や人間に採られることが多い。病気平癒や起死回生の効果があるという噂、あくまで噂のようである。',
		name: '妖精の露',
	},
	1003: {
		description:
			'河童たちが貯蔵していた天然氷を、牛乳や砂糖などと一緒に混ぜたもので、古のアイスクリームである。伝統的な方法で作られることはなくなったが、幻想郷では未だ人気がある。',
		name: 'クリームスムージー',
	},
	1004: {
		description:
			'とある映像で出てきた謎の飲料、これを飲むとヒロインの体が小さくなっていくらしい。但し、これが映像の飲料と同一である保証はないし、効果があるかもわからない。',
		name: '謎の健康茶',
	},
	2000: {
		description:
			'一杯で底なしの鬼族が酔っ払う伝説の酒……でも私は見たの……鬼が湯水のように飲んでいったのよ？！伝説は少しも当てにならないね。',
		name: '鬼殺し',
	},
	2001: {
		description:
			'河童が販売していた、外の世界にあるエネルギードリンクの模造品。成分を抽出したり、名前を変えたりして誰でも作ることができるそうだが……本当に大丈夫でしょうか？',
		name: 'ポッカリ',
	},
	2002: {
		description:
			'地霊殿の限定記念スイーツ！地霊殿のさとり妖怪姉妹をイメージした可愛らしいソフトクリームは、地底妖怪に大人気だ。',
		name: '古明地ソフト',
	},
	3000: {
		description:
			'命蓮寺の特産品。観世音菩薩様が右手に楊枝、左手に甘露の入った浄瓶を持ち、楊枝で甘露を振りかけて幸運をもたらすという伝説がある。その伝説に惹かれてやってくる信徒たちの多くは一杯飲むらしい。',
		name: '楊枝甘露',
	},
	3001: {
		description:
			'道士たちが外界の技術をもって、最初の麦汁だけで醸したビール。そのため普通のビールの渋味がなく、より純粋で滑らかな味わいとなる。',
		name: '麒麟',
	},
	4000: {
		description:
			'鬼人正邪が自分の手で作ったアルコール、度数が超高く、鬼でもそれを飲んだら泥酔するお酒。もともと村では買い手がなく、おまけに値段はかなり高い。手下が買い手を脅しながら売るしかない。',
		name: '天地無用',
	},
	4001: {
		description:
			'桃の花で作ったお酒。桃木の下で、桃の花で作ったお酒を飲んでたら、桃花の仙人に出会えるという噂があるらしい。酔っ払ってそう見えているのでは？',
		name: '伶人酔',
	},
	5000: {
		description:
			'海の女の子は最終的に愛のために泡になったという伝説があるが、この独特の味のカクテルは、彼女が流した、彼女のために海に帰った涙なのかもしれない。',
		name: '海の女の子',
	},
	5001: {
		description:
			'魔界の強い酒にホットコーヒーを加え、溶けるまでかき混ぜた後、上部に繊細なクリームをかぶせた。ミルクの香りからお酒の香り、コーヒーの香りまで層がはっきりしており、まろやかな口当たりで、寒さを払うことができる。',
		name: '魔界コーヒー',
	},
	5002: {
		description:
			'アルギン酸ナトリウム溶液と塩化カルシウム溶液の反応を利用してアルギン酸ナトリウムゲル薄膜を形成し、調整したモヒートを包み込み、球状の透明ゲルにした。噛むと口の中で弾ける。視覚と味覚のダブルのサプライズで、とても魅力的な一品。',
		name: 'モルモットボール',
	},
	5003: {
		description:
			'宇宙船で宇宙に運ばれた醸造酵母は、科学者たちが丹念に開発し、空間酵母技術と現代のビール技術を組み合わせて、爽やかでまろやかで、泡が細かく長く、桃の花の香りが漂う独特のビールになった。',
		name: '宇宙ビール',
	},
	5004: {
		description:
			'コーヒーは瞬間的に真空にさらされると、低気圧によって瞬間的に沸騰し、気化現象によって熱を奪われ続けた水は最終的に沸騰中に凝固する。沸騰しながら凍るこのコーヒーは、月の都のこだわりドリンク。',
		name: 'サテライトアイスコーヒー',
	},
	11000: { description: null, name: null },
	11001: { description: null, name: null },
	11002: { description: null, name: null },
	11003: { description: null, name: null },
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
