import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const BEVERAGE_LOCALIZATION_KO = {
	0: {
		description:
			'가장 평범한 음료로, 조금이라도 술을 마시지 못하는 약한 요괴들을 위해 준비되었습니다.',
		name: '녹차',
	},
	1: {
		description:
			'술집에서 흔히 보이는 음료로, 위스키에 주스, 탄산수를 간단히 섞은 것입니다. 도수가 낮아 누구나 쉽게 즐길 수 있습니다.',
		name: '과일 하이볼',
	},
	2: {
		description:
			'술집에서 흔히 보이는 음료로, 소주에 주스, 탄산수를 간단히 섞은 것입니다. 하이볼보다는 일본풍이 강합니다.',
		name: '과일 사와',
	},
	3: {
		description:
			'탄산수를 잔뜩 넣은 톡 쏘는 맛의 사케로, 새콤달콤한 맛과 낮은 도수 때문에 많은 여성들에게 사랑을 받는 샴페인 버전 사케입니다.',
		name: '치',
	},
	4: {
		description:
			'환상향과 인연이 깊은 어느 대단한 남성이 부업으로 만든 맥주입니다. 재미삼아 만들었지만 예상 외로 인기가 많습니다.',
		name: '초 ZUN 맥주',
	},
	5: {
		description:
			'온전히 쌀로만 만들어진, 요정의 축복을 받은 술입니다. 도수가 그리 높지 않고, 맛도 좋고 가격도 합리적이어서 인기가 많습니다.',
		name: '일월성',
	},
	6: {
		description:
			'인간 마을에서 직접 양조된 매실주로, 달콤한 맛 때문에 멋 모르고 마시다가 훅 가는 이들이 많습니다.',
		name: '매실주',
	},
	7: {
		description:
			'텐구조차 그 맛에 절로 춤을 춘다는 전설이 있어 일명 텐구춤이라고도 불리는 술로, 요괴의 산에 한 번 가게를 차려보면 그 진위를 알 수 있을 것입니다. 다른 무색의 사케들과는 다르게 옅은 호박색을 띄고 있습니다.',
		name: '텐구오도리',
	},
	8: {
		description:
			'보드카, 토마토 주스, 레몬 조각, 샐러리 뿌리를 섞어 만든, 달고 시고 맵고 쓴 네 가지 맛을 내는 칵테일입니다. 그 붉은 외관에서 어느 저택에 사는 흡혈귀를 떠올리게 되어 이름이 붙여졌습니다.',
		name: '스칼렛 데블',
	},
	9: {
		description:
			'요괴의 산에 사는 가을의 여신들의 축복을 받은 보리로 만들어낸 보리 소주입니다.',
		name: '신의 보리삭',
	},
	10: {
		description:
			'귀걸조의 전리품들 중 하나로, 수달령들이 전리품을 무슨 의식이라도 치루듯이 늘어놓는 것을 보고 축제와 같다 하여 이런 이름이 붙은 내역이 있는 고급 준마이 다이긴죠입니다.',
		name: '수달의 향연',
	},
	11: {
		description:
			'환상향 주민들의 입맛에 맞춰 개량해 모두가 좋아하는 위스키입니다. 위스키만의 독특한 향은 살리면서 목넘김을 부드럽게 했습니다.',
		name: '아카츠키',
	},
	12: {
		description:
			'참새들이 빚어냈다는 전설 속의 술. 쌀알을 죽통에 넣고, 물이 생길 때까지 숙성시키고 나면 맛있는 사케가 되어있습니다. 한 번 마시면 그 맛에 춤사위를 못 멈추는 \'저주받은 술"과도 같습니다.',
		name: '참새의 술',
	},
	13: {
		description:
			'레몬, 시트론, 그리고 메이드장이 엄선한 특급 홍찻잎을 이용해 우려낸 차입니다. 홍마관의 위엄을 드높이기 위해 그 이름을 그대로 사용했습니다.',
		name: '홍마관 홍차',
	},
	14: {
		description:
			'커피에 아이스크림을 얹은, 쓴 맛은 싫지만 카페인은 필요한 이들을 위한 음료입니다. "정신 차리기 위해서 차가운 게 필요할 뿐이야. 절대 쓴 걸 못 먹는게 아니라구." ——파츄리',
		name: '아포가토',
	},
	15: {
		description:
			'메이드장이 만들어낸 특제 레드 와인으로, 시간의 흐름이 이상한 곳에서 숙성시킨 것 같은 풍부한 맛이 특징입니다.',
		name: '홍무',
	},
	16: {
		description:
			'쌉싸름한 오렌지 맛과 향기를 주로 하는 부드러운 칵테일로, 요즘 유행하고 있습니다. "최근에 유행한다는 말을 들은 큰 아가씨께서 요청해 밖에서 배워왔지만, 쓴 맛이 강해 아가씨가 못 드셔서 오렌지와 시트론 양을 늘렸지. 뭐, 결국엔 오렌지 시럽이나 다름 없게 되었지만." ——익명의 메이드장',
		name: '네그로니',
	},
	17: {
		description:
			'스카치 위스키와 아마레토로 만든 클래식 칵테일입니다. 너무 독한 나머지 요괴들도 대부분 못 견딥니다. "강한 요괴들이 이 술을 좋아한다는 말을 들은 큰 아가씨께서 요청해 밖에서 배워왔지만, 한 잔 마시고는 울 것 같은 표정으로 겨우 버티면서 맛이 좋다 하시더라고." ——익명의 메이드장',
		name: '갓파더',
	},
	18: {
		description:
			'민트와 크림 맛이 나는 리큐어로, 술이라기보단 디저트에 더 가깝습니다. "모리야 애가 바깥 세상에서 가져온건데, 보란듯이 술에 지 이름을 붙였더라구! 근데, 걔 바깥에서 술 마셔도 되는 나이이긴 해? 아, 그래서 술 같지도 않은걸 술이라고 가져온거구나! 쯧... ——익명의 무녀',
		name: '카제하후리',
	},
	19: {
		description:
			'어느 고대 국가의 관습 중 하나인 동짓날에 빚어낸 술로, 황금빛 외관에 달콤상큼한 맛, 올리브 향이 어우러져 뜨겁든 차갑든 맛있는 술입니다.',
		name: '겨울꿀술',
	},
	20: {
		description:
			'소원을 비는 보름날 달보다 보름전야의 달을 보며 내일을 기대하는 마음을 담아 빚은 고급진 청주로, 미혹의 죽림의 달에 걸맞는 유일한 술입니다.',
		name: '보름전야',
	},
	21: {
		description:
			'불쥐의 웃옷에 담기지 않았다면 불탔을지도 모르는 굉장히 맵고 뜨거운 소주입니다. 이런걸 견딜 수 있는 이는 얼마 없습니다.',
		name: '불쥐의 웃옷',
	},
	22: {
		description:
			'일본 내에서 최고중의 최고라고 일컫어지는 녹차입니다. 살짝 미지근한 물에 시간을 들여 우려내야 하며, 독특한 향과 달콤한 맛이 일품입니다.',
		name: '옥로',
	},
	23: {
		description:
			'달의 도시의 선진기술을 이용해 만들어진 탄산수입니다. 마치 입 안에서 로켓이 발사라도 하듯 탄산이 가득하고, 레몬 조각을 살짝 얹는 것만으로 완벽하게 즐길 수 있습니다.',
		name: '문 로켓',
	},
	24: {
		description:
			'아이부터 어른까지 모두가 좋아하는 순백의 마실거리입니다. 마시기만 해도 건강해집니다.',
		name: '우유',
	},
	25: {
		description:
			'바깥 세계에서 인기가 많은, 자몽으로 만든 음료입니다. 시원하고 청량감이 넘치며 달콤합니다. 무더운 여름에 최적입니다.',
		name: '자몽 주스',
	},
	26: {
		description:
			'입구에 박혀있는 구슬을 아래로 밀어내면 탄산이 뿜어져 나옵니다. 이 차가운 거품들을 한 번에 다 마시면 뱃속에서도 여름을 느낄수 있는 음료입니다.',
		name: '라무네',
	},
	27: {
		description:
			'맛있는 셔벗 속에 케다마를 녹여낸듯 한 레몬 맛의 스무디. 이 것 하나로 무더운 여름날 얼마나 많은 인명을 구해냈을까요.',
		name: '케다마 레몬티',
	},
	28: {
		description:
			'간단하면서도 무게감 있는 얼음덩어리로, 몽환적인 단 시럽과 민트로 장식했습니다. 무더위를 날려보내는, 모두에게 기운을 주는 마법의 아이스 드링크입니다.',
		name: '큰 아이스크림',
	},
	1000: {
		description:
			'풍미와 과일향이 가득한 고급 사케입니다. 직사광선에 노출되면 색이 바래지니 주의해야 합니다.',
		name: '다이긴죠',
	},
	1001: {
		description:
			'고급 원두를 최신 기술로 갈아 내렸습니다. 집중하는 데에 좋아 지식인이나 밤새들이 많이 찾습니다.',
		name: '커피',
	},
	1002: {
		description:
			'요정들은 이슬을 모아 꿀과 섞어 달콤한 음료를 만듭니다. 가끔 그 노력의 산물을 놓고 가면, 사람이나 동물이 가져갑니다. 모든 질병과 노화를 치료해준다고 알려졌지만, 사실인지는 모릅니다.',
		name: '요정의 이슬비',
	},
	1003: {
		description:
			'캇파의 얼음과 우유, 설탕, 그리고 여러 가지를 한데 모아 갈아서 만든 음료입니다. 바깥세계에서는 쓰지 않을 오래된 기술도, 환상향에서는 아직도 사용합니다.',
		name: '크림 스무디',
	},
	1004: {
		description:
			'마녀가 만든 허브차입니다. 마시면 엄청나게 빨리 몸무게를 줄일 수 있습니다. 라벨에는 "마셔줘"라고 적혀있습니다. 좀 수상해 보이지만 깊은 맛이 있습니다.',
		name: '평범한 건강차',
	},
	2000: {
		description:
			'한 잔이면 그 어떤 강한 오니도 보내버린다는 전설의 술... 이라고 하지만 제가 만났던 모든 오니들은 전부 아무렇지 않게 마셨죠!? 전혀 신빙성 없는 전설인것 같네요.',
		name: '귀살주',
	},
	2001: {
		description:
			'캇파가 판매하는, 바깥 세계의 에너지 음료의 모조품. 주성분을 추출하고 이름만 바꾸면 누구나 만들 수 있다고는 하는데... 정말 괜찮을진 모르겠습니다.',
		name: '캇식스',
	},
	2002: {
		description:
			'지령전의 한정 디저트! 지령전의 요괴 자매를 모티브로 한 아기자기한 아이스크림은 지저의 요괴들에게 인기가 높습니다.',
		name: '코메이지 아이스크림',
	},
	3000: {
		description:
			'명련사의 특산물. 관세음보살의 오른손에는 버드나무가, 왼손에는 감로가 담긴 병을 들고 있으며, 버드나무 가지에 감로를 뿌리면 행운이 찾아온다는 전설이 있습니다. 이 전설을 듣고 찾아오는 신자들은 모두 한 잔씩 마실 겁니다.',
		name: '양지감로',
	},
	3001: {
		description:
			'도사들은 바깥 기술을 사용하여, 첫 번째 맥아즙에서 양조된 맥주만 추출하므로, 일반 맥주의 떫은 맛이 없어 순하고 부드럽습니다.',
		name: '키린',
	},
	4000: {
		description:
			'키진 세이자가 몰래 직접 주조한 도수가 매우 높은 무허가 술로, 오니조차 취하게 만들 수 있다고 합니다. 마을에 정식으로 유통되는 것도 아니고, 가격도 매우 비싸 그녀의 수하들이 반쯤 강매하며 유통하고 있습니다.',
		name: '천지무용',
	},
	4001: {
		description:
			'복숭아꽃으로 빚은 술. 요정들 사이에서는 이 술을 한 통 마시고 나면 복숭아꽃 선인을 만날 수 있다는 소문이 돕니다. 그냥 취해서 헛것을 보는 게 아닐런지...',
		name: '영인취',
	},
	5000: {
		description:
			'바다의 딸은 결국 물거품이 되어 사라졌다는 슬픈 전설이 있습니다. 이 칵테일의 독특한 맛은 아마 그 아이가 흘린, 바다로 돌아가고자 하는 눈물의 맛일지도 모릅니다.',
		name: '바다의 딸',
	},
	5001: {
		description:
			'마계의 독주에 뜨거운 커피를 넣고 제대로 섞일 때까지 저어준 후 맨 위에 부드러운 크림을 얹었습니다. 우유에서 술로, 그리고 커피로 진한 향과 맛이 이어지며, 몸 속의 냉기를 한 번에 없애줍니다.',
		name: '마계 커피',
	},
	5002: {
		description:
			'알긴산나트륨 용액에 염화칼슘 용액을 반응시켜 젤 막을 덩어리지게 하고 준비된 모히토를 그 안에 담아 투명한 방울을 만듭니다. 씹으면 방울이 터져 즙이 새어나오며, 맛과 멋 두 마리 토끼를 다 잡은 매우 매력적인 음료입니다.',
		name: '모히토 방울탄',
	},
	5003: {
		description:
			'과학자들의 세심한 연구 끝에 우주선에 실린 채 우주로 간 양조 효모 기술과 현대식 양조 기술을 결합해 상쾌하고 진한 맛을 이끌어냈습니다. 세밀한 거품이 오래 지속되고, 복숭아꽃의 향이 풍부한 독특한 맛의 맥주입니다.',
		name: '우주 맥주',
	},
	5004: {
		description:
			'커피를 순간적으로 진공에 노출시켜, 매우 낮은 기압으로 커피를 순간적으로 끓게 만든 뒤, 기화 반응으로 열을 잃은 커피가 급속도로 응고됩니다. 즉, 끓어오름과 얼어붙음을 반복한 이 커피야말로 달의 도시의 별미 음료입니다.',
		name: '위성 아이스 커피',
	},
	11000: { description: null, name: null },
	11001: { description: null, name: null },
	11002: { description: null, name: null },
	11003: { description: null, name: null },
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
