import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const BEVERAGE_LOCALIZATION_ZH_TW = {
	0: {
		description: '最普通的飲料，給一滴酒都不能沾的弱小妖怪準備的。',
		name: '綠茶',
	},
	1: {
		description:
			'居酒屋常見的，使用威士忌和果汁，蘇打勾兑的簡單調酒，降低了酒精度之後成為了誰都可以享受的飲料。',
		name: '果味High Ball',
	},
	2: {
		description:
			'居酒屋常見的，使用燒酒和果汁，蘇打勾兑的簡單調酒，比起HighBall更加有日式風格。',
		name: '果味SOUR',
	},
	3: {
		description:
			'在加入了大量的蘇打後，這種起泡清酒酸甜的口感，以及較低的酒精度，使其很受女性的歡迎；可以説是清酒的香檳版本。',
		name: '淇',
	},
	4: {
		description:
			'某位和幻想鄉很有淵源的大人物作為副業的產品，雖然是出於興趣而研製的啤酒，但意外地十分有人氣。',
		name: '超ZUN啤酒',
	},
	5: {
		description:
			'純米酒，有着妖精的祝福。度數不高，口感柔順，價格平易近人，是居酒屋受歡迎的選擇。',
		name: '日月星',
	},
	6: {
		description:
			'人間之里的人類自釀的梅子酒，因為喝起來很甜，所以經常有不瞭解的生物被它的後勁兒擊倒。',
		name: '梅酒',
	},
	7: {
		description:
			'傳説連天狗喝了也會開心地跳舞的美味清酒，在妖怪之山開一次店就可以驗證了吧。不同於其他無色的清酒，帶有淡淡的琥珀色。',
		name: '天狗踴',
	},
	8: {
		description:
			'由伏特加、番茄汁、檸檬片、芹菜根混合調製，甜、酸、苦、辣四味俱全。因血紅的顏色讓人聯想到某洋館的吸血鬼，故得此名。',
		name: '猩紅惡魔',
	},
	9: {
		description:
			'使用妖怪之山上被秋天的神明們所庇佑的大麥所釀造的大麥燒酒。',
		name: '神之麥',
	},
	10: {
		description:
			'鬼傑組的戰利品之一，因為水獺靈把敵組的戰利品擺在地上的樣子彷彿祭典，於是隨便取的名字。實際上好像是相當高級的純米大吟釀。',
		name: '水獺祭',
	},
	11: {
		description:
			'針對幻想鄉居民口味改良的威士忌，在保留威士忌獨有的氣味的同時也有着順滑的口感。',
		name: '曉',
	},
	12: {
		description:
			'傳説中由麻雀釀的酒。將米粒藏入截斷的竹中，當竹中有水時，日經月累便成佳釀。據説喝了此酒會舞無休止，是帶着“詛咒”的美味呢。',
		name: '雀酒',
	},
	13: {
		description:
			'使用檸檬，佛手柑，和女僕長精心挑選的紅茶品種烘培出帶有獨特香味的紅茶飲料，為了擴張紅魔館的威嚴，非常普通地以紅魔館命名。',
		name: '紅魔館紅茶',
	},
	14: {
		description:
			'將冰淇淋融化在咖啡中的做法，對於怕苦又需要咖啡提神的人來説是再好不過的飲料。“我只是需要提神，並不是怕苦。”——帕秋莉',
		name: '阿芙加朵',
	},
	15: {
		description:
			'洋館的女僕特製的紅葡萄酒，酒體豐滿，因為好像不是正常的時間下釀造出來的，總有一種霧氣般的朦朧感。',
		name: '紅霧',
	},
	16: {
		description:
			'微苦的橙味為主，香氣撲鼻，入口柔順。最近非常流行。“聽説現世很流行，大小姐派我去學，結果受不了苦味讓我加大橙子和味美思的劑量，最後完全變成橙汁糖漿了…”——不願透露姓名的女僕長',
		name: '尼格羅尼',
	},
	17: {
		description:
			'濃烈的北方威士忌和杏仁利口酒混合，非常古典的調酒。口感也相當硬漢，普通的妖怪應付不來。“大小姐聽説兇猛的妖怪喜歡喝這種，派我去學，喝完都快哭出來了還要強作威嚴地説好喝。”——不願透露姓名的女僕長',
		name: '教父',
	},
	18: {
		description:
			'輕鬆愉快的餐後酒，薄荷和奶油為主的口感。比起酒精飲料更像甜品。“好像是守矢的巫女從外面帶過來的配方，堂而皇之地冠了自己的名字！説起來那家夥在外界能喝酒嗎？啊，這玩意兒也完全不像酒就是了，怪不得她會喜歡，嘖。”——不願透露姓名的巫女',
		name: '風祝',
	},
	19: {
		description:
			'來自某個古國的習俗，在冬至日釀造的酒，色澤金黃，清甜甘冽，加上桂花的香氣，無論冰着喝還是熱着喝都非常可口。',
		name: '冬釀',
	},
	20: {
		description:
			'比起十五夜的月亮是滿月，也許更想留下十四夜時期待的心情。以這樣的感覺釀造的高級清酒，也許只有它才配得上迷途竹林所見到的月亮吧。',
		name: '十四夜',
	},
	21: {
		description:
			'如果不使用火鼠裘來承裝也許就會燒起來的烈酒，幾乎無人能承受其辣度的超級辣口燒酒。',
		name: '火鼠裘',
	},
	22: {
		description:
			'幾乎是日本茶中最高級的茶葉，需要用較低的水温來沖泡，甘醇飄香，口感獨特。',
		name: '玉露茶',
	},
	23: {
		description:
			'使用月之都先進技術製作的高級氣泡水，迸發的口感有如火箭一般，只需要加一片檸檬就是完美的飲品。',
		name: '月面火箭',
	},
	24: {
		description:
			'温潤純白的飲品，無論小孩還是大人都適合飲用，好處多到説不完。',
		name: '牛奶',
	},
	25: {
		description:
			'據説是來自外界的人氣飲料，用紅色柚子這種水果榨汁，尤其是盛夏飲用，健康祛暑，讓人回甘無窮。',
		name: '紅柚果汁',
	},
	26: {
		description:
			'瓶口有彈珠的設計，只要向下按壓將彈珠打入汽水內，引起二氧化碳的劇烈反應。此時將瓶中沸騰又冰冷的氣泡一飲而盡的話，你會在胃中感受到整個夏天。',
		name: '波子汽水',
	},
	27: {
		description:
			'彷彿是融化在可口的冰沙中的毛玉，佐以凍檸口味，在炎熱的夏季，不知拯救了多少人命。',
		name: '冰山毛玉凍檸',
	},
	28: {
		description:
			'簡單又富有重量感的大冰塊，有夢幻的甜蜜和薄荷的調味。夏天解暑、讓所有人滿血復活的神奇冰品。',
		name: '大冰棍兒!',
	},
	1000: {
		description:
			'最高級的清酒，口感極佳而且有水果的香味。必須避光，在太陽的照射下顏色會迅速變深。',
		name: '大吟釀',
	},
	1001: {
		description:
			'用現代磨製工藝將稀少的咖啡豆磨成粉末製作的飲品，能夠奇妙地提升精神和集中力，是腦力勞動者不可或缺的神奇飲料。',
		name: '咖啡',
	},
	1002: {
		description:
			'妖精們採集露水、和花蜜混合的甘甜飲料。由於妖精們會忘記自己的勞動產品，所以常被動物或者人類採走。傳説可以治癒百病甚至起死回生，但似乎是謠言。',
		name: '妖精雨露',
	},
	1003: {
		description:
			'河童們窖藏的天然冰塊，和牛乳、糖等配料一起在鐵桶裏打碎，加速攪拌得到的產物，是古法製造的冰激凌。雖然現世已經不再用這種傳統方法製作，但在幻想鄉作為特色依舊很受歡迎。',
		name: '古法奶油冰沙',
	},
	1004: {
		description:
			'魔女研製的藥茶，據説瘦身功效拔羣。標籤上寫着“喝掉我”，雖然有點可疑但它神奇的豐富味道着實令人驚嘆。',
		name: '普通健身茶',
	},
	2000: {
		description:
			'傳説一杯就能讓酒量無底洞一般的鬼族醉生夢死的傳説之酒……但我見到的是……鬼明明都當做涼白開來喝的？！傳説一點都不靠譜啊。',
		name: '鬼殺',
	},
	2001: {
		description:
			'河童販賣的外面世界某種提神功能性飲料的山寨品，據説提取了主要成分、換個名字誰都可以製作……但這樣真的沒問題嗎？',
		name: '氣保健',
	},
	2002: {
		description:
			'地靈殿的限定紀念甜品！以地靈殿的覺妖怪姐妹為原型設計的可愛甜筒，在地底妖怪中有很大的人氣。',
		name: '古明地冰激凌',
	},
	3000: {
		description:
			'命蓮寺特產。傳説觀音菩薩右手持楊枝，左手持盛有甘露的淨瓶，用楊柳枝撒下甘露會帶來好運。許多慕名而來的信徒都會飲上一杯。',
		name: '楊枝甘露',
	},
	3001: {
		description:
			'道士們採用外界的技術，只提取第一道麥汁釀造的啤酒，因此沒有一般啤酒的澀味，口感更純更順。',
		name: '麒麟',
	},
	4000: {
		description:
			'鬼人正邪親自釀造的酒精濃度超級高、據説連鬼都能醉倒的無牌酒。在村子沒有銷路，價格還不便宜，只能靠手下以半嚇半賣的方式銷售出去。',
		name: '天地無用',
	},
	4001: {
		description:
			'桃花釀的酒。妖精之間有着飲一壺桃花酒，醉卧花間，就會遇到桃花仙的傳説。這怎麼看都是喝醉了吧？',
		name: '伶人醉',
	},
	5000: {
		description:
			'傳説海的女兒最終為愛化為泡沫，這杯有着獨特口味的雞尾酒，或許就是她當時流下的、替她迴歸海中的眼淚。',
		name: '海的女兒',
	},
	5001: {
		description:
			'在魔界的烈酒裏加入熱咖啡，攪拌到融化後，再在頂部蓋上一團細膩的奶油，由奶香到酒香再到咖啡香層次分明，口感醇厚，還能驅除一身的寒意。',
		name: '魔界咖啡',
	},
	5002: {
		description:
			'利用海藻酸鈉溶液和氯化鈣溶液反應形成一層海藻酸鈉凝膠薄膜，將調好的莫吉託酒包裹在內，做成一個球狀的透明凝膠。咬一口就爆漿，達到視覺和味覺的雙重驚喜，看起來非常誘人。',
		name: '莫吉托爆漿球',
	},
	5003: {
		description:
			'由航天器搭載到太空的釀酒酵母，經過科學家們精心研製，將空間酵母技術與現代啤酒工藝相結合，釀造出這款口感清爽醇厚、泡沫細密持久、飽含桃花香味的獨特啤酒。',
		name: '太空啤酒',
	},
	5004: {
		description:
			'咖啡被瞬間暴露於真空中，會因為過低的氣壓導致瞬間沸騰，因汽化現象而被不斷帶走熱量的水最終會在沸騰的過程中凝固。這種一邊沸騰一邊冰凍的咖啡是月都的特色飲料。',
		name: '衞星冰咖啡',
	},
	11000: { description: null, name: null },
	11001: { description: null, name: null },
	11002: { description: null, name: null },
	11003: { description: null, name: null },
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
