import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const GENERAL_ITEM_LOCALIZATION_JA = {
	0: {
		description:
			'みなさまのおかげです！「東方夜雀食堂」の体験版の先行配信が五日で一万セールスを突破しました。この場を借りて最大限の感謝を…！今後も良いゲームを提供できるよう頑張ります！',
		name: '販売本数一万円本達成感謝状',
	},
	1: {
		description:
			'「アガサクリスQ」と書かれたサイン色紙。推理小説作家で、そこそこの読者がいるらしい。欲しがっているファンに渡せば何かと交換してもらえるかも？',
		name: 'サイン色紙',
	},
	2: {
		description:
			'香霖堂で買い物するときに少しだけ割引きしてもらえる。ただし残念ながら有効期間は一日のみ。',
		name: '香霖堂クーポン券',
	},
	30: {
		description:
			'守矢小神社から出てきた金色のカエルコイン。集めると何かいいことがあるかも？',
		name: 'ゴールドカエルコイン',
	},
	48: {
		description:
			'紅美鈴のサイン入りチェキ。筆跡からは彼女が一点一画を書き下ろす姿が想像できる。',
		name: '紅美鈴のチェキ',
	},
	49: {
		description:
			'土龍であるツチノコがやがて天に昇り天龍となる前に持っていた酒甕。あらゆる点でツッコミどころがあるが………まあとにかく買った買った！',
		name: 'ツチノコのカメ',
	},
	52: {
		description:
			'因幡てゐがくれた幸運を呼ぶ四葉のクローバー。なぜか翌日にはなくなってしまうようだ。幸運の白兎がくれたものなんだから、持ってれば何か良いものでも拾えたりするんじゃない？',
		name: '四葉のクローバー',
	},
	53: {
		description:
			'どうやら別の世界の「私」のお話みたい。やってることはコッチとそんなに変わらないみたいだけど、やっぱりとっても楽しそう！ポスターにはなんて書いてあるのかしら……。続きは『深夜雀食堂』で。地下室に行けばいつでもこのチラシを繰り返し読み返せます……って、チラシを読み返すヤツがどこにいるのよ！',
		name: 'ねことうふ先生の異世界PR漫画',
	},
	2014: {
		description:
			'怪奇料理大会の推薦状で、番号06040807。推薦人の欄に「黒谷ヤマメ」と書かれている。',
		name: '黒谷ヤマメの推薦状',
	},
	2015: {
		description:
			'怪奇料理大会の推薦状で、番号02140410。推薦人の欄に「水橋パルスィ」と書かれている。',
		name: '水橋パルスィの推薦状',
	},
	2016: {
		description:
			'怪奇料理大会の推薦状で、番号01080727。推薦人の欄に「星熊勇儀」と書かれている。',
		name: '星熊勇儀の推薦状',
	},
	2017: {
		description:
			'怪奇料理大会の推薦状で、番号03101010。推薦人の欄に「古明地さとり」と書かれている。',
		name: '古明地さとりの推薦状',
	},
	2018: {
		description:
			'怪奇料理大会の推薦状で、番号02220015。推薦人の欄に「火焔猫燐」と書かれている。',
		name: '火焔猫燐の推薦状',
	},
	2019: {
		description:
			'怪奇料理大会の推薦状で、番号10260009。推薦人の欄に「霊烏路空」と書かれている。',
		name: '霊烏路空の推薦状',
	},
	5015: {
		description:
			'魅魔さんの依頼品！適切な試食者を選んで送り出すには、なくさないように気をつけなければなりません。',
		name: '特殊なぷぷよ果実',
	},
	10000: { description: null, name: null },
	10001: { description: null, name: null },
	10002: { description: null, name: null },
	10003: { description: null, name: null },
	10004: { description: null, name: null },
	10005: { description: null, name: null },
	10006: { description: null, name: null },
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
