import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const GENERAL_ITEM_LOCALIZATION_KO = {
	0: {
		description:
			'열화와도 같은 성원에 감사드립니다! 야작식당이 얼리 억세스 개시 5일만에 1만장의 판매고를 달성했습니다. 이 장소를 빌려 여러분께 감사를 표합니다...! 앞으로도 최선을 다해 최고의 게임을 만들겠습니다!',
		name: '10000장 판매 달성 기념 편지',
	},
	1: {
		description:
			'인기 많은 유명 소설가, 아가사 크리스Q의 서명이 적힌 색지. 누군가 이걸 갖고 싶어하는 사람과 무언가 교환하는데 쓸 수 있을지도...?',
		name: '서명 적힌 색지',
	},
	2: {
		description:
			'향림당에서 물건을 살 때 할인을 받을 수 있습니다. 불행히도, 유효기간이 하루밖에 되질 않습니다.',
		name: '향림당 할인권',
	},
	30: {
		description: '모리야 신사의 분사에서 주운 금빛 동전입니다.',
		name: '금색 개구리 코인',
	},
	48: {
		description:
			'메이링이 준 사인입니다. 필적을 보면 그녀가 진심을 담아 글을 쓴 모습이 상상됩니다.',
		name: '메이링의 사인',
	},
	49: {
		description:
			'토룡 츠치노코가 승천해 용신이 되기 전 들고 있던 병이라고 합니다만, 그 진위는... 에이, 알 게 뭐람!',
		name: '츠치노코의 병',
	},
	52: {
		description:
			'테위에게서 받은 "행운을 불러일으키는 토끼풀"입니다. 내일 사라질 것 같습니다. 행운의 흰 토끼에게서 받은 물건이니, 재료를 수집할 때 무엇인가 좋은 일이 일어나지 않을까요?',
		name: '행운의 클로버',
	},
	53: {
		description:
			'다른 세계에서 벌어지는 "나"의 이야기를 담은 책 같습니다. 여기서 벌어지는 일과 별반 다를 바 없어 보이지만, 뭔가 흥미로운걸요! 표지에 적혀있는 문구는... 이어지는 내용은 「심야작식당」에서 볼 수 있다고 합니다. 지하실에도 포스터가 붙여져 있지만... 누가 광고를 두 번 씩이나 보겠어요?',
		name: '네코토푸 선생님의 이세계 선전 만화',
	},
	2014: {
		description:
			'괴식 요리 대회를 위한 추천장입니다. 시리얼 번호 06040807로, 추천인란에 "쿠로다니 야마메"가 적혀 있습니다.',
		name: '야마메의 추천장',
	},
	2015: {
		description:
			'괴식 요리 대회를 위한 추천장입니다. 시리얼 번호 02140410으로, 추천인란에 "미즈하시 파르시"가 적혀 있습니다.',
		name: '파르시의 추천장',
	},
	2016: {
		description:
			'괴식 요리 대회를 위한 추천장입니다. 시리얼 번호 01080727로, 추천인란에 "호시구마 유기"가 적혀 있습니다.',
		name: '유기의 추천장',
	},
	2017: {
		description:
			'괴식 요리 대회를 위한 추천장입니다. 시리얼 번호 03101010으로, 추천인란에 "코메이지 사토리"가 적혀 있습니다.',
		name: '사토리의 추천장',
	},
	2018: {
		description:
			'괴식 요리 대회를 위한 추천장입니다. 시리얼 번호 02220015로, 추천인란에 "카엔뵤 린"이 적혀 있습니다.',
		name: '오린의 추천장',
	},
	2019: {
		description:
			'괴식 요리 대회를 위한 추천장입니다. 시리얼 번호 10260009로, 추천인란에 "레이우지 우츠호"가 적혀 있습니다.',
		name: '우츠호의 추천장',
	},
	5015: {
		description:
			'미마 씨의 요청품! 시식 대상으로 적당한 사람을 잘 골라야 합니다. 잃어버리면 큰일날 것만 같은 기분이 듭니다.',
		name: '신기한 뿌요뿌요 열매',
	},
	10000: { description: null, name: null },
	10001: { description: null, name: null },
	10002: { description: null, name: null },
	10003: { description: null, name: null },
	10004: { description: null, name: null },
	10005: { description: null, name: null },
	10006: { description: null, name: null },
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
