import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const FOOD_LOCALIZATION_JA = {
	0: {
		description:
			'居酒屋でよく提供される簡単な味噌汁。昆布が幻想郷に伝来したばかりの頃、里の人が試しに出汁をとったら異様に旨かったため、幻想郷で急速に広まった料理。',
		name: '漁師の味噌汁',
	},
	1: {
		description:
			'居酒屋でよく提供される簡単な味噌汁。豆腐を使ったさっぱり系でシンプルな味わい。',
		name: '豆腐の味噌汁',
	},
	2: {
		description:
			'肉と野菜のバランスが取れたスープ。猪の肉と昆布を煮込んで、いち早く体にエネルギーを供給できる美味しいスープ。',
		name: 'スタミナスープ',
	},
	3: {
		description:
			'豚肉とマスを一緒に燻製したもの。手軽で美味しく、また保存も効く一品。',
		name: '豚肉とマスの燻製',
	},
	4: {
		description:
			'店の看板料理。「赤い提灯を掲げた店は焼き鳥を出す」という先入観をなくすべく、店主は鳥目に効く八目鰻を看板食材にした。一説によると、昔は大層な珍味だったようだ。',
		name: '八目鰻の蒲焼',
	},
	5: {
		description:
			'牛肉と玉葱とかぼちゃを串焼きにしたもの。玉ねぎのツンとした風味とかぼちゃの甘みがうまく作用し、肉の脂っこさを感じさせない一品。',
		name: 'スタミナ串',
	},
	6: {
		description:
			'鬼との賭けに勝利した剣士が始めたと伝わる流派の串焼き。特に野性味の強い肉を串焼きにすることで、天に上り詰めるような気力を得ることが出来る驚愕の一品。',
		name: '二天一流',
	},
	7: {
		description:
			'普通のおにぎり。昆布を入れて握るだけで完成する。簡単に作れる定番料理。',
		name: 'おにぎり',
	},
	8: {
		description:
			'よく見かける安いおにぎり。具に焼豚を入れることで、食べ応えのある一品となっている。',
		name: '焼豚おにぎり',
	},
	9: {
		description:
			'よく見かける安いおにぎり。具材にはマスと玉ねぎが入っており、マスの繊細な味わいと玉ねぎのピリッとした辛さが合わさって、味も栄養価も優れた一品。',
		name: 'ぽかぽかおにぎり',
	},
	10: {
		description:
			'創作料理の一種。桜色の刺身を銀シャリの上に散らすことによって、桜が雪の上に舞い落ちるような美しさを感じさせる一品。',
		name: '雪見桜',
	},
	11: {
		description: '豚肉と唐辛子を主な食材とする家庭料理で、味は濃いめ。',
		name: '青椒肉絲',
	},
	12: {
		description: '夏に食べるとスッキリする、簡単に作れるおつまみ。',
		name: '冷奴',
	},
	13: {
		description:
			'看板料理。特別なタレで焼いたジューシーな八目鰻は、香りだけでよだれが止まらなくなるだろう。',
		name: '八目鰻の蒲焼丼',
	},
	14: {
		description:
			'ジャガイモで作る料理。外はサクサクで中はホクホクとしており、揚げ物料理の中でも特に人気が高い。',
		name: 'コロッケ',
	},
	15: {
		description:
			'新鮮な野菜と上質な黒豚肉を煮込んだ鍋料理。脂っぽさはなく、芳醇な香りとまろやかなコクを楽しむことが出来る。農家にとって最高なおもてなしとなる一品。',
		name: '黒豚汁',
	},
	16: {
		description:
			'よく見かける家庭料理。ふっくらとしたごはんの上にかけられた香ばしいつゆが、豚肉の味と調和して食欲が止まらない。',
		name: '豚丼',
	},
	17: {
		description:
			'よく見かける家庭料理。ふっくらとしたごはんの上にかけられた香ばしいつゆが、牛肉と合わさり箸が止まらない。',
		name: '牛丼',
	},
	18: {
		description:
			'当店の看板料理。奇妙な顔をした八目鰻は新しいものを好む幻想郷で一世を風靡した。揚げると外はサクサク、中はなめらかで、多くの人々に愛される一品。',
		name: '八目鰻の天ぷら',
	},
	19: {
		description:
			'新鮮な野菜を使ったサラダ。爽やかな味わいで、口に残った油を洗い流すことができる。なぜか若い女性達からダイエット食として信仰されている。',
		name: '野菜サラダ',
	},
	20: {
		description:
			'新鮮な八目鰻とフグを使った、昆布だしの豪華な鍋。煮る際に雪のような純白の泡が立つことから名づけられた。とても高級な、幻想郷の家庭料理。',
		name: '白雪鍋',
	},
	21: {
		description:
			'豆腐の煮込み。滑らかな食感を楽しむことができ、栄養価も高い。居酒屋で良心的なお値段でよく提供されている。',
		name: '湯豆腐',
	},
	22: {
		description:
			'残った食材を一緒くたに煮込んだ鍋。食材ロスを防ぐことが出来る、一石二鳥の美味しい料理。',
		name: '雑炊',
	},
	23: {
		description:
			'和食の代表格。ワサビと醤油で頂くことで、鮭やマグロの鮮度をより楽しめる絶品料理。',
		name: '刺身の盛り合わせ',
	},
	24: {
		description:
			'高級食材を贅沢に使った鍋。巧みな火加減によってすべての食材の旨味を上手く引き出している。肉汁たっぷりで柔らかく、深い味わいで記憶に残り続ける逸品。',
		name: '極上鍋',
	},
	25: {
		description:
			'豚肉と野菜をじっくり煮込んだスープは、ラーメンの魂といえるだろう。濃厚でまろやかな豚骨スープに弾力のある麺が合わさることで、お腹も心も大満足。',
		name: 'とんこつラーメン',
	},
	26: {
		description:
			'上質な牛肉とトリュフを煮込んだ鍋。ピリ辛の味付けもあってか、煮込んだ際にマグマのようにブクブクすることで名づけられた。漂う匂いで客の食欲をそそる一品で、現在は辛くないバージョンも作られている。',
		name: '火山鍋',
	},
	27: {
		description:
			'セミの抜け殻は目と喉に効用のある薬として服用されている。揚げたものはカリッとして美味しく、大人気である。',
		name: '蝉の抜け殻の唐揚げ',
	},
	28: {
		description:
			'早朝に採取した露で煮た卵は、通常のものよりも甘味が強いという。トロっとした食感を出すために半熟になるよう火加減を調整している。少し揺らしただけでも黄身が出てきそうなほど柔らかい。',
		name: 'ゆで卵',
	},
	29: {
		description:
			'古から存在する、奇跡の花を用いて作られるお菓子。飽きの来ない甘さとともに、口の中に広がる香りを食後までに楽しむことが出来る。一説によると、その香りは一番懐かしい記憶を蘇らすようだ。',
		name: '雲華餅',
	},
	30: {
		description:
			'黒光を放つ、エスニック料理の最高峰！その香りは何処までも漂い、味は底なしの深さを誇るという。熊を倒すことは出来ないので、本物の熊の手で作っているわけではない。ただし本物よりも何百倍も美味しいという。',
		name: 'エセ熊の手の姿煮',
	},
	31: {
		description:
			'橙秘伝のスパイスで小魚を漬け込んでから干したもの。サクサクの食感で香ばしい。保存がきくため、どの家庭でも一瓶は置いてある。',
		name: '秘伝煮干し',
	},
	32: {
		description:
			'新鮮な野菜や果物を花のように飾り切りしたもの。材料はシンプルだが、熟練の包丁さばきが必要となる。',
		name: '野菜の飾り切り',
	},
	33: {
		description:
			'非想天から伝わったレシピ。新鮮な桃と早朝に採った露を用いる。香りと甘さだけでなく、疫病退散と美容の効果がある不思議な一品。',
		name: '桃の甘露煮',
	},
	34: {
		description:
			'目利き屋に選りすぐられた上質な甘エビと桃を和えた高級料理。一説によると、外界では宴席の場でしか見かける機会がないという。',
		name: '桃とエビの甘和え',
	},
	35: {
		description:
			'よく作られる家庭料理。伝説によると、稲荷神の使いが一番好む食べ物らしい。',
		name: '油揚げ',
	},
	36: {
		description:
			'孔子廟の総本山にある銀杏の実で調理したことから有名になったレシピ。甘い香りとモチモチとした食感が楽しい一品。二日酔いを治したり、咳を止めたりすることができる。',
		name: '銀杏の甘あえ',
	},
	37: {
		description:
			'新鮮なマスと昆布を使った汁物。生臭さはなく、濃厚な旨味が口いっぱいに広がる。',
		name: '真・漁師の味噌汁',
	},
	38: {
		description:
			'魔理沙が見つけてきたキノコをマリネし、衣をつけて揚げた料理。肉にも負けない美味しさ。',
		name: '焼きキノコ',
	},
	39: {
		description:
			'よく作られる家庭料理。それでも火の加減に細心の注意を払わないと、豆腐の滑らかさを最大限引き出すことが出来ない。',
		name: '煮豆腐',
	},
	40: {
		description:
			'よく見かける家庭料理。豚肉に小麦粉をまぶして揚げた匂いは、近所の子供を引き寄せるほど美味しそう。',
		name: 'とんかつ',
	},
	41: {
		description:
			'シンプルであり複雑でもある。火加減と食材の選び方で雰囲気ががらりと変わる基本的な洋食。ちなみに、紅魔館の例のお方はレアがお好き。',
		name: 'ステーキ',
	},
	42: {
		description:
			'具材をよく炒めた後に生米を入れることで、米と具材の香りと味わいを十分に引き出す。とある外界の半島から伝わった料理。',
		name: 'リゾット',
	},
	43: {
		description:
			'味付けしたフィレ肉とトリュフをパイ生地で包んで焼き上げたもの。バターの香ばしさにフィレ肉とトリュフの香りが混ざり合った究極の一品。外界では手順の複雑さで難易度が高い料理として知られている。',
		name: 'ビーフ・ウェリントン',
	},
	44: {
		description:
			'ポーチドエッグとともに炭水化物を大量摂取できるもの。ブランチの定番。',
		name: 'エッグベネディクト',
	},
	45: {
		description: '簡単な朝食。用意した生地を焼いて蜂蜜をかけるだけ。',
		name: 'パンケーキ',
	},
	46: {
		description:
			'英国式アフタヌーンティーの定番。外はサクサク、中はフワフワ。クロテッドクリームやジャムにつけて食べるのが一般的。',
		name: 'スコーン',
	},
	47: {
		description:
			'皮がパリパリになるまで鮭を焼き、みずみずしい新鮮な筍を添える——外界ではアスパラガスを用いたものが一般的だが、これも幻想郷のアレンジと言えるだろう。',
		name: '鮭のムニエル',
	},
	48: {
		description:
			'一般家庭でもよく作られるシチュー。作り方は簡単だが、パンと合わせてもそのまま食べても大満足になるとても便利な料理。',
		name: 'クリームシチュー',
	},
	49: {
		description:
			'紅美鈴の故郷から伝わった特殊なレシピで、料理方法は少し複雑。忘れられない唯一無二の味わいがする。',
		name: '中華風チャーシュー',
	},
	50: {
		description:
			'紅美鈴の故郷から伝わったレシピ。色も味も香りも良く、元気になる。',
		name: '豚の薬膳スープ',
	},
	51: {
		description:
			'「竹取姫なんて、大体これと一緒だろ！」——藤原妹紅いわゆる竹筒飯。永遠亭にて採取された新鮮な食材とごはんを一緒に竹の中に入れ、蒸すことで竹の爽やかな香りをご飯にまとい、豚肉の油分を中和した炊き込みご飯。',
		name: '竹取姫',
	},
	52: {
		description:
			'「あらまぁ、不死鳥の腹の中もきっとこんな感じよね～」——蓬莱山輝夜より小麦粉の生地を七面鳥の形にし、腹の中にたっぷりと定番の食材を詰め、外に蜂蜜を塗って焼き上げる。パリパリとした皮と、ジューシーな中身を楽しむことが出来る。',
		name: '不死鳥',
	},
	53: {
		description:
			'永遠亭の特産品で、改良したお団子。餡に高級食材の月光草を入れ、見た目がかわいいだけでなく、「月のような食感」も味わえる。',
		name: '月見団子',
	},
	54: { description: '普通の大福。みんな大好きな和菓子。', name: '大福餅' },
	55: {
		description:
			'おみやげの定番とされる和菓子。白桃の餡を加えると、人を魅了する淡い桃色が浮かび上がる。',
		name: '桃味生八ツ橋',
	},
	56: {
		description:
			'外界では「○○の恋人」というおみやげが大人気のようだ。永遠亭もそれに負けじと勝負してきた！',
		name: '月の恋人',
	},
	57: {
		description:
			'花札の役から生まれた料理。イノシシ肉と鹿肉と花を一緒に煮込むことで、素材そのものの美味しさを最大限引き出した繊細な料理。',
		name: '猪鹿蝶',
	},
	58: {
		description: 'おいしいというより楽しい、エンターテインメント料理。',
		name: '流しそうめん',
	},
	59: {
		description:
			'最もシンプルな筍の食べ方。豚肉の出した油が筍の旨味を引き出す。',
		name: '筍炒め',
	},
	60: {
		description: '竹を器にして蒸した茶碗蒸しは、ひと味違う。',
		name: '竹筒茶碗蒸し',
	},
	61: {
		description:
			'さまざまな高級な肉を串に刺しただけの料理。一口でお腹いっぱいになるほどボリューミーである。しかし輝夜の脅迫とネームバリューで高級料理として君臨することになった。',
		name: '蓬莱の玉の枝',
	},
	62: {
		description:
			'珍しい黒色の豆腐で、近寄りがたいほど臭い…これは本当に食べられるのか？しかし食べたら箸が止まらなくなると経験者は語る。',
		name: '臭豆腐',
	},
	63: {
		description:
			'七色のオーラを放つ高級な焼き小籠包。噂によると、豚肉以外の具材を断固反対する焼き小籠包原理主義者がいるらしい。',
		name: '虹色焼き小龍包',
	},
	64: {
		description:
			'日本で特に有名な中華料理。一風変わった調理法を用いるうま辛い豆腐料理。ごはんと一緒に食べるとクセになるほどおいしい。',
		name: '麻婆豆腐',
	},
	65: {
		description:
			'本格的な四川料理。新鮮で脂ののった魚肉を真っ赤な唐辛子と絡めて油で煮込んだ料理。魚と香辛料の香りが際立つ絶品である。',
		name: '魚の四川風煮込み',
	},
	66: {
		description:
			'元々はクロステストの参加者専用の特別レシピだが、3年間ずっと全コンプ勢を悩ませてきました。今回は獲得できるようになりました……',
		name: '月餅',
	},
	67: {
		description:
			'三色の四角い毛玉アイスクリーム。色も味も多くの人に好まれている、誰もが買う定番デザート。',
		name: '毛玉三色アイス',
	},
	68: {
		description:
			'四角形の火山毛玉の形から作られている、溶岩のような煮込み豆腐。辛い物が好きな人々から絶賛されている。',
		name: '毛玉溶岩豆腐',
	},
	69: {
		description:
			'紅い悪魔の帽子をモチーフに作られた、夢のようなスイーツ。ナイフを入れると、血液のような甘いソースがとろりと流れ出す。',
		name: 'スカーレットデビルケーキ',
	},
	70: {
		description:
			'無意識の妖怪の帽子をモチーフに作られた、深みのあるスイーツ。ナイフを入れると、底の見えない暗闇が広がっており、すべてのことを忘れられるような香りがする。',
		name: '無意識妖怪ムース',
	},
	71: {
		description:
			'紅美鈴の故郷から海を渡ってきた有名なレシピ。小麦粉で作ったコシのある皮で好きな食材を包み、お湯で煮ると素晴らしい食べ物になる。外見は地味だが、中身は世の中の宝を包んでいる。',
		name: '水餃子',
	},
	72: {
		description:
			'紅美鈴の故郷から海を渡ってきた有名なレシピ。弾力のあるもちを小さく丸め、その中に甘い餡を包み、お湯で煮ると素晴らしいデザートになる。外見は地味だが、中身は世の中の甘さを包んでいる。',
		name: 'あん入りだんご',
	},
	1000: {
		description:
			'「天婦羅」とも書かれる。新鮮なエビを衣につけ、揚げ鍋に入れて黄金色になるまで揚げる、お子さまも大好きな一品。',
		name: 'エビ天ぷら',
	},
	1001: {
		description:
			'魚のすり身に適量の蜂蜜を加えて味を調え、鍋に入れて黄金色に揚げて食べる。揚げたてが一番おいしい。',
		name: 'さつま揚げ',
	},
	1002: {
		description:
			'高級焼肉を山のように積み上げた料理は、見た目も量もパワフルで、問答無用に腹ペコな客人を満たす。',
		name: '肉のデカ盛',
	},
	1003: {
		description:
			'きゅうりを切って浅く漬けると、さっぱりして不思議な風味が醸し出される。',
		name: 'きゅうりの漬物',
	},
	1004: {
		description:
			'甲羅グラタンは、蓋を開ける前からすでに香ばしい香りが立ち込めている。しかし、その香りはまだ前菜にすぎない。カニのハサミを裂き、ぷりっとした白くてふっくらとした身を取り出し、そこからじっくりとスープを吸い込めば、カニ本来の旨味がようやく完全に溶け合い、解き放たれるのだ。',
		name: '甲羅グラタン',
	},
	1005: {
		description:
			'人間が進化しても残った尾骨で、河童一族の大好物と言われている尻子玉。昔は血生臭い方法で人間から奪っていたが、時代が進むにつれて代替する料理が出来た。コストは高い。',
		name: '尻子玉モドキ',
	},
	1006: {
		description:
			'外の世界で流行っている街の軽食だそうで、生地とさまざまな食材を混ぜて鉄板の上で焼いたもの。そのアレンジのしやすさと庶民的な価格ですべての人に愛されている。',
		name: 'お好み焼き',
	},
	1007: {
		description:
			'こちらも外の世界で流行っている街の軽食だそうで、特製の生地の中にタコの足を入れる。もちもちした衣の下で弾けるタコの味は幸せを感じさせる。',
		name: 'たこ焼き',
	},
	1008: {
		description:
			'作り方は意外に簡単だが、食材の入手は非常に困難で、外の世界では超高級料理であり、誰もが夢見るものだという。',
		name: 'ウニの刺身',
	},
	1009: {
		description:
			'キノコと肉をスライスし、鍋に混ぜて炒める、非常に家庭的な料理である。',
		name: 'キノコの肉炒め',
	},
	1010: {
		description:
			'キノコ学を長い間専攻してきた人間の魔法使いが創り出した秘伝のレシピ。食材はすべて魔法の森産の新鮮なキノコから選ばれ、他のキノコよりも栄養価が高いと言われている。',
		name: '秘伝キノコ鍋',
	},
	1011: {
		description:
			'キノコを主役に、様々な食材を加えた料理は、金色に輝く光が強烈な存在感を放っており、その濃厚な食感は瞬時に人の魂を蒸発させ、一発で虜にすることができる。',
		name: '魔女の舞踏会',
	},
	1012: {
		description:
			'濃厚でクリーミーなスープから漂う魔性の香りは、一口味わえばスプーンが止まらない。作り方は簡単で、材料も容易に手に入り、極めて高い栄養価を持っている。',
		name: 'キノコのポタージュ',
	},
	1013: {
		description:
			'童話のヒロインが食べると体が急に大きくなる不思議なケーキだそうで、とても美味しい！でも体は大きくならない、やっぱりデマ？',
		name: 'カップケーキ',
	},
	1014: {
		description:
			'古典的な甘味に特殊な調理法を施し、幻想的な色を呈している。一度出会えれば、一生忘れられない鮮やかさがある。',
		name: '七色羊羹',
	},
	1015: {
		description:
			'魚を刺身にしてから酢飯にかぶせる、日本の代表的な料理の一つ。満腹感はもちろん味も抜群。長い発展の歴史を持っている。',
		name: '握り寿司',
	},
	1016: {
		description:
			'カボチャの中身を取り出し、エビと豆腐を入れて茶碗蒸しにする。甘くて美味しく、とても健康的である。',
		name: 'かぼちゃの茶碗蒸し',
	},
	1017: {
		description:
			'唐の国最強の料理を改造したもの。修行中の僧であっても、その匂いで戒律を捨ててしまうほどの素晴らしい一品。',
		name: '幻想仏跳牆',
	},
	2000: {
		description:
			'陰鬱な妖怪たちの間で流行しているおやつ。濃厚なチーズの中には、銀杏特有の苦味が混じっており、味覚に強い刺激を与えることができるが、私には全く理解できない。',
		name: 'どん底チーズ',
	},
	2001: {
		description:
			'酸味が好きな人にとって味覚の饗宴だが、酸味が嫌いな人には歯と舌への爆弾だ！マイナーな妖怪の中でしか流行しない奇妙なやり方。',
		name: '憂鬱フルーツパイ',
	},
	2002: {
		description:
			'旧地獄で最もポピュラーな軽食、さまざまな食材を入れた後、唐辛子の刺激を加えている。汗だくになりながらも、止まらない魅力たっぷりの料理です。',
		name: '絶叫おでん',
	},
	2003: {
		description:
			'虫類の甲羅を砕いて麺に混ぜ込み、食べるとカリカリするという、異世界の猟奇的で奇妙な料理。',
		name: 'カリカリ旋風',
	},
	2004: {
		description:
			'パイから魚の頭が出てきて、地底の天井を見ているようで、地獄に裏打ちされた絶望的な雰囲気に満ちていた。',
		name: '天井ゲイザーパイ',
	},
	2005: {
		description:
			'地上でも地下でも、カブトムシは力と無敵の象徴だ！その力に憧れて生まれた甲冑料理です!',
		name: 'カブト餅',
	},
	2006: {
		description:
			'お酒好きにはたまらないボリュームおつまみ！立派でワイルドな獅子頭に辛口のお酒を合わせた、鬼の朝の一杯！',
		name: '獅子頭',
	},
	2007: {
		description:
			'普通の玉子焼きを何倍も大きくしたのが、鬼の間で流行しているジャンボ玉子焼きです！その存在感に豪快な人は燃え上がる！',
		name: 'ジャンボ玉子焼き',
	},
	2008: {
		description:
			'華麗な祭り船の造形、立派な魚の刺身が並び、周囲には鮮度を保つために作られた氷霧が漂い、祭の焦点となる',
		name: '大江戸船まつり',
	},
	2009: {
		description:
			'ピンクのかわいいスイーツ、柔らかくて弾力性があり、甘い香りで世界中の女の子が拒否できない無敵のスイーツになりました。',
		name: '桜プリン',
	},
	2010: {
		description:
			'酸味を大幅にアップさせた恐ろしいプリン。一口食べるだけで眠気を覚ます効果があるものの、あまりにも凶暴な味付けのため、口の健康によくありません……',
		name: '目覚ましプリン',
	},
	2011: {
		description:
			'究極の添加物、１粒でドーパミンやアドレナリンなど多くの興奮要素をマックスにする禁断の甘いもの。妖怪は食べて一晩中踊り狂うことができるが、興奮が過ぎると「燃え尽きた」と思わずにはいられない。',
		name: '燃え尽きプリン',
	},
	2012: {
		description:
			'引き取られたばかりの頃、さとりがよく作ってくれた簡易丼だそうで、小麦粉でとろみをつけて魚にかけた優しい味がお燐の記憶に残っています。',
		name: '猫まんま',
	},
	2013: {
		description:
			'サーモンを卵液と小麦粉で包み、全体が黄金色になるまで揚げた料理。一口噛んだだけで汁があふれて、隣の猫が泣くほど！',
		name: 'サーモン天ぷら',
	},
	2014: {
		description:
			'鯉が飛び立つ姿をしており、中はご馳走の宝箱のようで、ネコ科動物には抵抗できない究極の美食だ。',
		name: '鯉の滝登り',
	},
	2015: {
		description:
			'引き取られたばかりの頃、さとりがよく作ってくれた料理だそうで、オムレツに濃厚なチーズを混ぜた、いつでも美味しい一品です。',
		name: 'チーズオムレツ',
	},
	2016: {
		description:
			'刺激的な食材が加わり、味覚への刺激たっぷりのスーパー串焼きを、お空自らが中二度たっぷりの名前をつけた結果、ワイルドな妖怪になぜか人気が出た。',
		name: '一撃☆必殺',
	},
	2017: {
		description:
			'超超超激辛ビーフカレー！極限の忍耐力を持った人とバカだけがこの料理を試しているそうです！',
		name: '地獄激辛注意！',
	},
	3000: {
		description:
			'定番の人気民間料理。特に寒い冬には、蒸気が舞い上がるオーブンと、芋の赤い皮と黄色い中身の鮮やかな色で、暖かくて甘く柔らかい味を思い浮かべれば、我慢できる人はいないだろう。しかし食べ過ぎると胃がもたれるから、過食は禁物。',
		name: '焼き芋',
	},
	3001: {
		description:
			'引き伸ばした団子のように見えて、切ってみると真ん中に様々な模様が包まれており、それで団子がとても新鮮に見える。舎利を象徴するものらしい。ということは仏祖のご遺骨なのでは？',
		name: '痩馬団子',
	},
	3002: {
		description:
			'幻の雲華から色素を取り出してキノコ傘を染め、花で囲むように宝箱の周りに飾る。宝箱には一体どんなサプライズがあるんだろう？と思って開けたら、いきなり飛びついてくるのは大きな舌を出す変な傘！びっくりでしょー？',
		name: 'びっくり！大冒険',
	},
	3003: {
		description:
			'海難事故に遭い孤島に逃げた生存者たちが、仕方なく海水に浸した小麦粉とチーズを混ぜた「ペースト」を日に当てたら、意外とサクサクした美味しさがあった。そのため、作り方が受け継がれてきた。',
		name: 'ビスケット',
	},
	3004: {
		description:
			'海賊「パイレーツ」の語源は、直火で焼いたベーコンだと言われている。カリブ人はこうやって処理した肉を海賊に売るらしい。ご飯にご飯をかけるみたいでちょっと変。',
		name: '海賊ベーコン',
	},
	3005: {
		description:
			'仏教から生まれた精進料理。正統の羅漢料理は18種類の原料を使い、複雑で洗練された工程を経て、淡白で香り高い風味を持った色鮮やかで上品な料理に仕上がるのだという。仏教で最も豪華な精進料理と言えるだろう。',
		name: '羅漢上素',
	},
	3006: {
		description:
			'命蓮寺の弟子の中に自由に姿を変えられる入道がいる。彼の見た目から綿菓子を連想するのは簡単だ。桃汁を加えて作った綿菓子は、さっぱりした甘さと生き生きとした面白い形を持ち、子供たちに好かれている。',
		name: '雲山綿菓子',
	},
	3007: {
		description:
			'新鮮な蓮の実の殻を剥いて芯を取り、柔らかくなるまで茹でた後、バターと小麦粉を充分混ぜたものと合わせて炒め、最後に型で神々しく美しい蓮の模様を押し出す。',
		name: '聖白蓮子糕',
	},
	3008: {
		description:
			'カボチャで造られた船。儚く幻のような食材を載せて、蓮の実でできた川の上を幻想へと進んでいく。この料理を味わうたびに、夢から目覚めるように感じるという。それがどんな夢なのかは、人によるだろう。',
		name: '幻想星蓮船',
	},
	3009: {
		description:
			'もち米と松の実で作った薬膳料理。食感がきめ細かく柔らかく、爽やかな松の実の味を持ち、道士の間では人気がある。',
		name: '松の実ケーキ',
	},
	3010: {
		description:
			'白鹿も松も長寿を意味することから、長生きを求める道士に尊ばれる。そのため白鹿が松の下に立つ「鹿寿松貞」の絵がある。それをモチーフにした料理であ～る！',
		name: '白鹿貞松',
	},
	3011: {
		description:
			'極めてこだわった道家の古き名料理。魚の浮袋のスライスは薄ければ薄いほどよく、太極図は造型を整えて八卦の辺長を同じくするよう注意を払い、そして丁寧に蒸して初めてこの生き生きした形と柔らかい食感を持つ道家料理を表現できる。',
		name: '太極八卦魚肚',
	},
	3012: {
		description:
			'栗を蜂蜜で煮込んだもの。栗の優しくて濃い味は、外部の甘みを和らげることができる。',
		name: '栗の蜂蜜漬け',
	},
	3013: {
		description:
			'神霊廟は仙界にあるため、栗木は仙気を秘めていると言われている。私は区別できないけどね…栗をキノコと一緒に煮て、儚く無形の仙気を、甘く芳しく食欲をそそる煮込み鍋に凝縮したほうが、実用的では？',
		name: '天師栗とキノコ鍋',
	},
	3014: {
		description:
			'真っ白な皿に雫が零れ落ちる緑色の蓮の葉を敷き、中央にある一輪の白い蓮の花が高潔さを掻き立てる。どの皿にも新鮮なピンク色の蓮の花びらが下敷きになっている。極上のマグロと蓮の実で組み合わせた「魚米盞」を載せ、美味しくて健康的。',
		name: '荷花魚米盞',
	},
	3015: {
		description:
			'黄金色まで揚げた芋に細かい糸を引き出す糖液を塗り、油を塗った皿の上で転がすと、べたつかずに美味しくなる。しかし食べ過ぎると胃がもたれるから、過食は禁物。',
		name: '大学芋',
	},
	3016: {
		description:
			'肉とキノコが均等に混ざり合い、風味も良い庶民的な料理。食感の異なる2種類のキノコで、厳選された柔らかい肉を包み込み、味が何層にも重なって舌を楽しませてくれる。',
		name: 'ダブルキノコの豚肉巻き',
	},
	3017: {
		description:
			'揚げ物は鳥とは限らないのではないだろうか。地面を走るもの、土の中で育つもの、水の中で泳ぐもの、どんなものも小麦粉をまぶして揚げれば、香ばしくカリッとしたものになる。仕上げに幻のような月見草を添え、揚げ物盛り合わせの脂っこさをさりげなく中和している。',
		name: '天ぷら盛り合わせ',
	},
	4000: {
		description:
			'「どうしていつもフライドポテトにケチャップなんだ？この私はあえてそうしない。フライドトマトにポテトソースだ！」——鬼人正邪トマトに小麦粉をまぶして揚げ、自家製ポテトソースをかける。それもそれでおいしい。',
		name: 'フライドトマト',
	},
	4001: {
		description:
			'柔らかい肉に甘く香る桃、どれだけ食べても飽きない料理。蜂蜜をかけて炒めると、色も香りも増して、お酒との相性が抜群。',
		name: '桃紅焼肉',
	},
	4002: {
		description:
			'新しい技術を使った分子料理、月の都のメニューらしい。作り方に理解できない点が少なからず存在するため、ある程度の改良を経て「雅」と「俗」が調和した地球の料理が誕生した。その料理には、正邪の野望も託されている。',
		name: '天地逆転！',
	},
	4003: {
		description:
			'もち米でできた外皮で皮付きの小豆餡を包んだ和菓子。 餡の量は皮の量と同じかそれ以上なので、大福は丸みを帯びている。 その見た目から「大腹餅」と呼ばれ、縁起の良い発音から「大福」と呼ばれるようになったと言われている。',
		name: '小豆大福',
	},
	4004: {
		description:
			'焼いた皮で小豆餡を包んだデザート。 2枚の皮が銅鑼のように組み合わさっていることから、銅鑼焼きと名付けられた。',
		name: 'どら焼き',
	},
	4005: {
		description:
			'豆腐の白さで貂蝉の純潔を表し、ドジョウで董卓の狡さを暗示する。 王允が裏切り者の董卓を追い払うために貂蝉を献上したという美談を思い起こさせ、料理に文化的な趣が加わる。',
		name: '漢宮蔵嬌',
	},
	4006: {
		description:
			'牛肉と筍で作る家庭料理。 柔らかい筍の煮物には食欲増進と消化促進効果があり、さらに竹を使って盛り付ければ五感が刺激される。',
		name: '筍と牛肉の石鍋煮',
	},
	4007: {
		description:
			'豚の最も柔らかい部分を、新鮮な竹で作った筒の中に入れ、野菜や香辛料を充填し、強火で蒸した料理。竹の独特の香りがする。もし時間があれば、マリネ液に少し水を加えるのがおすすめ、肉がさらにもっちりした食感になる。',
		name: '竹筒粉蒸肉',
	},
	4008: {
		description:
			'様々な新鮮な食材を、多節の竹筒で蒸す料理。竹のように地位がどんどん上昇することをお祈りする。竹の緑と繊細な見た目は、食べる者に新しい視覚と味覚の感覚をもたらす。春を迎えるという良い意味も込められている。',
		name: '翠竹迎春',
	},
	4009: {
		description:
			'だし汁と熱々の白米で作る茶漬け！ 茶漬けのダシは、煎茶やほうじ茶、魚の香りがするダシを使うのが一般的で、最後に梅を加えることで、この地味な料理に彩りを添える。',
		name: '梅茶漬け',
	},
	4010: {
		description:
			'ウニに卵を加え、ウニの黄色が変わるまで蒸すシンプルな料理。ウニと卵の味が混ざり合うおいしさが舌に広がる。',
		name: 'ウニ茶碗蒸し',
	},
	4011: {
		description:
			'焼き具合が厳しく追求される料理。肉を完璧なミディアムレアにローストし、その 濃い赤色と破滅的な竜巻の形は、山と海からの圧迫感を感じさせる。 一口食べれば、まるで世界を征服したかのような豪快な気分になる。',
		name: '幻想風靡',
	},
	4012: {
		description:
			'基本的にはキノコ入りの山菜料理だが、名前から少し素敵なおとぎ話のような雰囲気がする。',
		name: 'キノコの魔法使い',
	},
	4013: {
		description:
			'頭を抱えてようやく「花鳥風月」という言葉を理解した。考えながら幽香さんが作ってくれた三角形のケーキも想像した。ケーキは幽香さんと同じ風雅なスタイルだが、私の羽毛も乗せて彩った。まあ、趣のあるケーキだと思う。',
		name: '花鳥風月',
	},
	4014: {
		description:
			'花をモチーフにした生クリームケーキ。ふんわりしたクリームの上に花々が咲き誇り、甘い香りが漂う。青い蝶がそっと花に止まり、そのまま離れようとしない。 これは夢でなくとも、夢のようだ。',
		name: '幽夢',
	},
	4015: {
		description:
			'「毒」ありの山菜ーー香椿で作ったクレープ。最初は苦味と渋味があり、噛むと甘味が口の中に残る。 けれど覚えておこう！ 一般客には、香椿を熱湯で湯通ししてから出すこと！',
		name: '香椿クレープ',
	},
	4016: {
		description:
			'様々な「毒食材」を使って調理する雑煮。食材を慎重かつ繊細に扱うことで、食材の「毒性」を適度に保ち、さまざまなニーズを持つお客に、望む感動と刺激を味合わせることができる。',
		name: 'ガシングガーデン',
	},
	4017: {
		description:
			'これは、小さな毒人形メディスンのために特別に作られたイメージデザート。まるで毒キノコのように、奇妙な色使いがかわいい。実際に毒はない。もちろんメディスンも。',
		name: '小さなスイートポイズン',
	},
	5000: {
		description:
			'厚切りの鰻の切り身に特調タレをかけ、ふんわりとした生卵をのせ、黄金色になるまでかき混ぜてから提供されるため、食べると大満足！',
		name: '鰻の若玉丼',
	},
	5001: {
		description:
			'新鮮なエビをコクのある酒に漬け、冷やして香辛料をかけて食べる。エビの新鮮さと香りを堪能でき、同時に酒の濃い香りも味わうことができ、とてもおいしい。',
		name: '竹筒エビ焼き',
	},
	5002: {
		description:
			'一方は魔界唐辛子のスープベース、もう一方は大根と牛骨のスープベース。紅白2種類のスープを兼ね備えた、特色のある牛肉鍋。一家団欒、一つの鍋、二種類の味で、まるで実家のような雰囲気も感じられる。',
		name: '牛オシドリ鍋',
	},
	5003: {
		description:
			'魅惑的なカラメルのカリカリした外側と、モチモチとした香ばしい中身は、食感の変化や味覚にも優れており、さすが「天使の鈴」――あれ？鈴の中には意外にも子猫が隠れていた！',
		name: '猫のカヌレ',
	},
	5004: {
		description:
			'発酵した丸パンの上にさまざまな具材をのせて焼き上げ、栄養と品を完璧に両立させた。キャラメルオニオンのまろやかな味わいは、さらに多重な舌先の楽しみをもたらす。かわいい猫ちゃんだけど、ちょっと口が痛くなりますね～',
		name: 'にゃんこピザ',
	},
	5005: {
		description:
			'猫モチーフのトーストケーキ。トーストの中身をくり抜き、底にクリームを塗り、桃ジャムを入れ、クリームを塗り、トーストを敷き、透き通った白い粉を入れ、最後に調色クリームで青い水面効果を映し出す。チョコレートで作った猫を入れると、面白い猫の水遊びの図になる。',
		name: 'にゃんこ水遊び',
	},
	5006: {
		description:
			'精緻な海老とカボチャのパスタを盛り付ける。カボチャは蒸して甘くてもちもちしていて、クリームの代わりにそれを使って作ったパスタは低脂肪低カロリーで、味が濃くて、栄養が十分です！',
		name: 'ラプンツェル',
	},
	5007: {
		description:
			'マグロのだしで作った餅は身が澄んでいて、新鮮なウニと高級なシャンパンの色が組み合わさり、底の胡麻味噌はさらにまろやかな食感を増している。このような精巧なスイーツは、透き通った美しさを壊すに忍びない。',
		name: 'ウニ信玄餅',
	},
	5008: {
		description:
			'魔界の茶会をイメージして作られたスイーツ。表面はチョコレートで作られたティーポットのように見える。ティーポットの中にはカステラが積層され、周りにはキノコやブロッコリーが飾られていて、ある物語のチョコレートハウスのように、夢と不思議がいっぱい詰まった幸せなスイーツだ。',
		name: '狂帽子茶会',
	},
	5009: {
		description:
			'ゲル化技術を通じて、柔らかくてかわいい桃の花を透き通ったゼリーの皮にし、もちもちしたこしあんを巻いて、季節のロマンと甘さを表現している。',
		name: '桃花瑠璃巻',
	},
	5010: {
		description:
			'爽やかで繊細なぶどうのウーロン茶ゼリー、白いクリームムース！クリームの綿密さとブドウの爽やかさが舌の上でぶつかり合う。お茶のゼリーにマスカットを飾り、濃厚な果香が口いっぱいに広がる。葉の小さな露の玉もなかなか面白い～',
		name: '蓮池の月色',
	},
	5011: {
		description:
			'本質的に桃を使って桃を作ること。桃を原材料とし、最終的に最初の形に戻すことは、表面的には帰着の理念を貫いているように見えるが、制作過程は極めて煩雑で洗練されている。',
		name: '龍吟桃',
	},
	5012: {
		description:
			'水分の少ない豆腐を卵白に、甘くてねっとりしたカボチャを卵黄に、ホワイトチョコレートを卵の殻にして、卵の形と食感を再現している。',
		name: '分子卵',
	},
	5013: {
		description:
			'一見雲山の霧に覆われた謎の星のようだが、開けてみると「星」にはなんと生卵が並んでいた？卵液をよく見ると実はシロキクラゲスープで、卵黄はカボチャ。さっぱりとした食感と、香ばしいカボチャの味がします。',
		name: '生命の源',
	},
	5014: {
		description:
			'特別に用意した皿は火星の地表のようで、その上には最高級のカニと白ブドウの分子技術で作られたゼリーが盛られている。カニの食感は冷たく滑らかで、果実は水滴のように凝縮されており、ほのかな酒の香りがしている。火星に一滴の水玉があることを意味し、最後の希望を表している。',
		name: '火星',
	},
	5015: {
		description:
			'甘めで栄養豊富なシロキクラゲと蓮の実粥。潤いがあっても飽きず、心を休めて安らげる効果もある。',
		name: '養心粥',
	},
	5016: {
		description:
			'多種の天然漢方薬から比例して調合されたスープの素に、胡椒と唐辛子を加え、骨のスープをベースにした牛肉の胡辣湯。一口飲めば居眠り虫を追い払うことができる。',
		name: '胡辣湯',
	},
	5017: {
		description:
			'海鮮スープの素で煮たタンメンは、コシがあってさっぱりしていて、スープが濃くておいしい。とても豪華な家庭料理。海鮮麺1杯で、隠された海の味を覚えることができる。',
		name: '至尊海鮮麺',
	},
	11000: { description: null, name: null },
	11001: { description: null, name: null },
	11002: { description: null, name: null },
	11003: { description: null, name: null },
	11004: { description: null, name: null },
	11005: { description: null, name: null },
	11006: { description: null, name: null },
	11007: { description: null, name: null },
	11008: { description: null, name: null },
	11009: { description: null, name: null },
	11010: { description: null, name: null },
	11011: { description: null, name: null },
	11012: { description: null, name: null },
	11013: { description: null, name: null },
	11014: { description: null, name: null },
	11015: { description: null, name: null },
	11016: { description: null, name: null },
	11017: { description: null, name: null },
	11018: { description: null, name: null },
	11019: { description: null, name: null },
	11020: { description: null, name: null },
	11021: { description: null, name: null },
	11022: { description: null, name: null },
	11023: { description: null, name: null },
	11024: { description: null, name: null },
	11025: { description: null, name: null },
	11026: { description: null, name: null },
	11027: { description: null, name: null },
	11028: { description: null, name: null },
	11029: { description: null, name: null },
	12000: { description: null, name: null },
	12001: { description: null, name: null },
	12002: { description: null, name: null },
	12003: { description: null, name: null },
	12004: { description: null, name: null },
	12005: { description: null, name: null },
	[-1]: {
		description:
			'調理に失敗し、黒いオーラを放つ謎の物質。これを食べようとするやつはいない・・・よね？',
		name: 'ダークマター',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
