import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const FOOD_LOCALIZATION_KO = {
	0: {
		description:
			'술집에서 흔히 제공되는 미역을 넣은 된장국입니다. 언제부턴가 환상향에 미역과 같은 해초가 점차 출현하기 시작하면서, 마을 사람 중 누군가가 시험삼아 물에 삶아 본 이후로 해초에서 우러난 감칠맛이 국물을 맛있게 해준다는 것을 밝혀내고는 그 뒤로 환상향에 급속도로 퍼진 음식입니다.',
		name: '미역 된장국',
	},
	1: {
		description:
			'술집에서 흔히 제공되는 두부를 넣은 된장국입니다. 두부를 사용하면서, 가장 간단하고 근본적인 맛을 강조했습니다.',
		name: '두부 된장국',
	},
	2: {
		description:
			'고기와 야채의 밸런스가 적당히 어우러진 맛있는 국입니다. 돼지고기와 해초를 사용했고, 마시는 순간 곧바로 온 몸에 기운이 퍼집니다.',
		name: '고깃국',
	},
	3: {
		description:
			'돼지고기와 송어를 함께 훈제시킨 음식입니다. 간단하고 맛있습니다.',
		name: '돼지고기 송어 구이',
	},
	4: {
		description:
			'이 가게의 간판메뉴로, 포장마차는 전부 닭꼬치를 판다는 선입견을 깨기 위해 특별히 야맹증에 좋다는 칠성장어를 구해 굽기 시작했습니다. 먼 과거에는, 이 칠성장어가 보물처럼 여겨지던 때도 있었다고 합니다.',
		name: '칠성장어 구이',
	},
	5: {
		description:
			'소고기, 양파, 호박을 꽂아 구운 꼬치입니다. 양파의 매운 맛과 호박의 단 맛을 교묘히 이용해 고기의 기름진 맛을 제거했으며, 더 상쾌하고 맛있게 먹을 수 있습니다.',
		name: '꼬치구이',
	},
	6: {
		description:
			'전설에 따르면, 이런 류의 꼬치는 오니와 싸우고 이긴 어느 검사가 처음으로 만들었다고 전해집니다. 특히 야성적인 맛이 강한 고기를 이용했으며, 한 입 먹으면 하늘을 뚫을 정도의 기운을 얻게 되어 다들 놀란다고 합니다.',
		name: '이천일류',
	},
	7: {
		description:
			'가장 평범한 주먹밥으로, 다시마를 넣고 뭉치기만 하면 완성입니다. 간단하고 정석적입니다.',
		name: '주먹밥',
	},
	8: {
		description:
			'흔히 볼 수 있는 저렴한 주먹밥입니다. 구운 돼지고기를 좀 넣었을 뿐이지만, 식감이 훨씬 나아졌습니다.',
		name: '구운 돼지고기 주먹밥',
	},
	9: {
		description:
			'흔히 볼 수 있는 저렴한 주먹밥입니다. 송어와 양파를 넣었고, 해산물의 섬세한 맛과 양파의 매콤한 맛이 어울러져 영양과 맛 모두 만족시켜줍니다.',
		name: '따뜻한 주먹밥',
	},
	10: {
		description:
			'매우 고급진 초밥입니다. 분홍빛의 최고급 사시미로 흰쌀밥을 감싸, 마치 벚꽃이 하얀 눈을 덮은 것 같은 불가사의한 아름다움을 자랑합니다.',
		name: '앵화낙설',
	},
	11: {
		description:
			'돼지고기와 고추를 이용한 간단한 가정 요리입니다. 맛이 강한편입니다.',
		name: '고기 볶음',
	},
	12: {
		description:
			'여름날 더위를 식히기에 딱 좋은 간식입니다. 만들기에도 간편합니다.',
		name: '냉두부',
	},
	13: {
		description:
			'가게의 간판 메뉴입니다. 칠성장어에 특제 소스를 발라 구웠으며, 육즙과 향기가 넘칩니다.',
		name: '장어 꼬치구이',
	},
	14: {
		description:
			'감자로 만든 요리입니다. 겉은 바삭하고, 속은 촉촉합니다. 튀김 요리중에서도 가장 인기가 많습니다.',
		name: '감자 크로켓',
	},
	15: {
		description:
			'엄선된 신선한 야채와 고급진 돼지고기를 이용해 만드는 요리입니다. 기름기가 느껴지지 않고 풍미가 가득하며, 농가에서도 최고급으로 여겨지는 음식입니다.',
		name: '사냥꾼 만찬',
	},
	16: {
		description:
			'평범한 가정식으로, 그릇 가득 찬 밥 위에 맛있는 소스와 돼지고기가 얹어져 조화로운 맛을 냅니다.',
		name: '돈가스 덮밥',
	},
	17: {
		description:
			'평범한 가정식으로, 그릇 가득 찬 밥 위에 맛있는 소스와 쇠고기가 얹어져 조화로운 맛을 냅니다.',
		name: '소고기 덮밥',
	},
	18: {
		description:
			'가게의 간판 메뉴입니다. 비록 이상하게 생기긴 했지만 환상향에서도 여러 번 화제가 된 칠성장어를 튀겨 바삭하고 촉촉하게 만들었습니다. 매우 인기가 좋습니다.',
		name: '장어 튀김',
	},
	19: {
		description:
			'신선한 야채들로 만든 샐러드입니다. 개운하고 시원해 입 안의 기름기를 없애는 데 탁월합니다. 여자들에게 다이어트 식품으로 인기가 높습니다.',
		name: '야채 샐러드',
	},
	20: {
		description:
			'칠성장어와 복어, 미역으로 만든 고급진 가정식 전골 요리로, 끓일때 눈처럼 하얀 거품이 난다고 하여 백설이라는 이름이 붙여지게 되었습니다.',
		name: '백설',
	},
	21: {
		description:
			'두부를 넣어 만든 전골입니다. 두부의 부드러운 식감과 높은 영양가 덕에 술집에서 흔히들 주문하는 가성비 메뉴입니다.',
		name: '두부 전골',
	},
	22: {
		description:
			'자투리 재료들로 만들어낸 탕으로, 재료도 아낄 수 있고 맛도 뛰어난 일석이조의 메뉴입니다.',
		name: '잡탕',
	},
	23: {
		description:
			'연어와 참치를 회 썬 것에 간장과 와사비를 곁들여 먹는 대표적인 일본 요리로, 신선한 맛이 일품입니다.',
		name: '사시미',
	},
	24: {
		description:
			'엄선된 각종 산해진미를 한데 넣고 끓인 전골로, 정교한 불 조절로 재료들의 맛을 전부 뽑아내 육즙이 가득하고 육질이 부드러운 일품 요리입니다.',
		name: '호화로운 만찬',
	},
	25: {
		description:
			'돼지고기와 채소를 오랜 시간 끓여 만든 국물은 라면의 정수이자 영혼과도 같은 존재입니다. 농후한 돼지뼈 기반 국물에 맛있는 면이 조화롭게 어우러져 배도 든든하고 입도 즐거운 음식입니다.',
		name: '돈코츠 라멘',
	},
	26: {
		description:
			'최고급 소고기와 송로버섯으로 끓여낸 음식으로 특유의 매운맛이 특징이며, 끓일 때 모습이 용암같다 하여 용암이라는 별명이 붙여졌습니다. 군침돋는 냄새가 사람들의 식욕을 자극합니다. 또한 개량해 만든 덜 매운 버전 또한 존재합니다.',
		name: '용암',
	},
	27: {
		description:
			'검은 매미의 허물은 약재로도 쓰이는데, 이 경우 목과 눈에 좋다고 합니다. 바삭하게 튀겨 씹히는 맛이 일품입니다.',
		name: '허물 볶음',
	},
	28: {
		description:
			'아침의 이슬로 삶은 달걀로, 평범한 삶은 달걀보다 더 달콤합니다. 신선함을 보존하기 위해 반숙으로 삶아 살짝만 흔들려도 노른자가 찰랑댈 정도로 부드럽습니다.',
		name: '삶은 달걀',
	},
	29: {
		description:
			'옛날 옛적부터 존재해온 기적의 꽃으로 빚어낸 떡으로, 아무리 먹어도 질리지 않을 정도로 적당히 달콤합니다. 먹고 남은 맛의 여운이 가장 그리운 추억을 되새겨준다는 전설이 있습니다.',
		name: '우담화 떡',
	},
	30: {
		description:
			'어둠의 기이한 별미 중 단연 으뜸으로, 깊고 진한 향과 뒷맛이 저 멀리서도 느껴질 정도입니다. 직접 곰을 잡아서 만들진 못하지만, 실제 곰 발바닥보다 훨씬 더 맛있습니다.',
		name: '곰 발바닥',
	},
	31: {
		description:
			'특별한 향신료와 함께 말린 생선을 절인 것으로 보존하기도 쉽우며 바삭하고 향기로운 맛에 많은 사람들이 가정에서 보존식으로 사용하는 음식입니다.',
		name: '수제 멸치 볶음',
	},
	32: {
		description:
			'신선한 야채를 아름다운 꽃의 모양으로 조각한 것으로, 사용되는 재료는 단순하지만 섬세한 칼솜씨가 필요합니다.',
		name: '순무 조각꽃',
	},
	33: {
		description:
			'유정천에서 전해진 레시피로, 신선한 복숭아를 꽃 모양으로 다듬고 아침의 맑은 이슬과 함께 다려냅니다. 달콤할 뿐만 아니라, 병을 치료한다던가 미용에 좋다던가 하는 부수작용이 있습니다.',
		name: '복숭아꽃 스프',
	},
	34: {
		description:
			'최고급 새우와 복숭아로 만든 고급 요리입니다, 연회와 같은 자리에서나 볼 수 있는 귀한 요리입니다.',
		name: '새우와 복숭아 샐러드',
	},
	35: {
		description:
			'이나리신의 요호가 가장 좋아하는 음식으로도 알려진 평범한 가정식입니다.',
		name: '유부',
	},
	36: {
		description:
			'공묘 「시례당」 앞의 은행나무에 열린 열매를 조리해 만들었다고 해서 시례은행이라고도 불립니다. 달콤하며, 향기롭고, 부드러우면서 쫄깃하여 그 맛이 일품입니다. 숙취나 기침을 막는 데 효과적입니다.',
		name: '은행 조림',
	},
	37: {
		description:
			'신선한 송어와 미역을 넣고 끓인 된장국으로, 비린 향이 전혀 없고 깊고 진한 맛이 일품인 요리입니다.',
		name: '진ㆍ미역 된장국',
	},
	38: {
		description:
			'버섯을 주 재료로 대나무 꼬치에 꽂은 뒤 기름을 발라 구운 후 약간의 소금을 뿌리면 고기 못지않게 감칠맛이 뛰어납니다!',
		name: '버섯 구이',
	},
	39: {
		description:
			'흔히 볼 수 있는 가정식이지만, 불조절에 세심한 주의를 가해 부드러운 두부의 식감을 살려냈습니다.',
		name: '삶은 두부',
	},
	40: {
		description:
			'흔히 볼 수 있는 가정식으로, 돼지고기에 간을 하고 밀가루를 묻혀 튀긴 음식입니다. 이웃집 아이들도 먹고 싶어할 정도입니다.',
		name: '돼지고기 튀김',
	},
	41: {
		description:
			'간단하나 복잡한, 불과 재료에 따라 맛과 분위기가 다양하게 변하는 양식의 기본과도 같은 요리입니다. 여담으로, 홍마관의 그 분들은 미디움 레어를 좋아한다고 합니다.',
		name: '버터 스테이크',
	},
	42: {
		description:
			'재료를 잘 볶은 뒤 생쌀을 넣고, 밥알에 야채의 향이 잘 어우러지게 섞으면서 볶는, 바깥 세상의 반도로부터 유래된 레시피입니다.',
		name: '리소토',
	},
	43: {
		description:
			'송로버섯과 소고기 등을 페이스트리 생지로 감싸 오븐에 구운 요리입니다. 빵, 뒥셀, 고기의 맛이 섬세하게 어우러진 정말 맛있는 요리로, 바깥 세상에서도 그 까다로운 조리법과 맛으로 유명합니다.',
		name: '비프 웰링턴',
	},
	44: {
		description:
			'흘러내리는 노른자와 흰 탄수화물 덩어리. 브런치로 자주 나오는 단골 메뉴입니다.',
		name: '에그 베네딕트',
	},
	45: {
		description:
			'아침 식사의 간단한 선택지 중 하나로, 준비한 반죽을 구워낸 뒤 시럽을 뿌려먹습니다.',
		name: '머핀',
	},
	46: {
		description:
			'영국식 애프터눈 티의 다과로 자주 곁들이는 단골 손님. 겉은 바삭하고 속은 촉촉합니다. 보통 잼이나 생크림에 찍어 먹습니다.',
		name: '스콘',
	},
	47: {
		description:
			'껍질째 겉만 바싹 구운 연어에 싱싱한 죽순을 곁들였습니다. 바깥 세상의 레시피에는 죽순 대신 아스파라거스를 쓴다고 하니, 이것도 환상향식 퓨전 요리의 일종이네요.',
		name: '연어 스테이크',
	},
	48: {
		description:
			'집에서 매우 쉽게 만들 수 있는 크림 스프로, 빵을 찍어 먹거나 아니면 그냥 먹어도 맛이 좋습니다.',
		name: '크림 스프',
	},
	49: {
		description:
			'홍 메이링의 고향에서 유래된 요리로, 만들기엔 조금 복잡하지만 식감과 향이 독특해 한 번 먹으면 잊혀지지가 않습니다.',
		name: '차슈 구이',
	},
	50: {
		description:
			'홍 메이링의 고향에서 유래된 요리로, 색과 향이 모두 완벽해 원기 회복에 탁월합니다.',
		name: '은행 무 갈비탕',
	},
	51: {
		description:
			'평범한 죽통밥으로, 영원정에서 모은 신선한 재료를 대나무 안에 함께 넣고 쪄서 만든 요리입니다. 밥에 대나무 향이 흠뻑 배면서, 멧돼지고기의 느끼함도 중화됩니다. "그 대나무녀랑 이거랑, 본질적으로는 전혀 다를 게 없다고!" ——후지와라노 모코우',
		name: '카구야히메',
	},
	52: {
		description:
			'밀가루로 불사조 모양을 반죽하고, 그 겉에는 꿀을 바르고 속에는 재료를 가득 채워넣은 뒤에 구워 만듭니다. 잘 만들어진 이 요리는 겉이 바삭하고 속이 촉촉합니다. "하아... 그러니까 불사조도 배를 가르면 이거랑 다를 거 없어." ——호라이산 카구야',
		name: '불사조',
	},
	53: {
		description:
			'영원정 특제 경단을 개량한 것으로, 진귀한 재료인 월견초를 더해 겉보기엔 아기자기하면서도 "달빛같은 식감"을 즐길 수 있습니다.',
		name: '달맞이떡',
	},
	54: {
		description: '가장 단순한 경단으로, 모두가 좋아하는 화과자입니다.',
		name: '찹쌀떡',
	},
	55: {
		description:
			'바깥 세계의 악기인 고토를 닮은 화과자로, 속에 복숭아를 넣어 매혹적인 옅은 분홍빛을 돌게 했습니다.',
		name: '복숭아맛 야츠하시',
	},
	56: {
		description:
			'바깥 세계에는 로컬 푸드의 일종으로 「○○의 연인」이라는 이름을 붙인 음식들이 있다는 소문이 있어, 영원정도 그 유행에 맞춰 자기들만의 버전을 만들었습니다.',
		name: '달의 연인',
	},
	57: {
		description:
			'화투에 나오는 조합인 이노시카쵸에 영감을 받아 만든 음식으로, 돼지고기와 사슴고기를 꽃과 함께 삶아내 원재료 그대로의 맛을 끌어낸 정성 가득한 요리입니다.',
		name: '이노시카쵸',
	},
	58: {
		description:
			'맛 보다는 소면을 흘려 먹는다는 재미 때문에 먹는 요리입니다.',
		name: '나가시소멘',
	},
	59: {
		description:
			'죽순을 먹는 가장 간단하고 좋은 방법은 돼지고기를 함께 곁들여 죽순의 깔끔한 맛을 돋구게 하는 것 입니다.',
		name: '죽순 고기 튀김',
	},
	60: {
		description: '죽통으로 쪄낸 차완무시는 그 맛이 별미입니다.',
		name: '죽순 계란찜',
	},
	61: {
		description:
			'이른바 대나무 꼬치에 각종 고급진 고기들을 끼워 한 입 가득 먹는 요리지만, 카구야의 협박 때문에 최고급 요리가 되어버렸습니다.',
		name: '봉래의 옥의 가지',
	},
	62: {
		description:
			'쉽게 보기 힘든 검은빛 두부로, 감히 입을 갖다대기엔 냄새 때문에 힘듭니다... 손님들도 곧장 이걸 먹을 수 있냐고 의심하지만, 실제로 먹어보고 나면 도저히 먹는 것을 멈출 수 없을만큼 맛있다고들 합니다.',
		name: '취두부',
	},
	63: {
		description:
			'일곱 빛깔의 분위기를 풍기는 최고급 군만두입니다. 일부 원리주의자들은 만두 안에 돼지고기 이외의 재료를 넣는 것을 강렬히 반대한다고들 합니다.',
		name: '극광 만두 튀김',
	},
	64: {
		description:
			'일본에서 유명한 중화요리로, 독특한 두부 요리 기법으로 만들어낸 매콤한 요리로 밥을 비벼먹기에 안성맞춤입니다.',
		name: '마파두부',
	},
	65: {
		description:
			'정통 사천지방 요리로, 신선하고 기름진 생선을 해질녘 노을처럼 붉은 고추와 함께 기름에 볶아내면서 만들어지는 생선 향과 고추 냄새의 조화가 환상적입니다.',
		name: '생선찜',
	},
	66: {
		description:
			'내부 테스트용 음식. 만약 이 것이 보인다면, 분명 데이터에 손을 댄 것이겠죠...',
		name: '월병',
	},
	67: {
		description:
			'세 가지 색의 네모난 케다마 아이스크림. 색도 맛도 아름다워 모두에게 사랑받고 있습니다. 때 거의 필수급인 디저트입니다.',
		name: '케다마 삼색 아이스크림',
	},
	68: {
		description:
			'네모난 화산 케다마가 만드는, 마치 용암이 흘러넘치는 것 같은 모양새입니다. 혀 끝에 얼얼한 자극이 오는 것을 즐기는 분께 추천드립니다.',
		name: '케다마 용암두부',
	},
	69: {
		description:
			'붉은 악마의 모자를 모티브로 해 만든 몽환적인 간식으로, 갈라 젖히면 피같이 붉고 단 시럽이 흘러 나옵니다.',
		name: '붉은 악마의 케이크',
	},
	70: {
		description:
			'무의식을 다루는 요괴의 모자를 모티브로 해 만든 심오한 간식으로, 갈라 젖히면 밑바닥이 안 보일 정도로 짙게 깔린 어둠만이 보이지만 그 모든걸 잊을 정도로 환상적인 향기가 납니다.',
		name: '무의식 요괴의 무스',
	},
	71: {
		description:
			'홍 메이링의 고향에서 유래된 요리로, 밀가루로 만든 쫄깃한 만두피 속에 좋아하는 재료를 넣고 끓는 물에 삶으면 맛있는 요리가 됩니다. 겉보기엔 평범하지만 그 속에는 세상의 보물들이 담겨 있습니다.',
		name: '물만두',
	},
	72: {
		description:
			'홍 메이링의 고향에서 유래된 요리로, 찹쌀 반죽을 동그란 모양으로 빚고 그 안에 달콤한 소를 넣어 둥글게 만 뒤 끓는 물에 삶아 만든 맛있는 디저트입니다. 겉보기엔 평범하지만 그 속에는 세상의 달콤함이 감싸져 있습니다.',
		name: '탕위안',
	},
	1000: {
		description:
			'바깥세계에서 유명한 일식입니다. 밀가루를 입힌 새우를 노란 빛깔이 나올 때까지 튀겨 만듭니다. 보기만 해도 맛있어 보이네요.',
		name: '새우튀김',
	},
	1001: {
		description:
			'꿀과 생선으로 만든 어묵입니다. 겉보기엔 그저 어묵이지만, 튀기면 그 진가가 발휘됩니다.',
		name: '황금 어묵 튀김',
	},
	1002: {
		description:
			'고급스러운 고기들이 산처럼 쌓여있고, 그 크기와 모양새는 위협적입니다. 뿜어져 나오는 강렬한 향기는 손님들의 넋을 나가게 합니다.',
		name: '고기 대축제',
	},
	1003: {
		description:
			'오이를 잘라 양념에 절여 만듭니다. 숙성을 거치면 신비한 맛을 느낄 수 있습니다.',
		name: '피클',
	},
	1004: {
		description:
			'뚜껑을 열기 전부터 매혹적인 냄새가 납니다. 하지만 중요하지 않습니다. 꽉 찬 게살에 깊게 우러나온 국물이 기다리고 있는 걸요. 이 둘은 조화를 이뤄 환상적인 맛을 만들어냅니다.',
		name: '게살크림찜',
	},
	1005: {
		description:
			'시리코다마는 인간의 꼬리뼈로, 캇파가 좋아하는 음식입니다. 과거에는 잔인한 방법으로 추출했으나, 현재는 비슷한 것으로 대체했고, 그에 따라 더 비싸졌습니다.',
		name: '시리코다마',
	},
	1006: {
		description:
			'바깥세계에서 유명한 길거리 음식입니다. 반죽과 다양한 재료들을 섞어 부쳐서 만듭니다. 적당한 가격으로 다양하게 즐길 수 있어 많은 이들에게 사랑받습니다.',
		name: '오코노미야키',
	},
	1007: {
		description:
			'바깥세계에서 유명한 길거리 음식입니다. 여러 겹의 반죽은 문어를 더욱 돋보이게 만듭니다. 쫄깃한 문어와 부드러운 반죽은 사람들의 미소를 자아냅니다.',
		name: '타코야키',
	},
	1008: {
		description:
			'만들기는 쉽지만, 준비가 어렵습니다. 현세에는 전 세계적인 미식으로 여겨진다고 합니다.',
		name: '성게회',
	},
	1009: {
		description: '버섯과 돼지고기를 같이 볶아 만든 평범한 가정식입니다.',
		name: '고기 버섯 볶음',
	},
	1010: {
		description:
			'인간 마법사가 오랫동안 버섯을 연구해 만든 비장의 요리입니다. 영양성분이 더 높다고 여겨지는 마법의 숲의 버섯을 사용했습니다.',
		name: '비밀의 버섯탕',
	},
	1011: {
		description:
			'버섯을 메인으로 신선하고 부드러운 다양한 재료를 곁들인 요리입니다. 황금색 빛은 무시할 수 없으며 향긋한 맛은 먹은 사람의 넋을 나가게 한다고 합니다.',
		name: '마녀의 무도회',
	},
	1012: {
		description:
			'한 번 맛보면 멈출 수 없는 진한 크림 베이스의 훌륭한 수프입니다. 재료 조달부터 조리까지 매우 쉽습니다. 영양가도 아주 풍부하고요.',
		name: '버섯 크림 스프',
	},
	1013: {
		description:
			'놀라운 양의 칼로리가 포함된 작은 간식입니다. 먹은 사람을 강하게 만들어 준다고 합니다. "먹어줘"라고 쓰여 있는데, 매우 유혹적이네요. 하지만 그렇다고 너무 많이 먹으면 살이 찔 수 있으니 주의하세요...',
		name: '평범한 컵케이크',
	},
	1014: {
		description:
			'일본의 전통적인 간식입니다. 특별한 조리법으로 몽환적인 색을 만들어 낼 수 있습니다. 너무 예뻐서 못 먹겠어요. 진짜로요. 하지만 한 입이라도 먹는 순간 그 맛을 잊을 수 없다고 합니다.',
		name: '일곱 빛깔 양갱',
	},
	1015: {
		description:
			'가장 전형적인 일본 요리 중 하나입니다. 갓 손질한 생선을 주먹밥 위에 얹었습니다. 포만감은 물론 맛까지 있습니다. 어째서 유구한 역사를 가지고 있는지 궁금해 할 필요도 없죠.',
		name: '니기리즈시',
	},
	1016: {
		description:
			'작은 호박의 속을 파내고 신선한 새우와 두부를 채웁니다. 그대로 찌면 달콤하고 맛있고 매우 건강한 식사가 완성됩니다.',
		name: '새우 호박찜',
	},
	1017: {
		description:
			'고대 동양 문명의 상징적인 요리의 변형입니다. 수행 중인 승려라도 전부 떨쳐버리고 맛을 보려고 한답니다. 정말 놀랍군요!',
		name: '환상불도장',
	},
	2000: {
		description:
			'몇몇 음침한 요괴들에게 유행하는 간식입니다. 진득한 치즈에 은행 특유의 맛이 섞여 씁쓸하지만 달콤한 뒷맛을 남깁니다. 정말 맛있을지는 모르겠네요.',
		name: '불길한 치즈 스틱',
	},
	2001: {
		description:
			'신맛을 좋아하는 사람들에게는 천국! 아닌 사람들에게는 지옥! 일부 요괴들에게서만 유행하는 간식입니다.',
		name: '음울한 과일 파이',
	},
	2002: {
		description:
			'옛 지옥에서 가장 인기있는 행사 음식입니다. 온갖 식재료에 매운 고추의 향이 더해져 맵지만 중독성있는 마법의 요리입니다.',
		name: '절규하는 오뎅',
	},
	2003: {
		description:
			'벌레의 껍데기를 적당히 갈아 면에 비벼 만든 요리입니다. 면발의 따스함과 껍데기의 바삭함은 이색적이면서 동시에 호기심을 자극합니다.',
		name: '바삭한 껍데기',
	},
	2004: {
		description:
			'물고기 머리가 툭 튀어나와 있는 파이입니다. 마치 생선이 절망적인 지옥의 천장을 보고 있는 듯 하네요.',
		name: '하늘바라기',
	},
	2005: {
		description:
			'장수풍뎅이는 지상 혹은 지저 어디서든 강한 면모를 보여줍니다. 이 요리는 그 모습을 빗대어 만들어졌다고 합니다.',
		name: '풍뎅이 찐빵',
	},
	2006: {
		description:
			'진정한 애주가들에게 버려지는 안주는 없습니다. 어쩌면 이 기본적인 요리야말로 독한 술에 딱 어울리는 친구가 아닐까요?',
		name: '완자조림',
	},
	2007: {
		description:
			'일반적인 계란말이에 달걀물을 덧입혀 크게 만든 요리입니다. 그 거대한 크기는 사람들이 열광하게 합니다. 그래서 그런지 오니들 사이에서 유명하나 봅니다.',
		name: '거인 계란말이',
	},
	2008: {
		description:
			'축제의 화려한 장식에, 주변에는 질 좋은 생선회가 가득하며, 회의 신선도를 유지하기 위해 펼쳐진 얼음 안개. 이게 진정한 연회가 아닐까요?',
		name: '오오에도 축제',
	},
	2009: {
		description:
			'사랑스러운 핑크빛 디저트입니다. 부드럽고 탄력이 있으며, 달콤한 향기가 나 많은 소녀들에게 사랑받습니다.',
		name: '벚꽃 푸딩',
	},
	2010: {
		description:
			'엄청나게 신 끔찍한 푸딩입니다. 각성 성분도 있어 졸릴 때 정신이 번쩍 들지만, 산도가 너무 높아 구강건강에 좋지 않습니다.',
		name: '진정 푸딩',
	},
	2011: {
		description:
			'도파민, 부신피질호르몬 등 여러 자극제가 과도하게 들어있는 디저트입니다. 섭취자로 하여금 밤새도록 춤을 추게 만들 수 있지만, 시간이 지나면 번아웃 증후군을 유발할 수 있습니다.',
		name: '각성 푸딩',
	},
	2012: {
		description:
			'오린이 입양됐을 때 사토리가 자주 해줬던 음식입니다. 자극적이지 않고 부드러운 맛은 아직도 오린의 기억에 남아있습니다.',
		name: '네코맘마',
	},
	2013: {
		description:
			'연어에 달걀물과 밀가루 옷을 입혀 노릇노릇하게 튀겼습니다. 한입만 먹어도 저 너머 고양이에게 질투의 시선을 받을 수 있습니다.',
		name: '연어 튀김',
	},
	2014: {
		description:
			'겉은 잉어가 펄떡이는 모습을 하고 있으며, 속은 환상적인 보물로 가득 차있습니다. 고양잇과 동물들이 이걸 마다할 수 있을까요?',
		name: '어약용문',
	},
	2015: {
		description:
			'오쿠가 입양됐을 때 사토리가 자주 해줬던 음식입니다. 속에 들어있는 고소한 치즈는 거부할 수 없는 매력입니다.',
		name: '치즈 계란말이',
	},
	2016: {
		description:
			'자극적인 식재료와 향신료, 여러 맛이 담긴 자칭 슈퍼 꼬치 구이입니다. 우츠호가 직접 지은 중2병스러운 이름 덕인지 몰라도, 몇몇 요괴들 사이에선 인기를 끌고 있습니다.',
		name: '일격☆필살',
	},
	2017: {
		description:
			'초슈퍼울트라 매운 소고기 카레라이스! 매운 맛에 내성이 있는 사람과 바보만이 이 요리를 먹어본다고 합니다.',
		name: '지옥의 경고!',
	},
	3000: {
		description:
			'언제나 사랑받는 대중적인 간식. 특히 추운 겨울날에 김이 모락모락 나는 가마솥과, 붉은 껍질하고 노란 속살의 따뜻하고, 달콤하고, 부드러운 맛을 거부할 수 있는 사람이 있을까요?',
		name: '군고구마',
	},
	3001: {
		description:
			'겉으로 보기엔 긴 떡처럼 생겼지만, 잘라보면 속을 다양한 문양으로 채워서 경단의 참신함을 더했습니다. 말 경단은 부처의 사리를 상징한다고 하니, 어쩌면 부처님의 유골인 게 아닐까요?',
		name: '여윈 말 경단',
	},
	3002: {
		description:
			'우담바라에서 색소를 추출하고 버섯의 갓에 하나하나 물들여, 비단 꽃에 둘러싸인 보물 상자처럼 주변을 장식합니다. 과연 상자 안에는 무엇이 들어있을까요? 보물상자를 열어보니... 커다란 혀를 내민 우산 요괴가 튀어나왔다! 깜짝 놀랐지——?',
		name: '공포! 대모험',
	},
	3003: {
		description:
			'난파선에서 무인도로 탈출한 생존자들은, 바닷물에 젖은 밀가루와 치즈로 "반죽"을 만들어 햇볕으로 구운 과자를 만들었는데, 의외로 바삭바삭하고 맛있었다고 합니다. 그래서 아직까지 전해져 오는 거겠죠.',
		name: '비스킷',
	},
	3004: {
		description:
			'해적 이라는 단어는 불에 구운 훈제 고기에서 유래됐다고 합니다. 캐리비안 원주민들은 이 방법으로 고기를 가공해서 해적에게 팔았다고 하죠. 근데 해적이 해적을 사먹다니, 이상하지 않나요?',
		name: '해적 훈제 고기',
	},
	3005: {
		description:
			'불교에서 유래된 정통 채식 요리. 이 요리는 18가지의 재료로 만들어지며, 그 과정도 아주 복잡하고 정교하여, 완성된 요리에서는 화려한 색감과 담백한 맛, 아름다운 향이 난다고 합니다. 불교에서 가장 호화로운 채식 요리라고 할 만 하네요.',
		name: '나한 채소찜',
	},
	3006: {
		description:
			'명련사의 제자들 중엔 모습을 바꿀 수 있는 도사가 있는데, 그를 보면 솜사탕이 떠오릅니다. 복숭아 과즙으로 만든 솜사탕은 달콤하면서도 느끼하지 않고, 생동감과 재미있는 외형으로 아이들에게 인기 만점입니다.',
		name: '운잔 솜사탕',
	},
	3007: {
		description:
			'신선한 연밥의 껍질과 속을 손질하고, 부드러워 질 때까지 익힌 다음, 버터와 밀가루를 골고루 섞어 볶은 후, 월병틀로 아름다운 연꽃 모양을 찍어냅니다. 아주 신성해 보이네요.',
		name: '성자의 백련 월병',
	},
	3008: {
		description:
			'환상같은 재료들을 가득 싣고, 연밥들로 이루어진 강을 따라, 거침없이 항해하는 호박의 배. 한 그릇 먹을 때마다 꿈을 꾼 듯한 기분이 든다고 합니다. 어떤 꿈인지는 사람마다 다르다고 하네요.',
		name: '환상성련선',
	},
	3009: {
		description:
			'찹쌀을 기본으로 하여 잣을 곁들인 약식. 잣떡의 가루는 곱고 부드러우며, 향긋한 잣의 맛과 향은 도교인들에게 인기가 많습니다.',
		name: '잣떡',
	},
	3010: {
		description:
			"흰 사슴과 소나무는 장수의 의미를 가지고 있어, 장생을 추구하는 도교인들의 존경을 받고 있습니다. 소나무 밑에 흰 사슴 한 마리가 서 있는 '녹수송정' 이라는 그림이 있을 정도죠. 이 요리는 그 그림을 바탕으로 만든 거랍니다~",
		name: '백록정송',
	},
	3011: {
		description:
			'고전적이지만 요리 방법이 매우 까다로운 도교 요리입니다. 부레는 얇을수록 좋고, 둥근 태극 무늬랑 팔괘 무늬에 주의를 기울여야 합니다. 마지막으로 세심하게 조리를 해야지만, 마치 살아있는 듯한 이 유명한 도교 요리를 완성시킬 수 있습니다.',
		name: '태극팔괘 부레',
	},
	3012: {
		description:
			'밤을 꿀에 졸여서 만든 간식. 밤의 부드러우면서도 풍부한 맛은 꿀의 단맛하고도 잘 어울립니다.',
		name: '밤 설탕절임',
	},
	3013: {
		description:
			'신령묘는 선계에 있으며, 그곳에 있는 밤나무는 전부 신령이 깃들어 있다고 합니다. 전 잘 모르겠지만요... 버섯과 밤을 같이 쪄서, 보이지 않는 신력을 달고 맛있는 냄비 요리에 응축시킨다는 생각이 더 현실적이지 않나요?',
		name: '천사의 밤버섯 찜',
	},
	3014: {
		description:
			'하얀 접시 위에 푸른 연잎이 깔려있고, 그 잎사귀 위에는 맑은 물방울이 굴러다니며, 중앙에 있는 하얀 연꽃이 "선기"를 더해줍니다. 각각 부드러운 분홍 연꽃을 접시로, 신선한 참치와 연밥을 올린 "생선밥"이 담겨있습니다.',
		name: '연못 한 잔',
	},
	3015: {
		description:
			'고구마를 팬에 노릇노릇해질 때까지 볶은 후, 설탕 시럽으로 코팅합니다. 마지막으로 기름칠한 접시에서 굴려주면 맛있으면서도 이빨에 달라붙지 않습니다. 하지만 과식하면 배탈나기 십상이니 조심하세요.',
		name: '고구마 맛탕',
	},
	3016: {
		description:
			'흔히 볼 수 있는, 고기와 야채가 잘 어우러진 진미입니다. 맛이 다른 두 종류의 버섯에, 부드러운 고기를 감싼 이 요리는, 미각에 층층이 느껴지는 맛의 즐거움을 선사합니다.',
		name: '구운버섯 말이',
	},
	3017: {
		description:
			'누가 튀김은 반드시 새 고기여야 한다고 말한 거죠? 땅에서 달리는 것, 흙에서 자라는 것, 물에서 헤엄치는 것을 밀가루에 묻혀서 기름을 두른 팬에 튀기면 모두 향긋하고 바삭합니다. 몽환적인 월광초가 포인트로, 모둠 튀김의 느끼함을 중화시켜줍니다.',
		name: '모둠 튀김',
	},
	4000: {
		description:
			'왜 사람들은 감자튀김에 케첩을 뿌려먹는 거야? 난 토마토 튀김에 감자 소스를 뿌려먹고 싶다고! ——키진 세이자 토마토에 밀가루를 묻혀 튀기고, 갓 익힌 감자로 수제 소스를 만들어 뿌려먹는 요리입니다.',
		name: '토마토 튀김',
	},
	4001: {
		description:
			'부드럽고 찰진 고기에 고소하고 달콤한 복숭아는 먹어도 먹어도 질리지 않습니다. 여기에 꿀을 뿌리고 볶으면 더욱 붉고 향긋해지며 술안주로 딱이죠.',
		name: '복숭아 홍소육',
	},
	4002: {
		description:
			'혁신적인 기술로 만든 이 분자요리는 달의 도시에서 온 레시피라고 합니다. 조리 과정에서 이해할 수 없는 부분이 많았기 때문에, 어느 정도 재창작한 끝에 지상의 사람들이 보기에 우아함과 저속함을 결합한 세속적인 요리가 되었고, 천하를 장악하려는 혼돈의 뜻도 있었습니다.',
		name: '천하 뒤집기!',
	},
	4003: {
		description:
			"통통한 단팥을 속에 가득 채워넣어 둥그런 모양의 찹쌀떡입니다. 예전엔 외관 때문에 '다이후쿠모치'라 불렸으며, 후세의 사람들은 이를 다시 '다이후쿠'이라 불렀습니다.",
		name: '단팥 찹쌀떡',
	},
	4004: {
		description:
			'구운 밀가루 반죽 사이에 팥소를 넣은 디저트입니다. 반죽이 징처럼 생겨 징 구이란 의미로 도라야키라는 이름이 붙었습니다.',
		name: '도라야키',
	},
	4005: {
		description:
			'두부의 순백색은 초선의 순결을 묘사하고, 미꾸라지의 교활함은 동탁의 교활함을 암시합니다. 음식을 맛보는 동안 왕윤이 초선을 바치겠다며, 미인계를 사용해 반역자 동탁을 제거했다는 이야기를 떠올리며 자연스레 문화와 함께 즐길 수 있습니다.',
		name: '한궁장교',
	},
	4006: {
		description:
			'삼겹살과 죽순을 주 재료로 하는 가정식 요리입니다. 신선하고 부드러운 죽순을 곁들인 푹 삶은 고기는 식욕을 돋우고 소화를 촉진시킵니다. 대나무를 곁들여 플레이팅하면 맛과 멋 모두 일품이라 할 수 있습니다.',
		name: '돌솥 고기조림',
	},
	4007: {
		description:
			'돼지의 가장 부드러운 부분을 죽통에 들어갈 만큼 자르고, 고기에 구멍을 뚫어 고기의 속을 채소와 향신료로 가득 채운 뒤 센 불에 쪄내면서 대나무 특유의 향을 입혀냅니다. 시간이 있다면, 물을 더 넣고 고기를 절여내면 음식의 빛깔도 훨씬 살고 씹기도 쉬워집니다.',
		name: '죽통 고기찜',
	},
	4008: {
		description:
			'신선하고 부드러운 다양한 재료들을 죽통에 넣고 푹 쪄낸 요리입니다. 봄철의 대나무가 자아내는 비취색은 손님들의 시각적 만족감을 채울 뿐 아니라, 이윽고 봄을 맞이한다는 아름다운 의미도 담고 있습니다.',
		name: '봄맞이 취죽',
	},
	4009: {
		description:
			'따끈한 밥을 국물에 말아 만든 오차즈케! 오차즈케의 국물로는 주로 녹차나 가다랑어포로 향을 낸 육수를 사용하며, 마무리로 얹혀진 매실은 이 담백한 요리에 밝은 색을 더해줍니다.',
		name: '매실 오차즈케',
	},
	4010: {
		description:
			'계란에 성게를 넣고 잘 익을 때까지 찌면 되는 간단한 요리입니다. 숟가락으로 푹 파먹으면 성게와 계란찜의 고소한 풍미가 입 안 가득 퍼집니다.',
		name: '성게 계란찜',
	},
	4011: {
		description:
			'불조절이 매우 까다로운 요리로, 고기가 완벽히 미디엄 레어로 익을 때까지 집중해야 합니다. 검붉은 색조와 파괴적인 회오리 모양은 산과 바다가 떠밀려오는듯한 압박감을 주지만, 한 입 삼키면 그야말로 환상적인 풍미를 자랑합니다.',
		name: '환상풍미',
	},
	4012: {
		description:
			'산나물과 버섯을 무쳤을 뿐이지만, 이름 때문에 요술이 걸린 것 같은 느낌이 들기도 하네요.',
		name: '들판 신선버섯',
	},
	4013: {
		description:
			'화조풍월 이라는 단어의 뜻을 곱씹어보며 이 케이크를 감상해 봅시다. 전체적인 스타일은 레시피를 만들어낸 유카씨의 이미지처럼 우아하지만, 제 깃털이 하나 꽂혀 있으니 재밌지 않나요?',
		name: '화조풍월',
	},
	4014: {
		description:
			'꽃을 모티브로 한 2단 케이크입니다. 고운 크림 위에 꽃송이가 펼쳐져 달콤한 향기를 풍기고, 푸른 나비들이 조용히 모여듭니다. 꿈은 아니지만, 꿈보다도 꿈 같습니다.',
		name: '그윽한 꿈',
	},
	4015: {
		description:
			'독이 있는 산나물인 참죽을 부쳐냈습니다. 첫맛은 씁쓸하고 떫지만, 씹다 보면 입에 단맛이 남습니다. 명심하세요! 참죽은 먹기 전에 꼭 끓는 물에 데쳐야 합니다!',
		name: '참죽 부침',
	},
	4016: {
		description:
			'각종 "독성 재료"들을 섞어 푹 끓인 잡탕입니다. 식재료를 신중하고 정교하게 손질해 내 "독성"을 손님들의 요구에 맞게끔 조절할 수 있습니다.',
		name: '극독의 꽃밭',
	},
	4017: {
		description:
			'작은 독 인형 메디슨을 위해 특별히 제작된 디저트입니다. 사람들이 따고 싶게 만드는 아름다운 자연의 독버섯처럼 오묘하고 매력적인 색채를 띄고 있습니다. 하지만 이 요리엔 독이 없고, 메디슨도 마찬가지죠~',
		name: '자그마한 스위트 "포이즌"',
	},
	5000: {
		description:
			'두텁게 썬 장어에 특제 양념을 바르고 부드러운 계란 지단을 덮었습니다. 먹기도 전에 황금빛으로 감도는 모양새에 입 안이 벌써 만족스러워 질걸요!',
		name: '장어 계란 덮밥',
	},
	5001: {
		description:
			'신선한 새우를 풍미 좋은 술에 절여 한 번 식히고 향신료를 곁들여 내놓습니다. 새우의 감칠맛과 술의 개운한 맛을 동시에 느낄 수 있는 입이 즐거운 요리입니다.',
		name: '죽통 새우찜',
	},
	5002: {
		description:
			'한 쪽은 마계 고추로 낸 국물이, 다른 한 쪽에는 무와 사골로 우려낸 국물이 담긴, 홍백 이색의 육수에 고기를 데쳐 먹는 전골 요리입니다. 한 가족이 한 냄비로 두 가지 맛을 오손도손 즐길 수 있는, 마치 가족과도 같은 분위기의 요리입니다.',
		name: '쇠고기 원앙 훠궈',
	},
	5003: {
		description:
			'매혹적인 캐러멜 코팅 속에 부드러운 달콤함이 들어있습니다. 식감과 맛의 변화로 느낄 수 있는 놀라운 경험이라면 왜 사람들이 이 음식을 "천사의 방울"이라 부르는지 알 법도 합니다. ..어라? 방울 속에 야옹이가 숨어있었네요!',
		name: '고양이 까눌레',
	},
	5004: {
		description:
			'발효된 둥근 빵 반죽 위에 각종 재료를 얹어 구워내 영양과 모양 모두 잡아냈습니다. 캐러멜라이즈된 양파에서 나는 농후한 맛이 혀끝에서 춤추지만, 귀여운 고양이 모양에 차마 음식을 입에 담기는 힘들지요.',
		name: '고양이 피자',
	},
	5005: {
		description:
			'고양이를 모티브로 한 토스트 케이크입니다. 네모난 식빵 안쪽을 파내고 밑바닥에 크림을 채운 뒤, 복숭아 잼을 바르고, 크림을 뿌리고, 토스트 조각을 놓고, 투명한 젤리를 넣은 뒤 마지막으로 색감을 위해 푸른 크림을 넣어 잔잔한 수면을 연출합니다. 초콜릿으로 만든 고양이를 얹으면, 귀엽고 재밌는 고양이가 물놀이하는 모습이 됩니다.',
		name: '고양이 물장난',
	},
	5006: {
		description:
			'새우와 호박을 재료로 한 정교한 플레이팅의 파스타입니다. 달콤하고 부드러운 찐 단호박이 유지방을 대체 해줘서, 저지방 저칼로리로도 풍부한 맛을 느낄 수 있는 건강한 요리입니다.',
		name: '라푼젤',
	},
	5007: {
		description:
			'참치 육수로 만든 투명한 물방울떡으로, 신선한 성게와 함께 곁들여 고급 샴페인과 같은 영롱한 빛을 자아냅니다. 밑에 깔린 검은깨 소스가 농후한 식감을 한층 올려주니, 디저트라 생각하기엔 아쉽고 고급진 예술이라 표현하는게 적당할 듯 합니다.',
		name: '성게 물방울떡',
	},
	5008: {
		description:
			'마계의 다과회를 모티브로 만든 디저트입니다. 겉보기엔 초콜릿으로 만든 찻잔인가 싶지만 그 안에는 겹겹이 쌓인 크림 케이크가 버섯이나 브로콜리와 함께 장식되어 있습니다. 마치 어느 동화 속에 나오는 과자집과도 같은, 꿈과 호기심으로 가득찬 행복한 디저트입니다.',
		name: '모자 장수 다과회',
	},
	5009: {
		description:
			'젤화 기술을 응용해 만든, 귀여운 복숭아꽃이 투명한 수정 젤리 안에 담겨있는 디저트입니다. 말랑말랑한 식감과 함께 부드러운 팥소가 달콤한 계절의 낭만을 되새겨줍니다.',
		name: '복숭아꽃 수정말이',
	},
	5010: {
		description:
			'맑고 보드라운 포도 우롱차 젤리. 하얀색은 크림으로 만든 무스로, 크림의 쫀득함이 포도의 새콤함에 겹쳐 맛의 새로운 지평선을 엽니다. 차로 만든 젤리는 샤인 머스캣으로 장식되어, 한 입 먹으면 진한 과일향이 입안에 가득 퍼집니다. 연잎에 맺힌 이슬방울도 귀여우니 한층 더 보기 좋습니다.',
		name: '연못 달빛',
	},
	5011: {
		description:
			'쉽게 말하면 복숭아로 만든 복숭아인데, 복숭아를 으깬 뒤 으깬 복숭아를 복숭아 모양으로 다시 빚어내는 것입니다. 겉보기에는 단순히 외양을 돌려놓는다는 이념을 형상화한 것에 불과해 보이겠지만, 실제로는 굉장히 까다롭고 번거로운 과정이 필요합니다.',
		name: '용음 복숭아',
	},
	5012: {
		description:
			'수분이 적고 단단한 경두부를 흰자로, 달콤하고 부드러운 호박을 노른자로, 화이트 초콜릿을 껍질로 삼아 만들어낸 분자 요리로, 계란의 모양과 식감을 완벽하게 구현해냈습니다.',
		name: '분자 계란',
	},
	5013: {
		description:
			'겉보기엔 구름이 겹겹이 끼인 수수께끼의 행성같아 보이겠지만, "행성"은 그냥 날달걀입니다. 하지만 자세히 보면 "날달걀"의 흰자는 흰목이버섯으로 만든 스프고, 노른자는 호박 퓌레네요. 개운한 맛이 고소한 호박맛과 함께 옵니다.',
		name: '생명의 근원',
	},
	5014: {
		description:
			'특별히 만들어진 접시의 바닥은 화성의 지표면과 같으며, 그 위에는 최고급 게살이 청포도와 함께 분자요리 방식으로 젤리가 되어있습니다. 게는 서늘하고 퍽퍽하지만, 과일은 은은히 백포도주 향을 내면서 마치 물방울처럼 응고되어 있습니다. 화성에서의 물 한 방울은 마지막 희망을 은유합니다.',
		name: '화성',
	},
	5015: {
		description:
			'흰목이버섯과 연밥을 함께 넣고 끓였습니다. 촉촉하고 부드러우며, 마음에 영양을 공급해주고 정신을 안정시켜주는 죽입니다.',
		name: '보양죽',
	},
	5016: {
		description:
			'다양한 천연 한약재를 배합한 육수에 고추와 후추를 넣은 뒤 사골 육수를 섞어 끓였습니다. 이 소고기 후라탕을 한 입만 해도 그 얼얼함에 잠이 확 달아납니다.',
		name: '후라탕',
	},
	5017: {
		description:
			'해산물을 넣고 끓인 국물에 쫄깃한 면을 넣은 음식으로, 면의 부드러움과 국물의 진함이 함께 어우러진 고급 가정식입니다. 이 짬뽕 한 그릇이면 깊은 저 바닷속 감칠맛이 떠오릅니다.',
		name: '지존 해물짬뽕',
	},
	11000: { description: null, name: null },
	11001: { description: null, name: null },
	11002: { description: null, name: null },
	11003: { description: null, name: null },
	11004: { description: null, name: null },
	11005: { description: null, name: null },
	11006: { description: null, name: null },
	11007: { description: null, name: null },
	11008: { description: null, name: null },
	11009: { description: null, name: null },
	11010: { description: null, name: null },
	11011: { description: null, name: null },
	11012: { description: null, name: null },
	11013: { description: null, name: null },
	11014: { description: null, name: null },
	11015: { description: null, name: null },
	11016: { description: null, name: null },
	11017: { description: null, name: null },
	11018: { description: null, name: null },
	11019: { description: null, name: null },
	11020: { description: null, name: null },
	11021: { description: null, name: null },
	11022: { description: null, name: null },
	11023: { description: null, name: null },
	11024: { description: null, name: null },
	11025: { description: null, name: null },
	11026: { description: null, name: null },
	11027: { description: null, name: null },
	11028: { description: null, name: null },
	11029: { description: null, name: null },
	12000: { description: null, name: null },
	12001: { description: null, name: null },
	12002: { description: null, name: null },
	12003: { description: null, name: null },
	12004: { description: null, name: null },
	12005: { description: null, name: null },
	[-1]: {
		description:
			'실패한 요리의 결과물입니다. 어두운 기운을 뿜어내는, 감히 말로 형용할 수 없는 물질입니다. 아무도 이런 걸 감히 먹진 않겠지요... 그렇죠?',
		name: '암흑물질',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
