import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const FOOD_LOCALIZATION_ZH_TW = {
	0: {
		description:
			'居酒屋常見的快手湯羹，來歷不明卻隨處可見的海帶在幻想鄉出現之初，有人好奇水煮了一下，結果意外地發現有種異樣的鮮味，從此便在幻想鄉流行開了。',
		name: '海鮮味噌湯',
	},
	1: {
		description:
			'居酒屋常見的快手湯羹，使用了豆腐來提鮮，最簡單又最原始的美味。',
		name: '豆腐味噌',
	},
	2: {
		description:
			'葷素搭配的美味湯羹，使用了野豬肉和海帶煲煮而成，能最快捷地補充身體所需能量。',
		name: '力量湯',
	},
	3: {
		description:
			'把豬肉鱒魚放在一起熏製而成，是簡單好吃的肉食料理，也比較能保存。',
		name: '豬肉鱒魚燻',
	},
	4: {
		description:
			'本店招牌。為了打破紅燈籠店就是烤鳥肉店的成見，特意選擇了對夜盲症有奇效的八目鰻，據説在過去還被視作珍寶。',
		name: '烤八目鰻',
	},
	5: {
		description:
			'牛肉搭配洋葱、南瓜烤成的串串。巧妙地利用了洋葱的刺激與南瓜的甜味去除肉質的油膩，食之更加清爽。',
		name: '能量串',
	},
	6: {
		description:
			'傳説中與鬼立下賭約並獲勝的人類劍士所創下的烤串流派，特別使用了野性十足的肉類燒製而成，食之有種沖天的氣魄，讓人驚嘆不已。',
		name: '二天一流',
	},
	7: {
		description: '最普通的飯糰，加點海帶隨便捏捏就可以了，超便捷的經典。',
		name: '飯糰',
	},
	8: {
		description:
			'常見的平價飯糰，在飯糰中放入烤制後的豬肉，為其增加了一份香濃的嚼勁。',
		name: '炙豬肉飯糰',
	},
	9: {
		description:
			'常見的平價飯糰，內餡加入了鱒魚和洋葱，融合了海鮮的細膩口感與洋葱的熾熱，無論是營養還是口感都屬上佳。',
		name: '温暖飯糰',
	},
	10: {
		description:
			'高級壽司的一種，粉紅色的高級生魚片蓋在白米飯上，就如櫻花飄落在白雪上，有着不可思議的美感。',
		name: '櫻落雪',
	},
	11: {
		description: '以豬肉作為主要食材製作而成的家常菜，口味偏重。',
		name: '炒肉絲',
	},
	12: { description: '夏天的消暑下酒菜，簡單爽口。', name: '冷豆腐' },
	13: {
		description:
			'本店招牌。將鰻魚用特殊醬料進行燒製後肉汁四溢，光聞着香味便讓人垂涎不已。',
		name: '紅燒鰻魚',
	},
	14: {
		description:
			'主要由土豆製成，外表酥脆內在綿軟可口，在油炸類食品中有着較高的人氣。',
		name: '土豆可樂餅',
	},
	15: {
		description:
			'用農家蔬菜佐以優質黑毛豬肉燉煮的燴鍋，口感飽滿，香濃卻不油膩，是農家人最高級的大菜。',
		name: '野味加農',
	},
	16: {
		description:
			'常見的家常菜，看上去顆顆飯粒飽滿，淋上的香醬與豬肉的口感融為一體，令人胃口倍增。',
		name: '豬肉蓋澆飯',
	},
	17: {
		description:
			'常見的家常菜，看上去顆顆飯粒飽滿，淋上的香醬與牛肉的口感融為一體，令人胃口倍增。',
		name: '牛肉蓋澆飯',
	},
	18: {
		description:
			'本店招牌。長相怪異的八目鰻在喜歡嚐鮮的幻想鄉曾一度成為話題，油炸後爽滑酥嫩，深受大眾喜愛。',
		name: '炸八目鰻',
	},
	19: {
		description:
			'用新鮮的蔬菜生拌而成的沙拉，口感清新，可以去除嘴裏的油膩。不知為何被年輕的姑娘們奉為減肥聖餐。',
		name: '蔬菜專輯',
	},
	20: {
		description:
			'使用鮮美的八目鰻與河豚，再佐以海帶燉煮而成的高級燴鍋，由於煮的過程中會飄出純白的泡沫而得名，是非常高級的家庭料理。',
		name: '白雪',
	},
	21: {
		description:
			'由豆腐燉煮而成的燴鍋，滑嫩的口感再加上其本身具有的較高營養價值，使這道平價料理成為居酒屋最常見的燴鍋。',
		name: '豆腐鍋',
	},
	22: {
		description:
			'使用一些邊角料食材雜燴而成的燴鍋，享受美味的同時還能避免浪費，可謂一舉兩得。',
		name: '雜炊',
	},
	23: {
		description:
			'作為和風料理的代表，將刺身級的三文魚和金槍魚魚生配上芥末和醬油，引出鮮味的絕妙料理。',
		name: '刺身拼盤',
	},
	24: {
		description:
			'奢侈地選用了一系列高級食材燉煮成燴鍋，通過火候的精妙控制，將食材之間的特點全部提煉了出來，肉質鮮嫩多汁，香滑入味，令人其味無窮。',
		name: '大奢宴',
	},
	25: {
		description:
			'用豬肉和蔬菜經過長時間熬製出來的高湯，堪稱整碗拉麪的精髓和靈魂所在。香濃醇厚的豚骨湯底配上香彈可口的拉麪，飽腹之餘也讓舌尖得到最大的滿足。',
		name: '豚骨拉麪',
	},
	26: {
		description:
			'用高級牛肉和松露燉煮而成的燴鍋，最初以麻辣為特色，因燉煮中冒出的氣泡如岩漿而得名，款款而起的香味更是讓人食指大動。改良後也增加了不辣的版本。',
		name: '岩漿',
	},
	27: {
		description:
			'蟬科昆蟲黑蚱羽化後的蜕殼，可以入藥，有利咽開音、明目退翳之效，香炸後口感酥脆，頗受歡迎。',
		name: '香炸蟬蜕',
	},
	28: {
		description:
			'採集了清晨的露珠煮成的蛋，比一般的水煮蛋多出一種甘甜的味道，為了保持鮮嫩只煮到半熟，蛋黃水嫩得似乎稍加晃動就會流出來。',
		name: '露水煮蛋',
	},
	29: {
		description:
			'用上古時期便存在的奇蹟之花製作的糕點，不僅甜而不膩，食後更是齒頰留香，據説能勾起人心中最想懷念的回憶。',
		name: '幻曇花糕',
	},
	30: {
		description:
			'黑不溜秋的怪異美食之首！香飄萬里，讓人回味無窮。因為打不過熊，沒法直接用熊掌做，但是比真正的熊掌還要鮮美百倍。',
		name: '賽熊掌',
	},
	31: {
		description:
			'用秘製的香料將小魚幹醃製後曬乾，酥脆香口的同時又易於保存，尋常人家都喜歡在家中保存一份。',
		name: '秘製小魚幹',
	},
	32: {
		description:
			'將鮮果蔬菜雕刻成鮮花的模樣，雖則材料簡單，但卻非常考驗刀工。',
		name: '涼菜雕花',
	},
	33: {
		description:
			'來自天上的配方，採摘新鮮的桃花，配以清晨的甘露水煮而成，不僅芳香清甜，而且具有祛病美容的神奇功效。',
		name: '桃花羹',
	},
	34: {
		description:
			'選用品質最好、肉質最鮮的蝦和桃子加工而成的高級料理，據説在外界只有在宴席上才有機會一見。',
		name: '北極甜蝦蜜桃色拉',
	},
	35: {
		description: '常見的家常菜，傳説中是稻荷神的狐狸使者最喜歡的食物。',
		name: '油豆腐',
	},
	36: {
		description:
			'以選用孔廟“詩禮堂”前銀杏樹所結果實烹製而得名，清香甜美，柔韌筋道，可解酒止咳。',
		name: '詩禮銀杏',
	},
	37: {
		description:
			'選用新鮮鱒魚與海帶煲煮而成的味噌湯，濃濃的鮮味四處漂盪，鮮而不腥。',
		name: '真·海鮮味噌湯',
	},
	38: {
		description:
			'採用蘑菇為原料，將蘑菇用竹籤串起來後、刷少量油進行燒烤，撒上粗鹽，味道簡直不輸給直接吃肉！',
		name: '烤蘑菇',
	},
	39: {
		description:
			'常見的家常菜，但也講究燒製的火候，才能將豆腐的鮮嫩口感得到最大展現。',
		name: '煮豆腐',
	},
	40: {
		description:
			'常見的家常菜，以豬肉為主要材料，裹以麪粉一炸，鄰居家的孩子都饞哭了。',
		name: '炸豬肉排',
	},
	41: {
		description:
			'簡單而複雜，根據火候和食材的選擇，呈現出不同感覺的基礎西餐。順帶一提紅魔館的那位喜歡的是三分熟。',
		name: '黃油牛排',
	},
	42: {
		description:
			'將食材炒熟之後倒入生米，充分混合米粒和食材香味的外界某個半島的做法。',
		name: '意式燴飯',
	},
	43: {
		description:
			'將牛排和松露這兩種鮮美的食材調味後包裹在酥皮中進行烘焙，讓黃油酥皮的香味和牛排蘑菇的鮮美充分融合的極致菜餚。工序繁複，在外界是出了名的難做。',
		name: '惠靈頓牛排',
	},
	44: {
		description: '流黃的水波蛋和大口的碳水，是早午餐的常見選擇。',
		name: '班尼迪克蛋',
	},
	45: {
		description: '早餐的簡單選擇，將準備好的麪糊煎熟，澆上蜂蜜就可以吃了。',
		name: '熱鬆餅',
	},
	46: {
		description: '英式下午茶的常客，外酥內軟。一般蘸着果醬或者奶油一起吃。',
		name: '司康餅',
	},
	47: {
		description:
			'將整塊帶皮的三文魚煎至外焦裏嫩，配上鮮嫩的竹筍——不過外界這個菜譜一般是蘆筍，這也算是幻想鄉式的融合菜吧。',
		name: '香煎三文魚',
	},
	48: {
		description:
			'家常奶油濃湯，制作方法簡單，無論是蘸麪包還是當作燉菜來吃都是非常不錯的料理。',
		name: '奶油燉菜',
	},
	49: {
		description:
			'來自紅美鈴老家的特殊做法，製作工序有點繁複，但是口感獨一無二，令人難忘。',
		name: '蜜汁叉燒',
	},
	50: {
		description: '來自紅美鈴老家的煲湯技巧，色香味俱全，益氣補血。',
		name: '白果蘿蔔排骨湯',
	},
	51: {
		description:
			'“所謂的竹取姬，本質和這玩意兒也沒什麼兩樣！”——藤原妹紅在永遠亭就地取材，使用新鮮的食材和米飯一起塞進竹筒中蒸熟。飯被竹子的清香充分浸潤後，中和了山豬肉帶來的油膩。',
		name: '竹取姬',
	},
	52: {
		description:
			'“哈~火雞的肚子裏也就是這些東西了~”——蓬萊山輝夜使用麪粉烘培出烤火雞的形狀，在表面刷上蜂蜜，肚子裏塞滿食材，進行充分的烘烤。出爐的假烤雞有着香脆的外皮和多汁的內餡。',
		name: '不死鳥',
	},
	53: {
		description:
			'永遠亭特產改良的麻薯糰子，加入了高級食材月光草，造型可愛的同時，還有“月光一樣的口感”。',
		name: '月光糰子',
	},
	54: {
		description: '最普通的糯米糰子，大家都喜歡的和風甜食。',
		name: '麻薯',
	},
	55: {
		description:
			'狀似外界古箏的經典和果子，加入白桃內餡之後呈現淡粉色，非常誘人。',
		name: '白桃生八橋',
	},
	56: {
		description:
			'外界似乎很流行使用〇〇戀人作為地區伴手禮，永遠亭也不甘落後潮流，推出了自己的版本！',
		name: '月之戀人',
	},
	57: {
		description:
			'脱胎於花札的豬鹿蝶牌型，將豬肉和鹿肉清燉，佐以花朵引出食材本身鮮味的精緻料理。',
		name: '豬鹿蝶',
	},
	58: { description: '比起好吃，流水素面更多的是好玩。', name: '流水素面' },
	59: {
		description: '最樸素的的竹筍吃法，由豬肉的油光引出竹筍的鮮美。',
		name: '竹筍炒肉',
	},
	60: {
		description: '竹子作為容器蒸出來的茶碗蒸，別有一番風味。',
		name: '竹筒蒸蛋',
	},
	61: {
		description:
			'簡單地説就是使用竹籤串起各種高級肉類，一口吃個飽的料理。但是在輝夜小姐的脅迫下，成為了高級的冠名料理。',
		name: '蓬萊玉枝',
	},
	62: {
		description:
			'少見的黑色豆腐，散發着令人難以接近的味道……讓人不禁懷疑：這真的可以吃嗎？但是實際吃過的人表示根本停不下來。',
		name: '臭豆腐',
	},
	63: {
		description:
			'散發着七彩的氣場的高級生煎包。據説有些生煎原教旨主義者尖鋭地反對加入豬肉以外食材的做法。',
		name: '華光玉煎包',
	},
	64: {
		description:
			'在日本很有名的中華料理。使用獨特的豆腐烹飪技巧烹製而成的辛辣料理，用它來拌飯吃可是會上癮的哦~',
		name: '麻婆豆腐',
	},
	65: {
		description:
			'正宗的四川中華料理。鮮嫩肥美的魚肉與猶如半天朱霞的辣椒一起翻滾，煮成了一道魚香四溢、椒味襲人的絕味。',
		name: '水煮魚',
	},
	66: {
		description:
			'原本是內測人員的特殊食譜，三年來一直令全收集強迫症玩家坐卧不寧，這次徹底開放了……',
		name: '月餅',
	},
	67: {
		description:
			'方形的三色毛玉冰激凌，從顏色到口味上都非常惹人喜愛。幾乎是人手一份的招牌甜品。',
		name: '毛玉三色冰激凌',
	},
	68: {
		description:
			'方形的火山毛玉造型，彷彿着了火的熔岩豆腐。受到喜歡舌苔刺激的人的追捧。',
		name: '毛玉熔岩豆腐',
	},
	69: {
		description:
			'以猩紅惡魔頭上的帽子為原型製作的夢幻甜食，切開會有彷彿血液一般的甜美醬料流出。',
		name: '猩紅惡魔蛋糕',
	},
	70: {
		description:
			'以無意識妖怪的帽子為原型製作的深沉甜食，即使切開感受到的也是無盡的黑暗，但香醇的程度令人流連忘返。',
		name: '無意識妖怪慕斯',
	},
	71: {
		description:
			'海的另一邊，紅美鈴小姐家鄉的著名食譜，用麪粉製作成的筋道麪皮，在其中包入任意喜歡的食材，放入沸騰的熱水中煮熟，就會成為超級美味的食物。外表看起來樸素無華，內在卻包着世間的寶藏。',
		name: '水餃',
	},
	72: {
		description:
			'海的另一邊，紅美鈴小姐家鄉的著名食譜，用彈牙的糯米揉成小團，在其中包入甜品食材，放入沸騰的熱水中煮熟，就會成為超級可口的甜品。外表看起來樸素無華，內在卻包着世間的甜蜜。',
		name: '湯圓',
	},
	1000: {
		description:
			'“天婦羅”又名“天麩羅”。將新鮮大蝦裹上麪粉做的羅衣，放入油鍋炸至金黃酥脆，再控油撈出，隔壁家的童子都饞哭了。',
		name: '炸蝦天婦羅',
	},
	1001: {
		description:
			'在魚餡內加入適量蜂蜜攪拌後，碾壓成魚餅，投入油鍋炸至金黃色，隨炸隨食。',
		name: '黃金酥魚餅',
	},
	1002: {
		description:
			'將各種高級烤肉堆成小山的料理，無論視覺還是分量上都簡單暴力，對於嗅覺靈敏的食客是秒殺級的食譜。',
		name: '全肉盛宴',
	},
	1003: {
		description: '將黃瓜切段後用鹽等調味醃製，出現了神奇而難以抗拒的風味。',
		name: '醃黃瓜',
	},
	1004: {
		description:
			'奶油焗的螃蟹在沒開蓋之前就已經香氣四溢，然而這香氣只是前戲。撕開蟹鉗，彈出白嫩飽滿的肉質，此時再細細地吸入湯汁，螃蟹固有的鮮味才徹底地融合與釋放。',
		name: '奶油焗蟹',
	},
	1005: {
		description:
			'據説尻子玉是人類進化後殘存的尾骨，是河童一族最喜歡的食物。從前用血腥的方式從人類那裏奪取，但是隨着時代的進步、已經有了料理的方式來替代，只是成本昂貴。',
		name: '擬尻子玉',
	},
	1006: {
		description:
			'聽説是外界流行的街邊小吃，使用麪糊和各種食材混合後在鐵板上燒製而成，脆香而豐富，因其百變和平價的特性被所有人喜愛。',
		name: '大阪燒',
	},
	1007: {
		description:
			'聽説也是外界流行的街邊小吃，在特製的麪糊中裹上引發奇蹟的章魚腳，糯脆的外衣之下Q彈的章魚腳產生讓人幸福的感覺。',
		name: '章魚燒',
	},
	1008: {
		description:
			'製作意外的簡單，但食材的獲取卻非常的困難，據説是現世流行的超高級料理，是每個人的夢想。',
		name: '海膽刺身',
	},
	1009: {
		description: '將蘑菇和肉切片後，混入鍋裏一起炒，是非常基本的家常料理。',
		name: '蘑菇肉片',
	},
	1010: {
		description:
			'長期專研於蘑菇學的人類魔法使所創的秘製菜譜。食材均選自魔法森林所產的新鮮菌類，據説較其他地方產出的菌類有更高營養價值。',
		name: '秘製鮮菌煲',
	},
	1011: {
		description:
			'蘑菇為主角，佐以各種鮮嫩食材的強力料理，金燦燦的光芒散發着強烈的存在感，香濃的口感可以瞬間蒸發人的靈魂，一發沉淪。',
		name: '蘑女的舞踏燴',
	},
	1012: {
		description:
			'濃郁的奶香湯底煮出來的魔性之湯，嘗下第一口就無法停下來。製作簡單、材料隨處可見，還擁有極高的營養價值。',
		name: '奶香蘑菇湯',
	},
	1013: {
		description:
			'有着驚人熱量的小點心，據説能迅速強健體魄。上面寫着“吃掉我”，非常誘人。吃多了估計會長胖吧……',
		name: '普通小蛋糕',
	},
	1014: {
		description:
			'經典甜食輔以特殊的處理，呈現夢幻的色彩，讓人敬畏、只敢遠觀不敢褻玩，能吃上一次，終生難忘。',
		name: '七色羊羹',
	},
	1015: {
		description:
			'日本最傳統的料理之一，將魚切片後蓋在手握的飯糰上，解餓又鮮美，擁有很長的歷史。',
		name: '手握壽司',
	},
	1016: {
		description:
			'掏空小南瓜，用鮮嫩的蝦肉和豆腐填充，再進行蒸制，香甜可口，又非常健康。',
		name: '南瓜蝦盅',
	},
	1017: {
		description:
			'由東方文明古國最強料理改造而來，據説得道的真佛也會因為它的氣味奪牆而走，摒棄齋戒，真的是很神奇！',
		name: '幻想佛跳牆',
	},
	2000: {
		description:
			'在一些陰鬱的妖怪中流行的零食，在濃郁的芝士中混有白果獨有的苦味，能讓味覺產生強烈的回甘後味，但我完全無法理解。',
		name: '喪氣芝士條',
	},
	2001: {
		description:
			'對喜歡酸味的人來説是味蕾的盛宴，但不喜歡酸味的人就是牙齒和舌頭的炸彈！只在一些小眾的妖怪中流行的奇怪做法。',
		name: '陰鬱水果派',
	},
	2002: {
		description:
			'舊地獄中最流行的聚會小吃，將各種食材置入後，加上辣椒刺激，讓人汗流滿面的同時，卻無法停下，是魔力十足的料理。',
		name: '絕叫關東煮',
	},
	2003: {
		description:
			'將蟲類的甲殼磨成大碎塊，拌入面中，吃起來香脆又下火，有一種別樣的異世界獵奇感的奇怪料理。',
		name: '脆旋風',
	},
	2004: {
		description:
			'在水果派裏探出一個魚頭，彷彿看着地底的天花板，充滿了與地獄相襯的絕望氣息。',
		name: '仰望天花板派',
	},
	2005: {
		description:
			'無論是地上還是地下，兜角甲蟲都是力量和無敵的象徵！這是憧憬它的力量而誕生的盔甲料理！',
		name: '兜甲蒸糕',
	},
	2006: {
		description:
			'愛酒之人無不喜歡的基礎下酒菜！氣派又野性的獅子頭配上烈性的酒，是鬼族起牀的早餐！',
		name: '獅子頭',
	},
	2007: {
		description:
			'將普通的玉子燒做大許多倍，就是這款在鬼族中流行的巨人玉子燒了！其澎湃的存在感讓豪邁之人為其燃燒！',
		name: '巨人玉子燒',
	},
	2008: {
		description:
			'用華麗的祭典船造型、擺滿上好的魚刺身、周圍散發着保鮮而製作的冰霧，是真真真正的宴會的焦點！',
		name: '大江户船祭',
	},
	2009: {
		description:
			'粉色的可愛甜品，Q軟又富有彈性，香蜜的甜美氣息使它成為世界上所有的女孩子都無法拒絕的無敵甜品。',
		name: '櫻花布丁',
	},
	2010: {
		description:
			'大大提升了酸度的可怕布丁，改良了提神的效果，只要吃一口，就能讓睏倦的身體打起精神，但因為其用料過於兇猛，很不利於口腔健康……',
		name: '提神布丁',
	},
	2011: {
		description:
			'究極加料、一顆就調動起身上包括多巴胺腎上腺激素等多種興奮元素瘋狂舞動的禁忌甜食，妖怪食用後可以瘋狂舞蹈一整夜，但是興奮過後會不由地感到“我燃盡了”。',
		name: '燃盡布丁',
	},
	2012: {
		description:
			'據説是阿燐剛剛被覺收養時、覺常做給她的簡易蓋澆飯，麵粉勾芡後淋在魚肉上，那種温柔的味道一直留在燐的記憶裏。',
		name: '貓飯',
	},
	2013: {
		description:
			'將三文魚裹上蛋液和麵粉，炸至通體金黃，咬一口汁水四溢，隔壁的貓貓都饞哭啦！',
		name: '三文魚天婦羅',
	},
	2014: {
		description:
			'外表是鯉魚起跳的造型，剖開後盡是夢幻的寶藏，是貓科動物無法抵抗的究極美食。',
		name: '魚躍龍門',
	},
	2015: {
		description:
			'據説是阿空剛剛被覺收養時、覺常做給她的料理，在蛋餅裏混入濃香的芝士，讓人無法拒絕的小吃。',
		name: '芝士蛋',
	},
	2016: {
		description:
			'加入了極為刺激的食材和輔料，對味覺的刺激滿點的超級烤串，阿空親自為它起了一個中二度滿滿的名字，結果在保持野性的妖怪中莫名的有人氣。',
		name: '一擊☆必殺',
	},
	2017: {
		description:
			'超超超級辣加倍的牛肉咖喱飯！據説只有擁有極限忍耐力的人和傻瓜才會嘗試這道料理！',
		name: '地獄激辛警告！',
	},
	3000: {
		description:
			'無論什麼時候都大受歡迎的民間小吃。尤其在寒冷的冬天，看到熱氣騰騰的烤爐，想到那紅皮黃瓤的顏色、熱乎甜軟的口感，誰能忍得住呢？但不能貪嘴，吃太多容易導致胃腹不適。',
		name: '烤地瓜',
	},
	3001: {
		description:
			'外表看起來像是拉長了的糰子，切開後中間裹着各式各樣的圖案，大大增加了糰子的新鮮感。據説瘦馬糰子象徵佛舍利，那不就是佛祖的骨灰嗎？',
		name: '瘦馬糰子',
	},
	3002: {
		description:
			'從幻曇華中提取色素，給一個個蘑菇傘染上顏色，將之鋪在寶箱周圍就像被錦花簇擁着。寶箱裏究竟藏有什麼驚喜呢？懷着這樣的想法打開，跳出來的卻是伸着大舌頭的滑稽的傘！嚇一跳了吧——？',
		name: '驚嚇！大冒險',
	},
	3003: {
		description:
			'從海難中逃到荒島的倖存者，萬般無奈地將已被海水浸濕的麪粉和芝士混合成的“麪糊”放在陽光下烤，沒想到味道變得十分香脆可口。於是這個做法流傳了下來。',
		name: '比斯開灣餅乾',
	},
	3004: {
		description:
			'據説“海盜”這個詞的來源是在明火上烹製的燻肉。加勒比本地人就是用這種做法來處理肉類，然後賣給海盜。聽起來就和米飯蓋澆米飯一樣奇怪。',
		name: '海盜燻肉',
	},
	3005: {
		description:
			'源自佛門的齋菜。傳聞正宗的羅漢齋用十八種原料製成，工序複雜考究，成菜色澤繽紛雅緻，味道清淡香郁。堪稱佛門最奢華的一道素菜。',
		name: '羅漢上素',
	},
	3006: {
		description:
			'命蓮寺的弟子中有個能夠變幻形態的入道，只要見過他的樣子，就很容易聯想到棉花糖。加入桃汁製作的棉花糖甜而不膩，造型生動有趣，深受小孩子的喜愛。',
		name: '雲山棉花糖',
	},
	3007: {
		description:
			'將新鮮蓮子剝殼去芯，煮至軟爛，再將黃油與麪粉攪拌均勻，最後混合翻炒，用模具壓出美麗的蓮花圖案，看起來神聖潔白。',
		name: '聖白蓮子糕',
	},
	3008: {
		description:
			'以南瓜做的船，承載着如夢似幻的食材，在蓮子鋪成的河上駛入幻想。據説每每享用完這道料理，都會有如夢方醒的感覺。至於究竟是何種夢境，便是因人而異了。',
		name: '幻想星蓮船',
	},
	3009: {
		description:
			'以糯米為主料、輔以松子製作的藥膳。松子糕的粉質細膩，柔軟可口，並有清香的松子味，深受道士們喜愛。',
		name: '松子糕',
	},
	3010: {
		description:
			'白鹿和松樹都有長壽的寓意，深受追求長生的道教人士的推崇，於是有“鹿壽松貞”之畫，即一隻白鹿立於松樹之下。這道菜就是以這幅畫為印象創作出來的~',
		name: '白鹿貞松',
	},
	3011: {
		description:
			'做法極其講究的道教經典名菜。魚肚片片，要愈薄愈好；太極圖則要注意造型圓整、八卦形等距，最後再經過細心蒸煮，才能呈現出這道形象生動、魚肚軟糯的道家名菜。',
		name: '太極八卦魚肚',
	},
	3012: {
		description:
			'把栗子用蜂蜜熬煮之後的成品。栗子裏温和而濃郁的味道，可以有效地平衡外在的甜味。',
		name: '蜜餞栗子',
	},
	3013: {
		description:
			'神靈廟位處仙界，所栽種的慄樹據説都藴含仙氣。但我是分辨不出啦……將栗子佐以蘑菇燜煮，把看不見摸不着的仙氣濃縮成一鍋鮮甜味美又解饞的雜燴，豈不是更實在？',
		name: '天師板栗燜菇',
	},
	3014: {
		description:
			'潔白的盤中鋪上碧綠的荷葉，葉上還滾動着晶瑩的水珠，盤中央一朵白荷則增添了“仙氣”。每一盞裏都以鮮嫩的粉色荷花花瓣為底，盛着極上金槍魚、蓮子組成的“魚米盞”，又好吃又健康。',
		name: '荷花魚米盞',
	},
	3015: {
		description:
			'將番薯下鍋炸至金黃，再裹上能拉出細絲的糖衣，最後在抹過油的盤子上滾一圈，既可口又不粘牙。但不能貪嘴，吃太多容易導致胃腹不適。',
		name: '拔絲地瓜',
	},
	3016: {
		description:
			'葷素搭配均勻，味道也很好的常見佳餚。用兩種不同口感的菇類，包裹着精挑細選的嫩肉，給味蕾帶來層次感十足的享受。',
		name: '香煎雙菇肉卷',
	},
	3017: {
		description:
			'誰説炸物就必須得是鳥類呢？地上跑的、土里長的、水裏遊的都可以裹上麪粉放到油鍋裏炸一炸，出鍋皆是香味四溢、酥脆爽口。最後以夢幻的月光草為綴，巧妙地中和了炸物拼盤的油膩。',
		name: '什錦天婦羅',
	},
	4000: {
		description:
			'為什麼炸土豆條和番茄醬永遠是標配？我不僅偏要炸番茄條，我還要獨獨給它淋上土豆醬！——鬼人正邪把西紅柿裹上麪粉後放到油鍋炸一炸，出鍋後淋上自制土豆醬，嘗起來也算是別有一番趣味。',
		name: '炸番茄條',
	},
	4001: {
		description:
			'軟糯的肉加上香甜的桃子，即使白嘴吃也不會覺得膩。淋上蜂蜜一起翻炒，更是紅潤添香，非常適合下酒。',
		name: '蜜桃紅燒肉',
	},
	4002: {
		description:
			'使用革新技術製作的分子料理，據説是來自月都的食譜。在製作過程中存在許多無法理解之處，所以經過一定程度的再創作，最終成為這樣一個結合了世人眼中的“雅”與“俗”之物的地上料理，也寄託着正邪想要攪混天下的意願。',
		name: '逆轉天地！',
	},
	4003: {
		description:
			'用糯米製成的外皮，裏頭包着飽滿的帶皮紅小豆餡。餡料的量跟餅皮的量一樣甚至更多，使得大福的外型圓渾有致。據説大福就因為這樣的外型而被稱為“大腹餅”，後人取其吉祥的諧音改稱“大福”。',
		name: '紅豆大福',
	},
	4004: {
		description:
			'一種烤制麪皮、內置紅豆沙夾心的甜點。因由兩塊像銅鑼一樣的餅合起來的，故而得名銅鑼燒。',
		name: '銅鑼燒',
	},
	4005: {
		description:
			'用豆腐的潔白來形容貂嬋的純潔，以泥鰍的鑽營來影射董卓的奸滑。讓人在品嚐中，想到王允獻貂嬋，巧使美人計而除奸賊董卓的故事，自然為美食增添了文化的含量。',
		name: '漢宮藏嬌',
	},
	4006: {
		description:
			'以牛肉、竹筍為主要食材的一道家常菜品。鮮嫩的竹筍燉肉具有開胃、促進消化的作用，再以竹子作為擺盤，可謂是色香味俱全。',
		name: '石鍋竹筍燉肉',
	},
	4007: {
		description:
			'選用豬身上最嫩的部位，將新鮮的竹筒鋸留成節笆，通小孔，灌上菜料和香料，開大火蒸熟後飄出竹子的獨特清香。有時間的條件下，在醃漬肉片的時候加點清水會更加晶瑩潤口。',
		name: '竹筒粉蒸肉',
	},
	4008: {
		description:
			'將各種鮮嫩的食材放入多節竹筒蒸熟，寓意節節高升。而春竹翠綠嬌豔的樣子，既給客人帶來視覺味覺上的新意，還藴含着迎春的美好寓意。',
		name: '翠竹迎春',
	},
	4009: {
		description:
			'用湯汁和熱騰騰的白飯製作的茶泡飯！茶泡飯所用的湯汁通常為煎茶、烘焙茶或富有柴魚香氣的高湯，最後加入的梅子給這道素淡的菜品增添了一抹豔色。',
		name: '梅子茶泡飯',
	},
	4010: {
		description:
			'將雞蛋加入海膽蒸至海膽黃變色就可以出鍋的簡單料理。吃的時候用勺子挖下去，一口一勺，海膽和蛋羹互相融合滲透的美味就在味蕾上蔓延了。',
		name: '海膽蒸蛋',
	},
	4011: {
		description:
			'對火候要求極其苛刻的一道菜，需聚息凝神地將肉品烤至完美的三分熟。暗紅的色調以及極具破壞性的龍捲風形狀，帶來了山海欲來的壓迫感。一口下去，有種彷彿征服了天下的快感。',
		name: '幻想風靡',
	},
	4012: {
		description: '本質上是野菜拌蘑菇，但因為這個名字多了一些奇妙的童話感。',
		name: '綠野仙菇',
	},
	4013: {
		description:
			'牽絲攀藤地解開“花鳥風月”一詞，同時想象着幽香小姐做出來的三角蛋糕。整體風格就像她本人一樣風雅，不過上面插了一根我的羽毛，應該還算有趣吧？',
		name: '花鳥風月',
	},
	4014: {
		description:
			'以花卉為主題的雙層奶油蛋糕。錦簇花團鋪在細膩的奶油上，散發出絲絲香甜，藍色的蝴蝶輕輕駐足，久久不歸。這不是夢境，卻勝似夢境。',
		name: '幽夢',
	},
	4015: {
		description:
			'用有“毒”的野菜——香椿製成的煎餅。初嘗有種苦苦澀澀的味道，嚼下去後口齒留甘。牢記！給普通客人食用須先將香椿用開水焯過一遍！',
		name: '香椿煎餅',
	},
	4016: {
		description:
			'用各種“毒食材”混合燉煮的雜炊。通過細緻而精巧的食材處理手段，能夠不同程度地保留食材中的“毒性”，讓不同需求的客人均能體驗到他們想要的刺激。',
		name: '毒瘴花園',
	},
	4017: {
		description:
			'這是專門給小小的毒人偶——梅蒂欣製作的印象甜品。可愛中帶着詭異的色彩，猶如自然界中絢麗的毒蘑菇勾人採摘。實際是沒有毒的，梅蒂欣也是~',
		name: '小小的甜蜜「毒藥」',
	},
	5000: {
		description:
			'厚切的鰻魚塊抹上特調醬汁，再覆蓋一層軟嫩的生蛋，在食用前將其攪拌成金燦燦的樣子，吃下去超級滿足！',
		name: '鰻魚嫩蛋丼',
	},
	5001: {
		description:
			'把新鮮的蝦放進醇香的酒中浸泡，再冰鎮後淋上香料食用。既可以嚐到蝦的鮮香，同時也可以嚐到酒的洌香，十分可口。',
		name: '竹筒燒醉蝦',
	},
	5002: {
		description:
			'一邊是魔界辣椒湯底，一邊是蘿蔔牛骨湯底，兼具紅白兩種湯汁的特色雙鍋牛肉。一家人，一個鍋，兩種口味團團圓圓，彷彿有了它就有家的氣息。',
		name: '牛肉鴛鴦火鍋',
	},
	5003: {
		description:
			'迷人的焦糖脆外殼與軟糯香濃的內心，無論在口感層次變化或者味覺體驗都堪稱一絕，不愧是“天使的銅鈴”——咦？鈴鐺裏居然還藏了只小貓咪！',
		name: '貓咪可露麗',
	},
	5004: {
		description:
			'在發酵的圓麪餅上面覆蓋各種配料烤制而成，完美兼顧了營養和品相，焦糖洋葱的醇香滋味更是為其帶來了多重的舌尖享受。可愛的貓咪外形讓人有些不忍下嘴呢～',
		name: '貓咪披薩',
	},
	5005: {
		description:
			'貓咪主題的吐司盒。把一整個方塊吐司挖空，底部塗上一層奶油，放入一層桃子果醬，再塗上一層奶油，鋪一片吐司，加入晶瑩剔透的白涼粉，最後再用調色奶油映照出藍色的水面效果，放入巧克力做的貓咪，就成了一副有趣的貓咪戲水圖了。',
		name: '貓咪戲水',
	},
	5006: {
		description:
			'擺盤精緻的蝦仁南瓜意面。南瓜蒸熟後又甜又糯，用它代替奶油做出來的意麪低脂低卡，味道濃郁，營養十足！',
		name: '長髮公主',
	},
	5007: {
		description:
			'以金槍魚高湯製作的餅身清透乾淨，與新鮮海膽組成高級的香檳色系搭配，底層的胡麻醬更增一絲醇厚的口感。如此玲瓏的甜品，讓人不忍破壞這晶瑩剔透的美麗。',
		name: '海膽信玄餅',
	},
	5008: {
		description:
			'以魔界茶會為印象製作的甜品。表面看起來是一個巧克力做的茶壺，茶壺的肚子裏是層層堆疊的奶油蛋糕，周圍裝飾着蘑菇和西藍花，就像某個故事裏的巧克力房子一樣，是充滿了夢幻和不可思議的幸福甜品。',
		name: '瘋帽子茶會',
	},
	5009: {
		description:
			'通過膠凝化技術，把粉嫩可愛的桃花製成晶瑩剔透的琉璃果凍外皮，裹着糯嘰嘰的豆沙餡，記錄季節的浪漫與甜蜜。',
		name: '桃花琉璃卷',
	},
	5010: {
		description:
			'清爽細膩的葡萄烏龍凍，白色的是奶油慕斯！奶油的綿密與葡萄的清爽在舌尖碰撞出別樣滋味，茶凍間點綴片片青提，馥郁果香充盈唇齒。菏澤上的小露珠也相當有趣～',
		name: '荷塘月色',
	},
	5011: {
		description:
			'本質上就是用桃子來製作桃子。將桃子作為原材料打碎，最後再還原出最初始的形狀，從表面來看似乎是貫徹了一種返璞歸真的理念，但製作過程極其繁瑣考究。',
		name: '龍吟桃子',
	},
	5012: {
		description:
			'選用水分較少的北豆腐作為蛋白，甜糯的南瓜作為蛋黃，再用白巧克力做成蛋殼，還原出雞蛋的模樣與口感，讓人意想不到呢。',
		name: '分子蛋',
	},
	5013: {
		description:
			'初見就像是雲山霧罩的神秘星球，打開一看“星球”裏竟然擺了個生雞蛋？仔細看蛋液其實是銀耳湯，蛋黃則是南瓜泥。吃起來口感清爽，還有香濃的南瓜味。',
		name: '生命之源',
	},
	5014: {
		description:
			'特別定製的盤底如火星地表一般，上面盛放着頂級的螃蟹凍以及白葡萄分子技術製作的果凝。螃蟹口感冰涼順滑不膩，果凝如水滴一般，而且帶着淡淡酒香。寓意火星上一滴水珠，代表着最後的希望。',
		name: '火星',
	},
	5015: {
		description:
			'口味偏甜、營養豐富的銀耳蓮子粥。滋潤而不膩滯，還具有養心安神的功效。',
		name: '養心粥',
	},
	5016: {
		description:
			'由多種天然中草藥按比例配製的湯料，再加入胡椒和辣椒，又用骨頭湯做底料的牛肉胡辣湯，喝一口就能驅散瞌睡蟲。',
		name: '胡辣湯',
	},
	5017: {
		description:
			'以海鮮湯料煨煮的湯麪，勁道爽滑，湯濃鮮美，是一道非常豪華的家常菜。憑一碗海鮮面，便能讓人記住深藏着的大海的味道。',
		name: '至尊海鮮面',
	},
	11000: { description: null, name: null },
	11001: { description: null, name: null },
	11002: { description: null, name: null },
	11003: { description: null, name: null },
	11004: { description: null, name: null },
	11005: { description: null, name: null },
	11006: { description: null, name: null },
	11007: { description: null, name: null },
	11008: { description: null, name: null },
	11009: { description: null, name: null },
	11010: { description: null, name: null },
	11011: { description: null, name: null },
	11012: { description: null, name: null },
	11013: { description: null, name: null },
	11014: { description: null, name: null },
	11015: { description: null, name: null },
	11016: { description: null, name: null },
	11017: { description: null, name: null },
	11018: { description: null, name: null },
	11019: { description: null, name: null },
	11020: { description: null, name: null },
	11021: { description: null, name: null },
	11022: { description: null, name: null },
	11023: { description: null, name: null },
	11024: { description: null, name: null },
	11025: { description: null, name: null },
	11026: { description: null, name: null },
	11027: { description: null, name: null },
	11028: { description: null, name: null },
	11029: { description: null, name: null },
	12000: { description: null, name: null },
	12001: { description: null, name: null },
	12002: { description: null, name: null },
	12003: { description: null, name: null },
	12004: { description: null, name: null },
	12005: { description: null, name: null },
	[-1]: {
		description:
			'烹飪失誤、散發着黑色氣場的不明物質，不會有人想吃這種東西……吧？',
		name: '黑暗物質',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
