import type { ILocalizedEffectText } from '@/domain/data/localization/types';

export const COOKER_LOCALIZATION_JA = {
	0: {
		description:
			'普通の煮物用の鍋。中国産の年代物の土を使って作られている。熱の伝導性が高く、内部に程よく圧力がかかるため、効率よく調理ができる。どんな料理人にとっても扱いやすい一品。',
		name: '煮込み鍋',
	},
	1: {
		description:
			'普通のグリル。炭火を使うことで、焼き網に並べた食材に均一に火を通す。そうしてできた野性味溢れる味は、荒くれ者達にもっぱら好評だ。',
		name: 'グリル',
	},
	2: {
		description:
			'油を入れて高温に加熱し、あとはとりあえず食材を放り込んでおけば、おいしい料理に大変身だなんて、なんという悪魔的発想…！……とはいえ、身体にいいものではない。',
		name: '揚げ鍋',
	},
	3: {
		description:
			'蒸し物は画期的な調理法といえる。多くの食材を一度に扱えるうえに調理も短時間で済む。更にいえば食材の栄養素も損なわれない……ということから、健康志向の皆様に大人気だそうだ。',
		name: '蒸し器',
	},
	4: {
		description:
			'食材を扱う際に欠かせない道具。生肉・生魚の下ごしらえや、冷菜・サラダ類の調理など、どんな用途にも対応している。素材の味を生かしてみよう。',
		name: 'まな板',
	},
	5: {
		description: '「夜雀の歌声に惑わされるといいわ！」',
		effect: [
			'調理時間が25%増加。「夜雀の歌」か「烈火衝天」をパーフェクトで成功させたとき、料理をレア客の注文内容に関わらず提供し、客の好みだけに対応した評価を得られる。',
			true,
		],
		name: '夜雀煮込み鍋',
	},
	6: {
		description: '「夜雀の歌声に惑わされるといいわ！」',
		effect: [
			'調理時間が25%増加。「夜雀の歌」か「烈火衝天」をパーフェクトで成功させたとき、料理をレア客の注文内容に関わらず提供し、客の好みだけに対応した評価を得られる。',
			true,
		],
		name: '夜雀グリル',
	},
	7: {
		description: '「夜雀の歌声に惑わされるといいわ！」',
		effect: [
			'調理時間が25%増加。「夜雀の歌」か「烈火衝天」をパーフェクトで成功させたとき、料理をレア客の注文内容に関わらず提供し、客の好みだけに対応した評価を得られる。',
			true,
		],
		name: '夜雀揚げ鍋',
	},
	8: {
		description: '「夜雀の歌声に惑わされるといいわ！」',
		effect: [
			'調理時間が25%増加。「夜雀の歌」か「烈火衝天」をパーフェクトで成功させたとき、料理をレア客の注文内容に関わらず提供し、客の好みだけに対応した評価を得られる。',
			true,
		],
		name: '夜雀蒸し器',
	},
	9: {
		description: '「夜雀の歌声に惑わされるといいわ！」',
		effect: [
			'調理時間が25%増加。「夜雀の歌」か「烈火衝天」をパーフェクトで成功させたとき、料理をレア客の注文内容に関わらず提供し、客の好みだけに対応した評価を得られる。',
			true,
		],
		name: '夜雀まな板',
	},
	10: {
		description: 'アップグレードされた煮込み鍋だ！',
		effect: '調理時間が5%短縮され、追加注文の確率が3%アップ。',
		name: '超煮込み鍋',
	},
	11: {
		description: 'アップグレードされたグリルだ！',
		effect: '調理時間が5%短縮され、追加注文の確率が3%アップ。',
		name: '超グリル',
	},
	12: {
		description: 'アップグレードされた揚げ鍋だ！',
		effect: '調理時間が5%短縮され、追加注文の確率が3%アップ。',
		name: '超揚げ鍋',
	},
	13: {
		description: 'アップグレードされた蒸し器だ！',
		effect: '調理時間が5%短縮され、追加注文の確率が3%アップ。',
		name: '超蒸し器',
	},
	14: {
		description: 'アップグレードされたまな板だ！',
		effect: '調理時間が5%短縮され、追加注文の確率が3%アップ。',
		name: '超まな板',
	},
	15: {
		description: '究極の煮込み鍋だ！',
		effect: '調理時間が10%短縮され、追加注文の確率が8%アップ。',
		name: '極煮込み鍋',
	},
	16: {
		description: '究極のグリルだ！',
		effect: '調理時間が10%短縮され、追加注文の確率が8%アップ。',
		name: '極グリル',
	},
	17: {
		description: '究極の揚げ鍋だ！',
		effect: '調理時間が10%短縮され、追加注文の確率が8%アップ。',
		name: '極揚げ鍋',
	},
	18: {
		description: '究極の蒸し器だ！',
		effect: '調理時間が10%短縮され、追加注文の確率が8%アップ。',
		name: '極蒸し器',
	},
	19: {
		description: '究極のまな板だ！',
		effect: '調理時間が10%短縮され、追加注文の確率が8%アップ。',
		name: '極まな板',
	},
	20: {
		description:
			'「最新の〈危険〉技術だとかのおかげで、お料理が光速で作れちゃうわ～！……ただ、代償ってなんのことかしら？」',
		effect: [
			'調理時間が50%短縮。40%の確率でダークマターを作り出してしまう。ただし、演奏をパーフェクトで成功させると、確率が5%まで低下する。',
			true,
		],
		name: '核煮込み鍋',
	},
	21: {
		description:
			'「最新の〈危険〉技術だとかのおかげで、お料理が光速で作れちゃうわ～！……ただ、代償ってなんのことかしら？」',
		effect: [
			'調理時間が50%短縮。40%の確率でダークマターを作り出してしまう。ただし、演奏をパーフェクトで成功させると、確率が5%まで低下する。',
			true,
		],
		name: '核グリル',
	},
	22: {
		description:
			'「最新の〈危険〉技術だとかのおかげで、お料理が光速で作れちゃうわ～！……ただ、代償ってなんのことかしら？」',
		effect: [
			'調理時間が50%短縮。40%の確率でダークマターを作り出してしまう。ただし、演奏をパーフェクトで成功させると、確率が5%まで低下する。',
			true,
		],
		name: '核揚げ鍋',
	},
	23: {
		description:
			'「最新の〈危険〉技術だとかのおかげで、お料理が光速で作れちゃうわ～！……ただ、代償ってなんのことかしら？」',
		effect: [
			'調理時間が50%短縮。40%の確率でダークマターを作り出してしまう。ただし、演奏をパーフェクトで成功させると、確率が5%まで低下する。',
			true,
		],
		name: '核蒸し器',
	},
	24: {
		description:
			'「最新の〈危険〉技術だとかのおかげで、お料理が光速で作れちゃうわ～！……ただ、代償ってなんのことかしら？」',
		effect: [
			'調理時間が50%短縮。40%の確率でダークマターを作り出してしまう。ただし、演奏をパーフェクトで成功させると、確率が5%まで低下する。',
			true,
		],
		name: '核まな板',
	},
	25: {
		description:
			'「あやしい」技術を加えることで、料理を口にした客をとても喜ばすことができる！ミスティアの使用時に限り有効「よくわかんないけど、とにかく繁盛しまくってるわね！」',
		effect: ['調理時間が10%増加し、追加注文の確率が30%アップ。', true],
		name: 'あやしい煮込み鍋',
	},
	26: {
		description:
			'「あやしい」技術を加えることで、料理を口にした客をとても喜ばすことができる！ミスティアの使用時に限り有効「よくわかんないけど、とにかく繁盛しまくってるわね！」',
		effect: ['調理時間が10%増加し、追加注文の確率が30%アップ。', true],
		name: 'あやしいグリル',
	},
	27: {
		description:
			'「あやしい」技術を加えることで、料理を口にした客をとても喜ばすことができる！ミスティアの使用時に限り有効「よくわかんないけど、とにかく繁盛しまくってるわね！」',
		effect: ['調理時間が10%増加し、追加注文の確率が30%アップ。', true],
		name: 'あやしい揚げ鍋',
	},
	28: {
		description:
			'「あやしい」技術を加えることで、料理を口にした客をとても喜ばすことができる！ミスティアの使用時に限り有効「よくわかんないけど、とにかく繁盛しまくってるわね！」',
		effect: ['調理時間が10%増加し、追加注文の確率が30%アップ。', true],
		name: 'あやしい蒸し器',
	},
	29: {
		description:
			'「あやしい」技術を加えることで、料理を口にした客をとても喜ばすことができる！ミスティアの使用時に限り有効「よくわかんないけど、とにかく繁盛しまくってるわね！」',
		effect: ['調理時間が10%増加し、追加注文の確率が30%アップ。', true],
		name: 'あやしいまな板',
	},
	30: {
		description:
			'調理時に$a%の確率で子うさぎが生成される。子うさぎは一匹ごとにチップ率が$b%上昇するが、$c秒経過すると去っていく。ミスティアの使用時に限り有効「因幡の兎が関わるものはとにかく胡散臭いとはいえ……子うさぎは無視できないじゃない！？」',
		effect: [
			'料理を作るたびに40%の確率で子ウサギが1匹現れる。子ウサギ1匹につきチップ倍率が5%アップ（重複可）、20秒後に去る。',
			true,
		],
		name: '月見煮込み鍋',
	},
	31: {
		description:
			'調理時に$a%の確率で子うさぎが生成される。子うさぎは一匹ごとにチップ率が$b%上昇するが、$c秒経過すると去っていく。ミスティアの使用時に限り有効「因幡の兎が関わるものはとにかく胡散臭いとはいえ……子うさぎは無視できないじゃない！？」',
		effect: [
			'料理を作るたびに40%の確率で子ウサギが1匹現れる。子ウサギ1匹につきチップ倍率が5%アップ（重複可）、20秒後に去る。',
			true,
		],
		name: '月見グリル',
	},
	32: {
		description:
			'調理時に$a%の確率で子うさぎが生成される。子うさぎは一匹ごとにチップ率が$b%上昇するが、$c秒経過すると去っていく。ミスティアの使用時に限り有効「因幡の兎が関わるものはとにかく胡散臭いとはいえ……子うさぎは無視できないじゃない！？」',
		effect: [
			'料理を作るたびに40%の確率で子ウサギが1匹現れる。子ウサギ1匹につきチップ倍率が5%アップ（重複可）、20秒後に去る。',
			true,
		],
		name: '月見揚げ鍋',
	},
	33: {
		description:
			'調理時に$a%の確率で子うさぎが生成される。子うさぎは一匹ごとにチップ率が$b%上昇するが、$c秒経過すると去っていく。ミスティアの使用時に限り有効「因幡の兎が関わるものはとにかく胡散臭いとはいえ……子うさぎは無視できないじゃない！？」',
		effect: [
			'料理を作るたびに40%の確率で子ウサギが1匹現れる。子ウサギ1匹につきチップ倍率が5%アップ（重複可）、20秒後に去る。',
			true,
		],
		name: '月見蒸し器',
	},
	34: {
		description:
			'調理時に$a%の確率で子うさぎが生成される。子うさぎは一匹ごとにチップ率が$b%上昇するが、$c秒経過すると去っていく。ミスティアの使用時に限り有効「因幡の兎が関わるものはとにかく胡散臭いとはいえ……子うさぎは無視できないじゃない！？」',
		effect: [
			'料理を作るたびに40%の確率で子ウサギが1匹現れる。子ウサギ1匹につきチップ倍率が5%アップ（重複可）、20秒後に去る。',
			true,
		],
		name: '月見まな板',
	},
	1000: {
		description: '「ソロモンよ、帰ってきましたよ！」',
		effect: [
			'調理時間が40%増加。ミスティアはこの調理器具を60秒使った後、調理時間を80%減らすことができ、さらに調理後に次の食材のうち1つが生成される：最も高い、最も安い、最も多い、最も少ない、キノコ、トリュフ。',
			true,
		],
		name: '「沸き立つ星屑」',
	},
	2000: {
		description: '「純粋な料理地獄」',
		effect: [
			'調理時間が20%短縮。調理が終わると、自動的に前回作った料理（追加の素材を含む）を作り始める。自動調理は食材を消費せずにいつでも中断できる。',
			true,
		],
		name: '「純粋煉獄」',
	},
	3000: {
		description:
			'天枢と七星の力を合わせて焼いた肉は、無上の逸品に決まってる。',
		effect: [
			'調理時間が15%短縮。「肉」タグのある料理は即座に完成し、30%の確率で食材を消費しない。',
			true,
		],
		name: '「紫薇天火」',
	},
	4000: {
		description: '「料理はニュースと同じ、盛りだくさんの要素が必要だ」',
		effect: [
			'調理時間が20%短縮。調理時に追加食材を入れていないと調理時間を70%減らす、そうでなければ追加注文率を30%上げる。料理に「人気」タグが含まれていると、二つの効果が同時に発動。',
			true,
		],
		name: '「馮風渡御」',
	},
	5000: {
		description: '「魔典の見せ方はどうでもいい！」',
		effect: [
			'料理に「肉」タグが含まれていないと調理時間を50%減らし、そうでなければ調理時間を30%増やす。「魔神復唱」この調理器具で作られた料理が客に評価されると、次にこの調理器具で作った料理も同じ評価を得られる。',
			true,
		],
		name: '「魔人経板」',
	},
	5001: {
		description:
			'「Welcome Hell」と書かれていて、何かのファッションブランドのようだ。',
		effect: '調理時間が33%短縮。蒸し器、揚げ鍋、煮込み鍋のいずれとしても使用できる。',
		name: '「三位一体」',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedEffectText>>>;
