import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const COOKER_LOCALIZATION_KO = {
	0: {
		description:
			'평범한 냄비입니다. 옛 중국의 흙을 사용해 만들었으며, 열전도성이 우수하고 내부에 압력을 골고루 가할 수 있어, 누구나 손쉽게 맛있는 요리를 만들 수 있는 도구입니다.',
		name: '냄비',
	},
	1: {
		description:
			'평범한 그릴입니다. 숯불을 사용해, 철판에 올려진 식재에 균등하게 열기를 가합니다. 음식에 거친 야생의 맛을 더해, 이를 선호하는 사람들도 있습니다.',
		name: '그릴',
	},
	2: {
		description:
			'기름을 뜨겁게 달군 뒤 식재를 넣어, 맛있는 요리를 만들어낼 수 있습니다. 이 얼마나 악마적 발상...! ......이라지만, 몸에는 별로 안 좋습니다.',
		name: '팬',
	},
	3: {
		description:
			'찜요리는 획기적인 조리법으로, 다량의 식재를 빠른 시간 내에 조리할 수 있습니다. 덤으로 재료에 있는 영양소를 파괴하지 않아, 건강을 중시하는 이들에게도 인기가 많습니다.',
		name: '찜기',
	},
	4: {
		description:
			'식재를 그대로 손질할 때 쓰이는 도구입니다. 날고기, 생선, 야채 등을 조리할 때 등에 사용되며, 재료 본연의 맛을 살릴 수 있습니다.',
		name: '도마',
	},
	5: {
		description:
			'「요스즈메의 노래」를 완벽히 성공하거나, 「분위기 최고조」 상태일 때, 손님의 주문과 상관 없이 손님의 선호도에 기반해 음식의 평가가 내려집니다. ——「밤참새의 노랫소리에 매혹되어라!」',
		name: '밤참새의 냄비',
	},
	6: {
		description:
			'「요스즈메의 노래」를 완벽히 성공하거나, 「분위기 최고조」 상태일 때, 손님의 주문과 상관 없이 손님의 선호도에 기반해 음식의 평가가 내려집니다. ——「밤참새의 노랫소리에 매혹되어라!」',
		name: '밤참새의 그릴',
	},
	7: {
		description:
			'「요스즈메의 노래」를 완벽히 성공하거나, 「분위기 최고조」 상태일 때, 손님의 주문과 상관 없이 손님의 선호도에 기반해 음식의 평가가 내려집니다. ——「밤참새의 노랫소리에 매혹되어라!」',
		name: '밤참새의 팬',
	},
	8: {
		description:
			'「요스즈메의 노래」를 완벽히 성공하거나, 「분위기 최고조」 상태일 때, 손님의 주문과 상관 없이 손님의 선호도에 기반해 음식의 평가가 내려집니다. ——「밤참새의 노랫소리에 매혹되어라!」',
		name: '밤참새의 찜기',
	},
	9: {
		description:
			'「요스즈메의 노래」를 완벽히 성공하거나, 「분위기 최고조」 상태일 때, 손님의 주문과 상관 없이 손님의 선호도에 기반해 음식의 평가가 내려집니다. ——「밤참새의 노랫소리에 매혹되어라!」',
		name: '밤참새의 도마',
	},
	10: { description: '업그레이드된 냄비입니다.', name: '초특급 냄비' },
	11: { description: '업그레이드된 그릴입니다.', name: '초특급 그릴' },
	12: { description: '업그레이드된 팬입니다.', name: '초특급 팬' },
	13: { description: '업그레이드된 찜기입니다.', name: '초특급 찜기' },
	14: { description: '업그레이드된 도마입니다.', name: '초특급 도마' },
	15: { description: '궁극의 냄비입니다.', name: '궁극의 냄비' },
	16: { description: '궁극의 그릴입니다.', name: '궁극의 그릴' },
	17: { description: '궁극의 팬입니다.', name: '궁극의 팬' },
	18: { description: '궁극의 찜기입니다.', name: '궁극의 찜기' },
	19: { description: '궁극의 도마입니다.', name: '궁극의 도마' },
	20: {
		description:
			'요리가 $a%의 확률로 암흑 물질이 됩니다. 「요스즈메의 노래」를 완벽히 성공할 시, 확률이 $b%로 줄어듭니다. 미스티아가 직접 사용할 때에만 효과가 적용됩니다. 「이 "위험한" 최신 기술이라면, 요리를 광속으로 만들 수 있어! ...근데, 뭐가 위험한거지?」',
		name: '원자력 냄비',
	},
	21: {
		description:
			'요리가 $a%의 확률로 암흑 물질이 됩니다. 「요스즈메의 노래」를 완벽히 성공할 시, 확률이 $b%로 줄어듭니다. 미스티아가 직접 사용할 때에만 효과가 적용됩니다. 「이 "위험한" 최신 기술이라면, 요리를 광속으로 만들 수 있어! ...근데, 뭐가 위험한거지?」',
		name: '원자력 그릴',
	},
	22: {
		description:
			'요리가 $a%의 확률로 암흑 물질이 됩니다. 「요스즈메의 노래」를 완벽히 성공할 시, 확률이 $b%로 줄어듭니다. 미스티아가 직접 사용할 때에만 효과가 적용됩니다. 「이 "위험한" 최신 기술이라면, 요리를 광속으로 만들 수 있어! ...근데, 뭐가 위험한거지?」',
		name: '원자력 팬',
	},
	23: {
		description:
			'요리가 $a%의 확률로 암흑 물질이 됩니다. 「요스즈메의 노래」를 완벽히 성공할 시, 확률이 $b%로 줄어듭니다. 미스티아가 직접 사용할 때에만 효과가 적용됩니다. 「이 "위험한" 최신 기술이라면, 요리를 광속으로 만들 수 있어! ...근데, 뭐가 위험한거지?」',
		name: '원자력 찜기',
	},
	24: {
		description:
			'요리가 $a%의 확률로 암흑 물질이 됩니다. 「요스즈메의 노래」를 완벽히 성공할 시, 확률이 $b%로 줄어듭니다. 미스티아가 직접 사용할 때에만 효과가 적용됩니다. 「이 "위험한" 최신 기술이라면, 요리를 광속으로 만들 수 있어! ...근데, 뭐가 위험한거지?」',
		name: '원자력 도마',
	},
	25: {
		description:
			'수상한 기술력이 더해진 조리기구입니다. 이걸로 만들어진 음식을 먹는 손님분들은 행복해 하는 것 같네요! 미스티아가 직접 사용할 때에만 효과가 적용됩니다. 「잘 모르겠지만, 어쨌든 장사가 잘 되네!」',
		name: '수상한 냄비',
	},
	26: {
		description:
			'수상한 기술력이 더해진 조리기구입니다. 이걸로 만들어진 음식을 먹는 손님분들은 행복해 하는 것 같네요! 미스티아가 직접 사용할 때에만 효과가 적용됩니다. 「잘 모르겠지만, 어쨌든 장사가 잘 되네!」',
		name: '수상한 그릴',
	},
	27: {
		description:
			'수상한 기술력이 더해진 조리기구입니다. 이걸로 만들어진 음식을 먹는 손님분들은 행복해 하는 것 같네요! 미스티아가 직접 사용할 때에만 효과가 적용됩니다. 「잘 모르겠지만, 어쨌든 장사가 잘 되네!」',
		name: '수상한 팬',
	},
	28: {
		description:
			'수상한 기술력이 더해진 조리기구입니다. 이걸로 만들어진 음식을 먹는 손님분들은 행복해 하는 것 같네요! 미스티아가 직접 사용할 때에만 효과가 적용됩니다. 「잘 모르겠지만, 어쨌든 장사가 잘 되네!」',
		name: '수상한 찜기',
	},
	29: {
		description:
			'수상한 기술력이 더해진 조리기구입니다. 이걸로 만들어진 음식을 먹는 손님분들은 행복해 하는 것 같네요! 미스티아가 직접 사용할 때에만 효과가 적용됩니다. 「잘 모르겠지만, 어쨌든 장사가 잘 되네!」',
		name: '수상한 도마',
	},
	30: {
		description:
			'조리 시 $a%의 확률로 토끼가 생성됩니다. 토끼들은 사라지기 전 $c초동안 여러 번 중첩되는 팁 $b% 상승의 효과를 가합니다. 미스티아가 직접 사용할 때에만 효과가 적용됩니다. 「이나바 토끼랑 관련있는 건 뭔들 수상쩍지만... 뭐, 이런 토끼를 보고도 못 본 체 할 순 없잖아!?」',
		name: '달맞이 냄비',
	},
	31: {
		description:
			'조리 시 $a%의 확률로 토끼가 생성됩니다. 토끼들은 사라지기 전 $c초동안 여러 번 중첩되는 팁 $b% 상승의 효과를 가합니다. 미스티아가 직접 사용할 때에만 효과가 적용됩니다. 「이나바 토끼랑 관련있는 건 뭔들 수상쩍지만... 뭐, 이런 토끼를 보고도 못 본 체 할 순 없잖아!?」',
		name: '달맞이 그릴',
	},
	32: {
		description:
			'조리 시 $a%의 확률로 토끼가 생성됩니다. 토끼들은 사라지기 전 $c초동안 여러 번 중첩되는 팁 $b% 상승의 효과를 가합니다. 미스티아가 직접 사용할 때에만 효과가 적용됩니다. 「이나바 토끼랑 관련있는 건 뭔들 수상쩍지만... 뭐, 이런 토끼를 보고도 못 본 체 할 순 없잖아!?」',
		name: '달맞이 팬',
	},
	33: {
		description:
			'조리 시 $a%의 확률로 토끼가 생성됩니다. 토끼들은 사라지기 전 $c초동안 여러 번 중첩되는 팁 $b% 상승의 효과를 가합니다. 미스티아가 직접 사용할 때에만 효과가 적용됩니다. 「이나바 토끼랑 관련있는 건 뭔들 수상쩍지만... 뭐, 이런 토끼를 보고도 못 본 체 할 순 없잖아!?」',
		name: '달맞이 찜기',
	},
	34: {
		description:
			'조리 시 $a%의 확률로 토끼가 생성됩니다. 토끼들은 사라지기 전 $c초동안 여러 번 중첩되는 팁 $b% 상승의 효과를 가합니다. 미스티아가 직접 사용할 때에만 효과가 적용됩니다. 「이나바 토끼랑 관련있는 건 뭔들 수상쩍지만... 뭐, 이런 토끼를 보고도 못 본 체 할 순 없잖아!?」',
		name: '달맞이 도마',
	},
	1000: {
		description:
			'미스티아가 이 조리기구를 총 $a초 이상 사용하면 요리시간을 $b% 줄일 수 있으며, 다음 식재료들 중 하나를 얻습니다: 가장 비싼 것, 가장 싼 것, 가장 많은 것, 가장 적은 것, 버섯, 송로버섯. 미스티아가 직접 사용할 때에만 효과가 발동됩니다. "솔로몬이여, 내가 돌아왔다!"',
		name: '「스타더스트 팟」',
	},
	2000: {
		description:
			'요리가 한 번 완성되고 나면 자동으로 직전에 요리한 음식을 만들기 시작합니다 (첨가한 조미료 포함). 이 기능은 재료를 소모하지 않으며, 언제든지 멈출 수 있습니다. 미스티아가 사용할 때에만 효과가 발동합니다. "순수한 요리 지옥"',
		name: '「순수한 연옥」',
	},
	3000: {
		description:
			'「육류」태그가 붙은 요리를 순식간에 완성합니다. $a%이때, 사용한 식재료를 반납합니다. 미스티아가 사용할 때만 효과가 있습니다. 천수와 칠성의 힘으로 굽는 바비큐는 최상의 맛을 냅니다.',
		name: '「자미천화」',
	},
	4000: {
		description:
			'추가 재료가 첨가되지 않았다면 요리 시간이 $a% 단축됩니다. 아니라면 추가 주문의 확률이 $b% 상승합니다. 음식에 「$c」 태그가 붙어 있을시 두 효과가 모두 적용됩니다. 미스티아가 사용할 때에만 효과가 적용됩니다. "음식은 신문 기사와도 같죠. 자극적이여야 사람들이 찾는답니다."',
		name: '「풍신 행차」',
	},
	5000: {
		description:
			'「$c」 속성이 붙지 않은 요리를 제작할 때 요리 시간이 $a% 단축됩니다. 해당 속성이 붙었다면 요리 시간이 $b% 증가합니다. 「마신복송」 이 조리기구로 만든 음식을 먹고 손님이 평가를 내리면, 그 다음 손님 또한 똑같은 종류의 음식을 먹을 시 똑같은 평가를 내리게 됩니다. 미스티아가 직접 사용할 때에만 효과가 발동됩니다. "마법 경전이 펼쳐지는 건 그냥 형식적인 게 아냐!"',
		name: '「마인경판」',
	},
	5001: {
		description:
			'찜기, 팬, 냄비의 역할을 모두 수행할 수 있는 조리기구입니다. "Welcome Hell"이라는 문구가 쓰여 있는데, 뭔가 유행하는 브랜드 같아요.',
		name: '「삼위일체」',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
