import type { ILocalizedItemText } from '@/domain/data/localization/types';

export const COOKER_LOCALIZATION_ZH_TW = {
	0: {
		description:
			'普通的煮鍋，用了古老的中國陶土製作工藝，能夠很好的聚集熱量，甚至給鍋內增加壓力，使食材高效的燉煮，是料理人都用順手的廚具。',
		name: '煮鍋',
	},
	1: {
		description:
			'普通的鐵爐，在爐內放入炭火，通過上方的網狀設計可以有效的讓熱量傳遞給食材，烤出屬於大自然的野性味道，粗獷的人們最愛它製作的料理。',
		name: '燒烤架',
	},
	2: {
		description:
			'在其中放入油，高温下不管什麼東西丟進去炸一下，都可以變成可口的料理，實在是魔鬼的技術！……但這樣的料理並不健康。',
		name: '油鍋',
	},
	3: {
		description:
			'蒸是劃時代的料理技巧，能夠快速、批量的使料理熟透，是極其高效的方法，而且營養不易流失！是養生人士的最愛！',
		name: '蒸鍋',
	},
	4: {
		description:
			'製作生冷原味食材的必備廚具！無論是處理生肉生魚、或是處理涼菜沙拉，都是非常方便的廚具，原生的，就是最美味的！',
		name: '料理台',
	},
	5: {
		description:
			'在完美完成「夜雀之歌」或在「熱火朝天」下製作出的料理，可無視稀有客人本輪點單，只通過喜好標籤評價只有米斯蒂婭使用才有此效果——“迷失在夜雀的歌聲裏吧！”',
		name: '夜雀煮鍋',
	},
	6: {
		description:
			'在完美完成「夜雀之歌」或在「熱火朝天」下製作出的料理，可無視稀有客人本輪點單，只通過喜好標籤評價只有米斯蒂婭使用才有此效果——“迷失在夜雀的歌聲裏吧！”',
		name: '夜雀燒烤架',
	},
	7: {
		description:
			'在完美完成「夜雀之歌」或在「熱火朝天」下製作出的料理，可無視稀有客人本輪點單，只通過喜好標籤評價只有米斯蒂婭使用才有此效果——“迷失在夜雀的歌聲裏吧！”',
		name: '夜雀油鍋',
	},
	8: {
		description:
			'在完美完成「夜雀之歌」或在「熱火朝天」下製作出的料理，可無視稀有客人本輪點單，只通過喜好標籤評價只有米斯蒂婭使用才有此效果——“迷失在夜雀的歌聲裏吧！”',
		name: '夜雀蒸鍋',
	},
	9: {
		description:
			'在完美完成「夜雀之歌」或在「熱火朝天」下製作出的料理，可無視稀有客人本輪點單，只通過喜好標籤評價只有米斯蒂婭使用才有此效果——“迷失在夜雀的歌聲裏吧！”',
		name: '夜雀料理台',
	},
	10: { description: '升級後的煮鍋！', name: '超煮鍋' },
	11: { description: '升級後的燒烤架！', name: '超燒烤架' },
	12: { description: '升級後的油鍋！', name: '超油鍋' },
	13: { description: '升級後的蒸鍋！', name: '超蒸鍋' },
	14: { description: '升級後的料理台！', name: '超料理台' },
	15: { description: '已臻化境的煮鍋！', name: '極煮鍋' },
	16: { description: '已臻化境的燒烤架！', name: '極燒烤架' },
	17: { description: '已臻化境的油鍋！', name: '極油鍋' },
	18: { description: '已臻化境的蒸鍋！', name: '極蒸鍋' },
	19: { description: '已臻化境的料理台！', name: '極料理台' },
	20: {
		description:
			'有$a%的概率製作出黑暗料理，但如果完美歌唱會使概率降低至$b%只有米斯蒂婭使用才有此效果“最新的「危險」技術，做菜像光一樣快！……但，代價是什麼呢？”',
		name: '核能煮鍋',
	},
	21: {
		description:
			'有$a%的概率製作出黑暗料理，但如果完美歌唱會使概率降低至$b%只有米斯蒂婭使用才有此效果“最新的「危險」技術，做菜像光一樣快！……但，代價是什麼呢？”',
		name: '核能燒烤架',
	},
	22: {
		description:
			'有$a%的概率製作出黑暗料理，但如果完美歌唱會使概率降低至$b%只有米斯蒂婭使用才有此效果“最新的「危險」技術，做菜像光一樣快！……但，代價是什麼呢？”',
		name: '核能油鍋',
	},
	23: {
		description:
			'有$a%的概率製作出黑暗料理，但如果完美歌唱會使概率降低至$b%只有米斯蒂婭使用才有此效果“最新的「危險」技術，做菜像光一樣快！……但，代價是什麼呢？”',
		name: '核能蒸鍋',
	},
	24: {
		description:
			'有$a%的概率製作出黑暗料理，但如果完美歌唱會使概率降低至$b%只有米斯蒂婭使用才有此效果“最新的「危險」技術，做菜像光一樣快！……但，代價是什麼呢？”',
		name: '核能料理台',
	},
	25: {
		description:
			'加入了「可疑的」技術，讓吃了料理的客人非常開心！只有米斯蒂婭使用才有此效果“雖然不明白，但生意太火爆了！”',
		name: '可疑煮鍋',
	},
	26: {
		description:
			'加入了「可疑的」技術，讓吃了料理的客人非常開心！只有米斯蒂婭使用才有此效果“雖然不明白，但生意太火爆了！”',
		name: '可疑燒烤架',
	},
	27: {
		description:
			'加入了「可疑的」技術，讓吃了料理的客人非常開心！只有米斯蒂婭使用才有此效果“雖然不明白，但生意太火爆了！”',
		name: '可疑油鍋',
	},
	28: {
		description:
			'加入了「可疑的」技術，讓吃了料理的客人非常開心！只有米斯蒂婭使用才有此效果“雖然不明白，但生意太火爆了！”',
		name: '可疑蒸鍋',
	},
	29: {
		description:
			'加入了「可疑的」技術，讓吃了料理的客人非常開心！只有米斯蒂婭使用才有此效果“雖然不明白，但生意太火爆了！”',
		name: '可疑料理台',
	},
	30: {
		description:
			'每次烹飪時有$a%的概率生成1隻小兔子，每隻小兔子額外提升$b%的可疊加小費倍率，持續時間$c秒後離開。只有米斯蒂婭使用才有此效果“和因幡用來吸引遊客的紀念品一樣徒有其表。但誰能拒絕小兔子呢！？”',
		name: '月見煮鍋',
	},
	31: {
		description:
			'每次烹飪時有$a%的概率生成1隻小兔子，每隻小兔子額外提升$b%的可疊加小費倍率，持續時間$c秒後離開。只有米斯蒂婭使用才有此效果“和因幡用來吸引遊客的紀念品一樣徒有其表。但誰能拒絕小兔子呢！？”',
		name: '月見燒烤架',
	},
	32: {
		description:
			'每次烹飪時有$a%的概率生成1隻小兔子，每隻小兔子額外提升$b%的可疊加小費倍率，持續時間$c秒後離開。只有米斯蒂婭使用才有此效果“和因幡用來吸引遊客的紀念品一樣徒有其表。但誰能拒絕小兔子呢！？”',
		name: '月見油鍋',
	},
	33: {
		description:
			'每次烹飪時有$a%的概率生成1隻小兔子，每隻小兔子額外提升$b%的可疊加小費倍率，持續時間$c秒後離開。只有米斯蒂婭使用才有此效果“和因幡用來吸引遊客的紀念品一樣徒有其表。但誰能拒絕小兔子呢！？”',
		name: '月見蒸鍋',
	},
	34: {
		description:
			'每次烹飪時有$a%的概率生成1隻小兔子，每隻小兔子額外提升$b%的可疊加小費倍率，持續時間$c秒後離開。只有米斯蒂婭使用才有此效果“和因幡用來吸引遊客的紀念品一樣徒有其表。但誰能拒絕小兔子呢！？”',
		name: '月見料理台',
	},
	1000: {
		description:
			'米斯蒂婭使用此廚具累計$a秒後，改為減少$b%的料理時間，同時料理後可以生成1個以下食材之一：最貴的、最便宜的、最多的、最少的、蘑菇、松露。只有米斯蒂婭使用才有此效果“所羅門啊，我回來了！”',
		name: '「星塵鼎沸」',
	},
	2000: {
		description:
			'烹飪結束後，此廚具會自動開始製作上一次製作的料理（包括額外添加的素材），自動製作不消耗食材且可以隨時打斷。只有米斯蒂婭使用才有此效果“純粹的料理地獄”',
		name: '「純粹煉獄」',
	},
	3000: {
		description:
			'瞬間完成帶有「肉」Tag的料理$a%返還料理素材只有米斯蒂婭使用才有此效果——集天樞與七星之力做一份燒烤，必然是無上極品啦。',
		name: '「紫薇天火」',
	},
	4000: {
		description:
			'烹飪時若沒有添加任何額外素材則減少時間效果提高到$a%，否則提高$b%續單率。若料理帶有「$c」標籤則兩者同時觸發。只有米斯蒂婭使用才有此效果“料理和新聞一樣，有時候是需要‘添油加醋’的。”',
		name: '「馮風渡御」',
	},
	5000: {
		description:
			'若製作的料理不帶有「$c」標籤，減少$a%料理時間，否則增加$b%料理時間。「魔神複誦」此廚具製作的料理被客人食用並給出評價後，接下來給任何客人該廚具製作的同樣料理也必然得到該評價。只有米斯蒂婭使用才有此效果“魔典的展現是無所謂形式的！”',
		name: '「魔人經板」',
	},
	5001: {
		description:
			'可同時作為蒸鍋、油鍋與煮鍋類型的廚具使用。上面寫着“Welcome Hell”的字樣，看起來像是什麼流行品牌。',
		name: '「三位一體」',
	},
} as const satisfies Readonly<Partial<Record<number, ILocalizedItemText>>>;
