/* eslint-disable sort-keys */
import type {ICustomerRare} from './types';
import {DARK_MATTER_NAME, LABEL_BR, TAG_POPULAR_POSITIVE, TAG_SIGNATURE} from '@/data/constant';

export const CUSTOMER_RARE_LIST = [
	{
		id: 0,
		name: '莉格露',
		description: [
			'喜欢虫子的老友。虽然咱们已经认识了很久，但我还是受不了围在她身边的那群虫子。',
			'这家伙表面上是个萤火虫妖怪，其实是强大的上古虫族的末裔哦，所以才总摆出一副了不起的样子。',
			'我很了解她，虽然看起来脾气不太好，但其实是很为朋友着想的家伙！谁能想到，就是这么个小小的萤火虫，希冀着用自己的微末光芒，孤独又决然地照亮这衰败已久的一族呢？',
		],
		dlc: 0,
		places: [0, 1000, 4000],
		price: '200-400',
		positiveTags: [0, 17, 18, 24],
		negativeTags: [2, 7, 21],
		beverageTags: [0, 3],
		chat: [
			'我作为邻居来捧场了哦老板娘！',
			'别这么看着我！我来到店里并不会影响店铺的卫生啦！',
			'你家附近的虫子？和我没关系啦！',
			'为了虫族的复兴！现在我们推出“昆虫的通知”——为什么要让我闭嘴！',
			'夜晚的萤火虫不是很美好吗？驻足多看一会吧。',
		],
		evaluation: {
			exbad: '居然这么对我，就让你看看虫子的厉害！',
			bad: '哦！谢谢。',
			norm: '哇，不错嘛！',
			good: '看来你很懂虫族的品味！',
			exgood: '居然吃到这么合我心意的菜…一定要有所回报才行！',
			lackmoneyangry: '连莉格露大人的钱都想抢，你胆子挺大！',
			lackmoneynormal: '算我欠你的人情啦~下次放心来找我帮忙吧！',
			repell: '居然敢赶萤火虫大人？！',
			seenRepell: '哎，真没劲。',
		},
		spellCards: {
			positive: [
				{
					name: '灯符「荧光现象」',
					description: '顾客刷新时间减少30%，持续60秒。',
				},
			],
			negative: [
				{
					name: '蠢符「夜虫龙卷」',
					description: '将店内的顾客统统驱赶。',
				},
			],
		},
		positiveTagMapping: {
			18: '生肉总比熟肉好吃',
		},
		collection: true,
	},
	{
		id: 1,
		name: '露米娅',
		description: [
			'喜欢黑暗的老友，总觉得她脑子空空的样子。但不得不说，和我很合得来。无论是第一点还是第二点。',
			'这家伙总是到处漂荡，我从来都不知道她在做什么。一段时间没见，就能从她口中听到些新鲜的词汇…她到底是去哪了呢？',
			'相识越久，越觉得自己对她的过去一无所知，就算问她，她也只会说不记得了。不过就算如此，我们也依然是好友，永远都会是好友。',
		],
		dlc: 0,
		places: [0, 1000],
		price: '150-350',
		positiveTags: [0, 9, 18, 19, 24, -20],
		negativeTags: [8, -3, -21],
		beverageTags: [15, 16],
		chat: [
			'“黑夜给了我们黑色的眼睛”，不就是为了让人寻找黑暗嘛。',
			'你看我像不像圣人被钉在十字架上？',
			'你这里太亮了，我的眼睛有点不舒服。',
			'最近有些人喊我三小姐，你知道这是为什么吗？',
			'为了来你这里就餐，我连身边的黑暗都减弱了。',
		],
		evaluation: {
			exbad: '这就是所谓的黑暗料理吗？',
			bad: '是——这样吗？',
			norm: '挺好吃的哦。',
			good: '很好吃哦！',
			exgood: '在你的料理下，感觉肉都会发光了！',
			lackmoneyangry: '你的价格就像人类采用了十进制！',
			lackmoneynormal: '就带了这么多啦…',
			repell: '为什么不让我吃啦？',
			seenRepell: '你也会像那样赶我走吗？',
		},
		spellCards: {
			positive: [
				{
					name: '月符「月光射线」',
					description: '随机获得图鉴中记录的三种肉类食材（如果图鉴中记录的肉类食材只有两种，则获得两种）。',
				},
			],
			negative: [
				{
					name: '暗符「境界线」',
					description: '在厨房放出黑雾，让你无法辨识哪些是厨具，哪些是食柜，黑雾持续20秒消失。',
				},
			],
		},
		positiveTagMapping: {
			19: '拿手好菜',
		},
		collection: false,
	},
	{
		id: 2,
		name: '橙',
		description: [
			'与其说是凶兆的黑猫，不如说是凶巴巴的黑猫…',
			'老是脱口而出要监视我们什么的，就那么怕我们赖账吗？明明一直都很准时还债的啊！',
			'我说，这家伙果然有什么不可告人的目的吧？总觉得她在拙劣地隐瞒着什么…不过这孩子性格这么直，我能感受到她对我是没有恶意的！所以，不管她是不是真的隐瞒了什么，我都会对她一如既往的。',
		],
		dlc: 0,
		places: [0],
		price: '400-600',
		positiveTags: [0, 1, 6, 17, 33, -20],
		negativeTags: [2, 22, 24, -21],
		beverageTags: [12, 14],
		chat: [
			'我才不是嘴馋，我只是来监督你的。',
			'你要好好工作，一定要按时把债务完成！',
			'别以为给我做点好吃的就可以放宽贷款哦。',
			'下次要不要把我家的猫咪们也带过来呢？',
			'吃不下的食物可以打包吗？我想带给我家猫咪吃。',
		],
		evaluation: {
			exbad: '这种东西连野猫都不吃！',
			bad: '也就这种程度吧。',
			norm: '还、还不错！',
			good: '看在这么好吃的份上，就夸你一下吧！',
			exgood: '好、好好粗！不是！好好吃！！',
			lackmoneyangry: '看来给你的贷款利息确实是太高了…',
			lackmoneynormal: '没、没带够，下次贷款考虑给你优惠点！',
			repell: '走就走！我才不稀罕！',
			seenRepell: '不要放过每一个客人，给我好好赚钱还债啊！',
		},
		spellCards: {
			positive: [
				{
					name: '仙符「凤凰卵」',
					description: '随机获得三种鱼类食材，偶尔会出现高级货。',
				},
			],
			negative: [
				{
					name: '方符「奇门遁甲」',
					description: '减少顾客的出现率。',
				},
			],
		},
		positiveTagMapping: {
			33: '把肉串起来',
		},
		collection: false,
	},
	{
		id: 3,
		name: '稗田阿求',
		description: [
			'人类村子中的名门望族，编撰《幻想乡缘起》的稗田家家主，是个了不起的大小姐。',
			'明明是才华横溢的大小姐，但是身体却很糟糕。即便拖着这样的身体，她也偶尔会来店里做客，真是让人又惊喜又担忧啊。',
			'虽然这位大小姐看起来是无可挑剔的优雅，但骨子里似乎透着一股倔强和任性呢。轮回转生吗…就算这样，现在的她，也确实是一个小孩子没错吧？',
		],
		dlc: 0,
		places: [1, 3000],
		price: '500-800',
		positiveTags: [4, 7, 12, 17, 25, 32, -20],
		negativeTags: [6, 15, 22, -21],
		beverageTags: [4, 6],
		chat: [
			'没想到，我居然有朝一日能够踏进妖怪的餐馆里。',
			'我能来的次数不多，所以我很珍惜这样的机会。',
			'在这种地方，可以得到许多有趣的情报。',
			'作为稗田家第九代家主，我的责任重大。',
			'如今，幻想乡缘起到底是为了什么而继续写下去呢…',
		],
		evaluation: {
			exbad: '实在是让人难以恭维。',
			bad: '多谢招待。',
			norm: '多谢款待。',
			good: '能够尝此美味，今天真是不枉此行。',
			exgood: '即便是轮回多世，我也从未吃过如此美味的料理！',
			lackmoneyangry: '黑心商家，一定要记下来！',
			lackmoneynormal: '我的佣人没有随行，身上带的钱不够，请见谅…',
			repell: '我一定会把你写到《幻想乡缘起》里！',
			seenRepell: '我还以为你会和别的妖怪不一样…',
		},
		spellCards: {
			positive: [
				{
					name: '撰书「这也全部是妖精干的吗」',
					description: '获得一张签名色纸。',
				},
			],
			negative: [
				{
					name: '口授「黑心店家的黑心历史」',
					description: '店内气氛掉落到冰点，顾客也会降低心情。',
				},
			],
		},
		positiveTagMapping: {
			3: '作为稗田家主',
		},
		collection: true,
	},
	{
		id: 4,
		name: '上白泽慧音',
		description: [
			'在人类村子开私塾的妖怪。哎呀，总觉得她与其说是妖怪，倒不如说更像是人类呢。',
			'明明是妖怪，却深受人类的信赖，收集了不少信仰心吧？在村民们的心中，她比巫女更可靠。听说还在村子里代理着巫女的工作。',
			'一边担忧着人类，一边担忧着妖怪，真是伟大啊，所谓贤者就是指这样的存在吧？她似乎有着另一个形态，一个我应该没有见过的形态，但却又隐约觉得自己见过…',
		],
		dlc: 0,
		places: [1, 1000, 3000],
		price: '400-800',
		positiveTags: [2, 3, 7, 12, 14, 25, -20],
		negativeTags: [6, 15, -1, -21],
		beverageTags: [5, 6, 9],
		chat: [
			'食物的历史也是非常久远的。',
			'总觉得，满月时的记忆似乎不太完整…',
			'单纯的事件是不能称为历史的，只有将其记载下来，方为历史。',
			'最近孩子们对课程似乎有点意兴阑珊，是不是应该再增加些课程呢？',
			'有时候，料理中承载的不止酸甜苦辣，还有思念。',
		],
		evaluation: {
			exbad: '食之无味，即便弃之也不可惜。',
			bad: '勤加练习的话一定可以做得更好。',
			norm: '味道不错，相信你不会止步于此。',
			good: '很美味，看来你下了不少功夫。',
			exgood: '太美味了！这是沉淀了历史的技术才能做出来的佳肴！',
			lackmoneyangry: '这个定价恐怕不太适合幻想乡的居民。',
			lackmoneynormal: '抱歉，下次我会注意点的。',
			repell: '如果你是我的学生，我就上头槌了！',
			seenRepell: '这种行为实在太没有教养了。',
		},
		spellCards: {
			positive: [
				{
					name: '三种神器「剑」',
					description: '随机获得两种蔬菜类食材。',
				},
				{
					name: '三种神器「镜」',
					description: '料理不会消耗任何材料，持续15秒。',
				},
				{
					name: '三种神器「玉」',
					description: '随机解锁一名未完全解锁全部喜好的稀有顾客的一条信息。',
				},
				{
					name: '三种神器「乡」',
					description: '吸引大量居民前来就餐。',
				},
			],
			negative: [
				{
					name: '国符「秘笈头槌」',
					description: '眩晕20秒（上下左右乱打可以快速恢复）。',
				},
			],
		},
		positiveTagMapping: {
			25: '历史和文化相辅相成',
		},
		collection: false,
	},
	{
		id: 5,
		name: '茨木华扇',
		description: [
			'一本正经的谜之仙人。总觉得她和一般的仙人哪里不太一样…不过我也没见过别的仙人就是了。',
			'仙人说话都是这样一板一眼吗？和她对话有种挨训的感觉…不过能让主食霞的仙人来自己的店里光顾，还是挺有成就感的。',
			'虽然有点儿啰嗦，但真是个热心的家伙，是不是有点儿像（有点儿严厉的）邻家姐姐的感觉呢？气质和一开始相比变了不少，该说是更柔和了吗？',
		],
		dlc: 0,
		places: [1, 2000, 3001],
		price: '400-600',
		positiveTags: [3, 8, 12, 25],
		negativeTags: [18, 34, -2],
		beverageTags: [1, 11, 17],
		chat: [
			'仙人也不是只吃“霞”的。',
			'最近村子似乎成立了动物保护协会，真是一个不错的组织。',
			'我已经离开太久了，如今的幻想乡变了太多，我需要好好适应。',
			'唉，一个个家伙都是要人操心的。',
			'最近巫女的评价还好吗？我会督促她继续努力的。',
		],
		evaluation: {
			exbad: '难以下咽！',
			bad: '还得再多修炼修炼才行。',
			norm: '还不错！但不能就此自满哦。',
			good: '味道极佳，值得称赞！',
			exgood: '此绝味，竟叫无欲之仙沉沦！',
			lackmoneyangry: '这种违背常识的定价透露着丑恶的欲望。',
			lackmoneynormal: '不小心超过预算了…要不，免费让你去我那儿修炼作为补偿吧。',
			repell: '不知腐鼠成滋味，猜意鹓雏竟未休。',
			seenRepell: '骅骝拳跼不能食，蹇驴得志鸣春风！',
		},
		spellCards: {
			positive: [
				{
					name: '「猛兽的艺术用法」',
					description: '每隔一段时间，在场排队和就座的顾客，每人随机打赏1-30円。',
				},
			],
			negative: [
				{
					name: '「断恶修善的禁欲考验」',
					description: '顾客只会点最便宜的食物和绿茶，持续30秒。',
				},
			],
		},
		positiveTagMapping: {},
		collection: false,
	},
	{
		id: 7,
		name: '博丽灵梦',
		description: [
			'贫穷且凶狠的巫女小姐…让人怀疑她真的是人类吗？总之，千万要小心不要惹她生气。',
			'灵梦小姐真是一点儿都不客气啊…不过，不知不觉也受了她不少照顾呢。开始有点儿明白为什么有那么多妖怪聚集在她身边了。',
			'所谓刀子嘴豆腐心，说的就是灵梦小姐这样的人吧。虽然看起来挺没心没肺的，但那双眼睛却总是能直视前方。博丽的巫女是灵梦小姐真是太好了。',
		],
		dlc: 0,
		places: [2, 0, 1, 1000, 1001],
		price: '150-300',
		positiveTags: [4, 9, 17, 27, -2, -20],
		negativeTags: [8, -3, -21],
		beverageTags: [-1, 0, 4],
		chat: [
			'明明是妖怪开的店，为什么人比神社都多？！',
			'既然是面向人类经营，卫生方面可要给我好好注意。',
			'今天没有闹事的吧？发生什么要及时告诉我。',
			'看着妖怪和人类共食，身为巫女感觉还是挺微妙的。',
			'这种好像挺赚钱啊，我要不要也开一家店呢？',
		],
		evaluation: {
			exbad: '给我吃这种东西是想被退治吗？！',
			bad: '也没比我做的好多少嘛。',
			norm: '做得不错嘛。',
			good: '好吃！不枉我特意攒钱来吃！',
			exgood: '这一顿，就算花光所有钱也是值得的！',
			lackmoneyangry: '敢诓我的钱？我看你是想被退治了！！！',
			lackmoneynormal: '你以前参加我家的宴会也没给钱，总得给我打个折吧。',
			repell: '可恶，我没退治你，你居然敢赶我走？！',
			seenRepell: '要是之后被投诉了我可不管。',
		},
		spellCards: {
			positive: [
				{
					name: '梦符「二重结界」',
					description: '发动一次保护结界，可以完全防御下一位稀有顾客的惩罚符卡。',
				},
			],
			negative: [
				{
					name: '"灵符「梦想封印」',
					description: '使当日菜单上的三个料理无法被制作，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			27: '配得上我的称号',
			[-2]: '贵的买不起',
		},
		collection: false,
	},
	{
		id: 8,
		name: '伊吹萃香',
		description: [
			'没想到现在的幻想乡居然还有鬼存在，第一次见到的时候真的吓了一跳！不过…她真的是鬼吗？',
			'毫无疑问，她就是鬼。虽然平时摆着一副小小的身姿和迷迷糊糊的模样，但言语间的气魄，有时会瞬间像一座山一样压下来。真不愧是传说中的山中王者啊。',
			'鬼虽然是很可怕的种族，但是一旦成为朋友，就是最值得信赖的伙伴！萃香小姐虽然总是醉醺醺的，但是心思清明着呢。那种豪情逸致，真让人向往啊。',
		],
		dlc: 0,
		places: [2, 1001, 4001],
		price: '600-800',
		positiveTags: [0, 8, 12, 23, 28, -20],
		negativeTags: [6, -21],
		beverageTags: [2, 11],
		chat: [
			'最近宴会次数减少了啊，看来有什么在悄悄地发生着吧？',
			'你的事我很清楚哦，因为一直看着呢。',
			'解嘲破惑有常言，酒不醉人人自醉。',
			'喝酒就是要在这种热闹的地方才有味道嘛。',
			'差不多该觉察到心中的压力了吧。',
		],
		evaluation: {
			exbad: '佐上这样的菜肴，真是糟蹋了我的酒！',
			bad: '就着酒的话，勉强也可以吃两口。',
			norm: '不错的下酒菜！',
			good: '美酒佳肴，不醉不休！',
			exgood: '没想到，这世上居然有比酒更让我垂涎的料理！',
			lackmoneyangry: '失望的宴会…',
			lackmoneynormal: '钱不够了。下次请你喝酒吧！',
			repell: '是鬼离开了太久，让你忘了我的恐怖吗？',
			seenRepell: '居然在宴席上驱赶客人，真是无趣。',
		},
		spellCards: {
			positive: [
				{
					name: '酒吞奥义「鬼进酒」',
					description: '赠送一种酒水，偶尔会出现超高级货。',
				},
			],
			negative: [
				{
					name: '「百万鬼夜行」',
					description: '从酒柜里偷走三瓶最高级的酒。',
				},
			],
		},
		positiveTagMapping: {
			0: '大口吃肉',
			8: '佐酒的小菜',
			28: '分散很多个小的自己',
		},
		collection: true,
	},
	{
		id: 9,
		name: '比那名居天子',
		description: [
			'传说中气焰嚣张、目中无人的不良天人，如果可以的话，真不想招待这样的客人啊…',
			'我得为之前说过的话道歉，怎么能对客人生出不想招待的念头呢？就算她气焰嚣张、目中无人、口无遮拦、毫无常识、鼻子比天高，我都必须要好好招待她！尽量吧…',
			'其实，这家伙也不是那么讨厌啦。虽然嘴巴是坏了点儿（是很坏），但说不定…是个相当天真的家伙呢。似乎在天界过得不是很舒心，如果在地上能让她好好释放压力就好了。',
		],
		dlc: 0,
		places: [2, 1001, 2000, 3001, 4000],
		price: '2000-3000',
		positiveTags: [2, 5, 7, 17, 20, 31, -3, -21],
		negativeTags: [0, 3, 6, -20],
		beverageTags: [2, 7],
		chat: [
			'虽然在我看来是个破落的小店，但在地上也算是不错了吧。',
			'天界那群老顽固，一点儿都不懂变通！',
			'地上虽然比不上天界的富饶，不过勉强还是能呆一阵子的。',
			'有本天人来光顾的店，那些愚民们一定会争先恐后地过来吧。',
			'地上稀奇古怪的东西真不少，虽然不入流，倒也挺有趣的。',
		],
		evaluation: {
			exbad: '咸若啮檗吞针！',
			bad: '哼，就地上人而言，差不多也就这种程度吧。',
			norm: '区区地上人，做得还挺像样的。',
			good: '此等美味，就算放在天界也毫不逊色。',
			exgood: '甚合吾心！没想到这种贫瘠之地竟能烹饪出此等佳肴！',
			lackmoneyangry: '哼，吾来汝店，本即无上荣光。',
			lackmoneynormal: '哼，这一顿也就值这么多！',
			repell: '蚍蜉撼大树，可笑不自量！',
			seenRepell: '斗筲之人，何足算也。',
		},
		spellCards: {
			positive: [
				{
					name: '「全人类的绯想天」',
					description: '使全部正在就餐的顾客的心情暴涨至85%。',
				},
			],
			negative: [
				{
					name: '「天罚的石柱」',
					description: '破坏桌椅，吓走桌面上的顾客，该桌椅在60秒内无法再被使用。',
				},
			],
		},
		positiveTagMapping: {
			2: '荤腥的东西',
			7: '口味重的东西',
			20: '卖相不好的低贱品',
			[-3]: '我不缺钱',
		},
		collection: false,
	},
	{
		id: 10,
		name: '雾雨魔理沙',
		description: [
			'非常开朗健谈的人类魔法使，独自住在人烟罕至的魔法森林里修行，不管是人类、妖精还是妖怪都能轻松与之打成一片。对蘑菇似乎有很深刻的研究！',
			'虽然看起来无所事事，其实也经营着一家“雾雨魔法店”。因为她喜欢收集却从不整理的性格，这家店常常被误以为是垃圾回收站。客人可想而知也是没有的。',
			'虽然性格上有着心术不良的地方，但本性正直，和她一起的感觉很愉快！她从不愿让人看到她努力的样子，但我们都知道…这个自小就离家修行的小女孩，如果可以更多地依靠别人就好了。',
		],
		dlc: 1,
		places: [1000, 0, 1, 2, 3, 4, 1001, 2000, 2001, 3000, 3001, 4000, 4001, 5000, 5001],
		price: '3000-5000',
		positiveTags: [5, 6, 12, 22, 26, -20],
		negativeTags: [24, -21],
		beverageTags: [0, 3],
		chat: [
			'放心吧，我只是喜欢偷…借书，从来不吃霸王餐。',
			'可恶，今天又输给灵梦那个家伙了呀！',
			'偶尔像这样吃一顿也不错Da☆Ze！',
			'这么多人看着，我不会跑单的啦！',
			'魔法就是光和热，料理其实也差不多吧。',
		],
		evaluation: {
			exbad: '这什么东西啊，还不如生吞蘑菇呢！',
			bad: '一般般吧。',
			norm: '味道不错诶，教教我怎么做呗。',
			good: '这个菜，感觉可以成为宴会的主角！',
			exgood: '你是偷偷藏了什么魔法吗？居然会有这么好吃的料理！',
			lackmoneyangry: '我去借点钱再来吃！',
			lackmoneynormal: '账我已经付啦。你感觉箱子里的钱少了？不关我事哦。',
			repell: '相信我！我这回真的带钱了！',
			seenRepell: '这样不太友好啊。',
		},
		spellCards: {
			positive: [
				{
					name: '流星「超级英仙座」',
					description: '随机获得三种菌类食材，偶然会出现高级货。',
				},
			],
			negative: [
				{
					name: '魔符「拿来吧你」',
					description: '随机偷走两样东西，可能是料理、食材或酒水。且在偷完东西后，不付钱直接走人。',
				},
			],
		},
		positiveTagMapping: {
			5: '古老的东西',
			6: '油炸食品',
		},
		collection: false,
	},
	{
		id: 15,
		name: '红美铃',
		description: [
			'没想到给恶魔之家的看门的妖怪居然是个热血亲切的大姐！可惜爱睡觉，每次想去找她聊聊都看到她在打盹。',
			'美铃小姐独自守卫着这么大的洋馆，连个轮班的都没有，难怪会睡眠不足啦。要是在我力所能及的范围内，能帮到她一点点忙就好了。',
			'原来美铃小姐的家乡在海的另一边。但是幻想乡是没有海的，美铃小姐是不是已经回不去了？她的家乡有很多耳熟能详的名菜，我努力学习做给她吃，或许可以缓解一些她的思乡之情。',
		],
		dlc: 0,
		places: [3],
		price: '200-400',
		positiveTags: [0, 9, 14, 23, -20],
		negativeTags: [13, 24, 31, -21],
		beverageTags: [4, 17, 19],
		chat: [
			'我可没有偷懒哦——虽然确实是偷偷溜出来的。',
			'咲夜小姐的飞刀就像是长了眼睛一样。',
			'大小姐什么时候才把那本漫画的下册借回来呢？',
			'得赶在被女仆长发现前回去。',
			'饭前饭后都不适宜运动，稍微打个盹就是最合适不过了。',
		],
		evaluation: {
			exbad: '太过分！居然拿这种东西来敷衍我！',
			bad: '能吃饱就行吧…',
			norm: '唔…还算好吃吧？',
			good: '不愧是我冒着被刀子扎的风险也要来吃的菜。',
			exgood: '能吃到这样的菜，就算脑袋扎满刀子也无憾了！',
			lackmoneyangry: '区区门卫吃不起你家的菜！',
			lackmoneynormal: '我的工资只剩这么多了…',
			repell: '老板娘好无情啊！',
			seenRepell: '老板娘原来是这样的…',
		},
		spellCards: {
			positive: [
				{
					name: '华符「芳华绚烂」',
					description: '每2秒提升1点店内气氛，且期间完成稀有顾客的订单后获得的好感度提高，持续30秒。',
				},
			],
			negative: [
				{
					// cSpell:ignore pOnda
					name: '「NOver say no to pOnda」',
					description:
						'随机摧毁一张桌子，并降低10点店内气氛。如果此桌子上有客人则会被驱赶，且无法再次接待客人，持续90秒。',
				},
			],
		},
		positiveTagMapping: {
			14: '祖国的味道',
		},
		collection: false,
	},
	{
		id: 28,
		name: '琪露诺',
		description: [
			'自称最强的、长着冰之羽翼的妖精，那样的翅膀也能飞起来真是神奇啊。当然神奇的还有她的脑回路，老是做一些和大家相反的选择，总之别太深究她说的话就好了。',
			'虽然是冰之妖精，却是个热血的家伙！说不定她真的是最强的妖精，尤其是那股勇往直前的气势，真是见了棺材也不掉泪，撞了南墙也不回头。了不起了不起！',
			'我发现，和她在一起的时候，会不知不觉就被她的气势带走，这就是领袖的气质吗？！不过这种感觉很轻松，说不定我们很合拍呢！难道说我也是笨蛋吗？哈哈开玩笑啦。',
		],
		dlc: 0,
		places: [3, 1001],
		price: '100-200',
		positiveTags: [17, 20, 21, 24, -21],
		negativeTags: [8, 25, -3, -20],
		beverageTags: [3, 12, 13],
		chat: [
			'本小姐是最强的！',
			'嘿嘿，我的冰可是连飞鸟都能打落哦！',
			'能不能别把我当成随处可见的普通妖精？',
			'泡菜的话，腌之前就吃掉好了。',
			'中场休息！捉迷藏什么的吃饱再继续玩吧。',
		],
		evaluation: {
			exbad: '像这种东西，就应该和英吉利牛肉一起被冰冻起来！',
			bad: '别以为这样就能把我打发掉！',
			norm: '吃饭的时候说话会咬到舌头。',
			good: '好吃！以后就让你跟着本小姐混吧！',
			exgood: '好吃得舌头都要融化了！',
			lackmoneyangry: '咱！没！钱！',
			lackmoneynormal: '咱们妖精哪来那么多钱。',
			repell: '居然敢把最强的咱赶走。',
			seenRepell: '赶人就不好玩了啊。',
		},
		spellCards: {
			positive: [
				{
					name: '「甜美的冰霜小妖精」',
					description: '随机获得三种带有“可加冰”标签的平价酒水和2-5枚冰块。',
				},
			],
			negative: [
				{
					name: '冻符「完美冻结」',
					description:
						'随机冻住三只厨具，如果厨具中有正在制作或完成但还未拿走的料理，则会直接被冻碎，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			20: '丑拒',
			21: '要吃冰的',
		},
		collection: true,
	},
	{
		id: 27,
		name: '帕秋莉',
		description: [
			'总是穿着睡衣躲在树荫下的奇怪的魔法使。似乎不在意别人的眼光，对潮流什么的也不感兴趣。虽然头脑很好，不过看起来弱不禁风的样子。比起头脑好，身体好更重要啊。',
			'帕秋莉小姐总是手不离书，一直盯着书本看眼睛不会累吗？而且书上说的也不一定都是对的啊，像这样光读书不出门，就算知识渊博，常识却稍微有些不足呢。',
			'师傅原来身患贫血症和哮喘症，真是让人担心啊（我只在这里叫一下应该可以吧？）。虽然认识这么久，师傅对我的态度依然不太亲切，但却教了我不少知识，我可不能辜负她。',
		],
		dlc: 0,
		places: [3, 1000, 2001],
		price: '600-1000',
		positiveTags: [4, 13, 17, 20, 29],
		negativeTags: [15, 18, 22, 24],
		beverageTags: [7, 9, 16],
		chat: [
			'生活就是魔法意大利面的结合。',
			'被念叨得烦了，就姑且出来走走吧。',
			'我的书并没有乱放，所有的书都在它们自己想呆的位置上。',
			'魔法的力量，其实就是科学那种东西。',
			'烹饪和魔法的结合，或许会很有趣呢。',
		],
		evaluation: {
			exbad: '不堪一试！这种水平也敢开店？',
			bad: '食不言，寝不语。',
			norm: '要是能读点书，应该能做得更好。',
			good: '这种沁人心脾的口感到底是怎么做出来的？',
			exgood: '即便博览群书，也很难有这等厨技造诣啊。',
			lackmoneyangry: '呵呵！麻雀之食贵于玉，薪贵于桂。',
			lackmoneynormal: '咳咳，我有点不舒服，先回去了…',
			repell: '人而无礼，胡不遄死！',
			seenRepell: '哼，朽木难雕。',
		},
		spellCards: {
			positive: [
				{
					name: '知识的奇妙冒险「文化之风」',
					description: '给顾客上含有“文化底蕴”标签的料理，必然获得最高等级的评价，持续30秒。',
				},
			],
			negative: [
				{
					name: '金水符「水银之毒」',
					description: `接下来制作的料理，有50%的概率会变成${DARK_MATTER_NAME}，持续30秒。`,
				},
			],
		},
		positiveTagMapping: {
			13: '文化的差异',
			20: '品相好看',
		},
		collection: false,
	},
	{
		id: 24,
		name: '藤原妹红',
		description: [
			'隐居在竹林里的不可思议的人类，欲望极低，对世间追逐的一切都没有兴趣。因为曾经吃了什么奇怪的东西而成为不老不死之身（不能乱吃东西啊）。',
			'妹红小姐真是帅气啊，虽然是人类，却强到没边，性格也很豪迈。据说爱吃辣的人性格都很爽快，妹红小姐可是无辣不欢呢。',
			'她比我想象中的要心思细腻，过去似乎经历了很多难以想象的苦难。即便如此，她仍然心存良善，一直暗中帮助别人。这样的她，一定会获得幸福的！',
		],
		dlc: 0,
		places: [4, 0],
		price: '300-600',
		positiveTags: [22, 31, 33, 35, 34],
		negativeTags: [4, 27, -3],
		beverageTags: [5, 14, 15],
		chat: [
			'不老不死只意味着，永不得救赎的孤独。',
			'炭火不够的话，尽管来找我！',
			'要是拥有了前往月亮的方法，那家伙会返回月亮吗…',
			'从不尽的火诞生的，是无论多少次都会复活的不死鸟。',
			'不要随地乱扔烟蒂啊。',
		],
		evaluation: {
			exbad: '又硬又硌牙，想必比你的肝还要难啃！',
			bad: '还得多下点功夫。',
			norm: '我觉得你应该能做得更好。',
			good: '在我的漫长人生中，这样美味的料理也属罕见。',
			exgood: '活着…真是太美妙了！',
			lackmoneyangry: '时代的进化还不及你的定价变化之快！',
			lackmoneynormal: '我过得向来清贫，就只有这么多钱了…',
			repell: '也罢。我已经习惯了。',
			seenRepell: '己所不欲，勿施于人。',
		},
		spellCards: {
			positive: [
				{
					name: '不死「火鸟 凤翼天翔」',
					description: '所有厨具的料理速度加快50%，持续20秒。',
				},
			],
			negative: [
				{
					name: '藤原「灭罪寺院伤」',
					description: '无论提供多好的料理，最高只能获得顾客的普通评价，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			35: '复仇之火永扑不尽',
		},
		collection: true,
	},
	{
		id: 25,
		name: '蓬莱山辉夜',
		description: [
			'住在永远亭的公主殿下，据说来自月亮。放着好好的月之公主不做，跑到幻想乡来当家里蹲到底是为什么呢？',
			'外表看起来是气质优雅的公主殿下，实际行事却有些无赖…有点儿理解为什么她能成为那只黑兔子的主人了（黑形容的是心哦）…',
			'原来高贵的公主也会和普通人一样烦恼工作的事情。辉夜小姐和我也没什么不同嘛。作为工作了数载的前辈，我得好好为迷惘的后辈打气呢！',
		],
		dlc: 0,
		places: [4, 4001],
		price: '1000-1500',
		positiveTags: [5, 12, 25, 27, -20],
		negativeTags: [19, 24, -1, -21],
		beverageTags: [6, 17, 18],
		chat: [
			'不劳者不得食，我是不是也该做点什么呢？',
			'那五个美丽的难题，能不能解决已经无所谓了。',
			'我不是家里蹲，只是永琳每次都要嘱咐半天所以我才懒得出门。',
			'幻想乡的雨PH值为6哦，就是几乎不含酸性的意思。',
			'七色的优昙花很美，七色的料理感觉却很恶心呢。',
		],
		evaluation: {
			exbad: '竟敢呈此等秽物来招待我！',
			bad: '这样的东西不值得我出门一趟。',
			norm: '地上的食物一直是不错的。',
			good: '馔玉炊金，其味无穷。',
			exgood: '地上有这么美味的食物，谁还会想回到月亮上呢？',
			lackmoneyangry: '地上都是这般坑蒙拐骗吗？！',
			lackmoneynormal: '唔，月亮和地上的物价可能不太一样。',
			repell: '无礼的地上妖怪！',
			seenRepell: '突然感觉没什么兴致了。',
		},
		spellCards: {
			positive: [
				{
					name: '「永夜归返 世间开明」',
					description: '增加相当于现实时间30秒的营业时间。',
				},
			],
			negative: [
				{
					name: '神宝「蓬莱的玉枝 梦色之乡」',
					description: '减少相当于现实时间30秒的营业时间，到时间时会强行终止营业。',
				},
			],
		},
		positiveTagMapping: {
			25: '不可磨灭的过去',
		},
		collection: false,
	},
	{
		id: 29,
		name: '因幡帝',
		description: [
			// cSpell:ignore PTSD
			'突然出现在店里的妖怪兔，总是坏笑着来找茬，只要她的耳朵出现在视线范围里，我的PTSD就犯了。',
			'虽然总是高价强卖我东西，而且还狡猾的打包卖什么的…但有些东西的确对我来说很有用…',
			'一直让灵梦小姐退治她也挺可怜的…总之要是经济宽裕的话，让她来店里也不是坏事，听说能看到她的话，就能获得一般人想象不到的幸运？',
		],
		dlc: 0,
		places: [4],
		price: '200-400',
		positiveTags: [5, 17, 21, 28, 29, -20],
		negativeTags: [6, 10, 24, -21],
		beverageTags: [-1, 12, 13],
		chat: [
			'人类光是遇到我，就已经花光所有的运气了。',
			'没想到鸟脑袋也能把生意做得这么有模有样啊。',
			'哦哦！还挺热闹的嘛！一直放任着不管，现在就是“回收”的时候！',
			'你还太嫩了啊。一会儿让我来教教你什么是真正的经营之道吧。',
			'遇到我就能变得幸运哦！不过呢，只有幸运的人才能遇到我。',
		],
		evaluation: {
			exbad: '让我付钱吃这种东西？给我赔钱还差不多！',
			bad: '还没兔子们捣的年糕好吃。',
			norm: '这样就想让我掏钱…算了，也还行吧。',
			good: '小麻雀做得还真不错啊。也来教教我家的兔子嘛。',
			exgood: '这味道到底是怎么回事…老板娘！你能发大财！！！',
			lackmoneyangry: '我可没有点这些菜！你自己上的菜自己买单吧。',
			lackmoneynormal: '我就只带了这么多，爱要不要吧。',
			repell: '臭麻雀…给我走着瞧！',
			seenRepell: '这种无良的店，连敲诈的价值都没有。',
		},
		spellCards: {
			positive: [
				{
					name: '生机「四十叶草般的幸运」',
					description: '所有食材采集点的冷却时间清零，且次日进行采集活动时，可以额外获得1-2份食材。',
				},
			],
			negative: [
				{
					name: '想起「那年的素兔的恐怖」',
					description: '再一次激活强买强卖功能，如果不买，将发动另一张符卡“恶作剧「Combo消失术」”。',
				},
				{
					name: '恶作剧「Combo消失术」',
					description: '中断Combo，且在30秒内无法再获得Combo。',
				},
			],
		},
		positiveTagMapping: {
			21: '降温工作',
			28: '三分饱',
		},
		collection: false,
	},
	{
		id: 1000,
		name: '河城荷取',
		description: [
			'如果说河童都是些唯利是图的商人，作为小头目的她更是其中的佼佼者！虽然说商人趋利也没什么好指责的，但是再多一点儿人情味不是也挺好吗？',
			'荷取小姐的头脑真是相当好啊，堪称是商业和技术的天才！一直以为河童性本趋利，可是她们却愿意在技术上一掷千金，我真是搞不懂她们了…',
			'能够抓住一切机会、将危机转化为商机的能力，真是让我叹为观止。在她身上学到的一切，值得我用一辈子去消化！',
		],
		dlc: 1,
		places: [1001],
		price: '400-500',
		positiveTags: [1, 4, 8, 15, 19, 24],
		negativeTags: [2, 10, 25],
		beverageTags: [1, 2, 6, 11],
		chat: [
			'只有嗅觉敏锐的商人，才能将商业情报作用发挥到极致。',
			'当你没有决定要成功时，你就已经决定要失败了。',
			'船在港湾里很安全，但这不是造船的目的。',
			'潜在顾客不在乎你。他们在乎自己，对与他们无关的东西他们不愿读也不愿听。',
			'对实业家而言只有一条规则：以尽可能低的成本，做质量最好的产品，付尽可能高的工资。',
			'是不是也应该让一些河童专门去专研厨艺呢…',
		],
		evaluation: {
			exbad: '这种程度是怎么让食堂风靡幻想乡的？这是广告欺诈吧！',
			bad: '胡乱加工不是正数的加法，而是负数的加法。',
			norm: '食品的加工是非常深奥的，你得多储备一些知识才行。',
			good: '邀请你到山里开店真是明断啊！',
			exgood: '我享受到的服务已经超过了交易本身，必须要给予答谢！',
			lackmoneyangry: '这定价与其说是做生意，不如说是抢劫！',
			lackmoneynormal: '虽然我最近赚了些钱，也经不住这样的高度消费！',
			repell: '这样做生意是不会长久的。',
			seenRepell: '老板娘，你还是不明白生意该怎么做。',
		},
		spellCards: {
			positive: [
				{
					name: '河童「延展手臂」',
					description: '伙伴可以通过“延展手臂”远程上菜上酒，持续120秒。',
				},
			],
			negative: [
				{
					name: '水符「山洪暴发」',
					description: '随机冲走3-5名顾客。',
				},
			],
		},
		positiveTagMapping: {
			4: '最上品的菜',
			19: '口碑最好的菜',
			24: '河童的口味',
		},
		collection: false,
	},
	{
		id: 1001,
		name: '犬走椛',
		description: [
			'常常在妖怪山上巡逻的白狼天狗，嗅觉、听觉非常灵敏，被称为山上的千里眼，能迅速发现入侵者。正因为有这样的守卫在，我们这种小妖怪平时根本不敢上山。',
			'因为妖怪之山基本没什么侵入者，所以守卫的工作非常清闲。夜雀食堂开张以后，她对于工作之余多了个去处似乎非常高兴，面上虽然没怎么显露，但尾巴暴露了心情。',
			'性格原本也算是一板一眼的，熟悉以后经常能听到她那些毫无城府的牢骚，还时不时能看到她露出乖巧、呆萌的一面。比想象中的好应付啊…早知道这样，我就早点儿到山上来了！',
		],
		dlc: 1,
		places: [1001],
		price: '300-400',
		positiveTags: [0, 6, 8, 10, -1],
		negativeTags: [2, 7, 24],
		beverageTags: [1, 2, 11],
		chat: [
			'今天那局棋真是恰逢敌手啊。这样才有意思！',
			'即使没有入侵者，也万不可掉以轻心。',
			'都说河童是天才，但无论是剑术还是棋术都是我的手下败将。',
			'组织规模越大，需要的规则越多。',
			'那只鸦天狗不知道又在打什么主意…',
		],
		evaluation: {
			exbad: '压榨劳动人员的钱包却只给吃这种东西吗？！',
			bad: '早知道就只喝酒了。',
			norm: '就着酒吃也还行吧。',
			good: '美味的食物能把一天的疲劳全部消除！',
			exgood: '不愧是风靡幻想乡的食堂，多谢款待！',
			lackmoneyangry: '这定价严重违反了山中的秩序！',
			lackmoneynormal: '守卫的工资果然是太低了，连顿饭也差点吃不起…',
			repell: '我们这种底层天狗就连吃饭也要被瞧不起吗？',
			seenRepell: '这一点也不利于山中的团结！',
		},
		spellCards: {
			positive: [
				{
					name: '「天狗例行小酌」',
					description: '大量白狼天狗顾客上门，持续120秒。',
				},
			],
			negative: [
				{
					name: '「戒严令」',
					description: '禁止任何顾客前来，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			6: '不健康的饮食',
			[-1]: '不多吃点',
		},
		collection: true,
	},
	{
		id: 1005,
		name: '东风谷早苗',
		description: [
			'数年前与守矢神社一起突如其来的巫女。据说来自外界，和她一起来的还有两位神明…以及一座湖。这件事实在太离奇了，直到现在都感觉怪吓人的。',
			'和喜欢宅在屋里喝茶的博丽巫女不同，早苗小姐非常勤奋，随处都能看到她在努力收集信仰的身影。以人类之身来收集信仰真是了不起啊，似乎是什么现人神呢。',
			'博丽神社在幻想乡有着特殊的、绝对的地位，无论是守矢神社还是早苗小姐，想超越博丽之名都很艰难。不过，在早苗小姐的兢兢业业下，现在大家都记住了守矢巫女之名，真是太好了！',
		],
		dlc: 1,
		places: [1000, 1001, 3000, 3001],
		price: '400-600',
		positiveTags: [3, 12, 17, 20, 29, -20],
		negativeTags: [6, 18, 22, 24, -21],
		beverageTags: [-1, 0, 6, 11, 12, 13, 15, 16, 18],
		chat: [
			'总觉得河童们最近是不是兴奋得有些异常…',
			'现在的我，应该能被幻想乡的大家记住了吧？',
			'我要让守矢之名响彻幻想乡！',
			'那两位大人都是好事却不爱凑热闹的人呢。',
			'虽说吃宵夜会长胖…不过我今天走了很多地方，应该没问题！',
		],
		evaluation: {
			exbad: '用这种东西招待信徒只会让信仰心下降！',
			bad: '这种程度的东西是无法凝聚人心的。',
			norm: '想用这个来收集信仰的话，还需要再精进一些吧。',
			good: '美味的食物果然可以收集信仰！',
			exgood: '就连我都忍不住想去信仰你了！',
			lackmoneyangry: '再怎么非常识，这顿饭也太贵了吧！',
			lackmoneynormal: '幻想乡的消费水平比外面世界还高啊…',
			repell: '欸？欸欸欸？！',
			seenRepell: '这种待客态度是无法凝聚信仰的。',
		},
		spellCards: {
			positive: [
				{
					name: '神德「五谷丰穰米之浴」',
					description: '生成三个酒水和三个食材。',
				},
			],
			negative: [
				{
					name: '奇迹「白昼新星」',
					description: '无法获得Buff，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			12: '大和风情',
			20: '手机',
		},
		collection: false,
	},
	{
		id: 1002,
		name: '爱丽丝',
		description: [
			'住在魔法森林的魔法使，有着金色的头发和白皙的皮肤，外貌精致得就像人偶一样。据说，她的家里也尽是些人偶。被她操纵的那些人偶栩栩如生，感觉还…蛮瘆人的。',
			'这些人偶真的是被操纵的吗？无论是谁见了都会有这样的疑问。虽然她看起来对别人漠不关心，但是待人接物却都非常周到，这就是所谓的都市派吗？',
			'想要走进她的心房真是不容易啊。她矜持而又好客，温柔而又疏离。她之所以制作这么多人偶，会不会是因为孤独呢？',
		],
		dlc: 1,
		places: [1000, 4000],
		price: '500-800',
		positiveTags: [3, 4, 13, 17, 25],
		negativeTags: [0, 6, 9, 24],
		beverageTags: [0, 8, 18],
		chat: [
			'偶尔是不是也回去一趟比较好呢…',
			'最近人偶损耗得有点厉害，等下回去得好好修补一下。',
			'明天表演什么人偶剧比较好呢…',
			'这家店开了才知道竟然有这么多魔法使…',
		],
		evaluation: {
			exbad: '明明用魔力就可以不用进食，为什么还要受这个罪！',
			bad: '还不如人偶做的饭…',
			norm: '还过得去吧。',
			good: '就是因为有这种美食，我才一直保持人类的进食习惯。',
			exgood: '美味得仿佛是只存在于童话世界里的幻想！',
			lackmoneyangry: '这是什么新型骗局吗？绝对是敲诈吧？！',
			lackmoneynormal: '最近买材料花了不少钱，没计划好预算…',
			repell: '我本来也没打算吃。',
			seenRepell: '吃饭就是图个气氛，气氛不到位食物也会变难吃。',
		},
		spellCards: {
			positive: [
				{
					name: '「和人偶一起玩的孩子」',
					description: '爱丽丝的人偶幻化为顾客，填充剩余的全部座位。',
				},
			],
			negative: [
				{
					name: '魔符「狡猾的献祭」',
					description: '炸飞一个厨具，持续60秒。',
				},
			],
		},
		positiveTagMapping: {
			4: '低级趣味',
		},
		collection: true,
	},
	{
		id: 1004,
		name: '矢田寺成美',
		description: [
			'原本是安置在魔法之森的地藏石像，因为森林的魔力而得到了生命——森林里居然蕴藏着能够将存在本身进行变化的魔力，难怪有那么多魔法使住在这，这对修行来说也太便利了！',
			'还以为地藏像会更稳重一点儿，结果也就是刚认识的时候会摆个架子，稍微见多几次面就把话匣子全打开了嘛。是个直率的女孩呢。',
			'好不容易成为了拥有自我的生命体，结果还是个家里蹲，这不是很可惜吗？！我一定要想办法让这家伙提起干劲！',
		],
		dlc: 1,
		places: [1000, 3000],
		price: '300-600',
		positiveTags: [7, 10, 12, 25, 30],
		negativeTags: [6, 9],
		beverageTags: [0, 1, 3, 11, 17],
		chat: [
			'人间烟火气，最抚凡人心。',
			'满肚子的食物，人才不会空虚。',
			'酸甜苦辣都是滋味，每顿饭都值得被用心对待。',
			'四方食事，不过一碗人间烟火。',
			'本来无东西，何处有南北。',
		],
		evaluation: {
			exbad: '蹩脚的人和难吃的菜一样，看到就想吐。',
			bad: '这不会是用臭水沟炒的菜吧？',
			norm: '这菜适合生存，不适合生活。',
			good: '难得出一趟门，总算没有白跑一趟！',
			exgood: '好满足！五蕴皆空不如五脏俱饱。',
			lackmoneyangry: '跟地藏要钱也太难看了，这一顿就当做是你的布施吧。',
			lackmoneynormal: '不够的钱等我下次化缘回来再补上吧。',
			repell: '我不是来化缘的，我带了钱！',
			seenRepell: '是法平等无有高下。',
		},
		spellCards: {
			positive: [
				{
					name: '魔符「即席菩提」',
					description: '顾客在结账时，会额外支付50%的小费作为化缘，持续60秒。',
				},
			],
			negative: [
				{
					name: '地藏「业火救济」',
					description: '业火随机烧掉三个Buff纸张，其带来的效果也会随之失效。',
				},
			],
		},
		positiveTagMapping: {
			30: '不同地方的美食',
		},
		collection: false,
	},
	{
		id: 2000,
		name: '黑谷山女',
		description: [
			'在黑暗的风穴遇到的亲切的指路人。因为知道自己惹人讨厌所以几乎不会到村里去，明明那么可爱…真希望地上的大家也能认识她呢！',
			'山女小姐原来是类似地底偶像一样的存在呢！不愧是她。不过，和她那可爱的性格相对的是，她的爱好似乎异于常人…',
			'虽然一直被误会乃至成为“被厌恶者”，山女小姐也并不在意。我能感觉到，她确实深爱着这个地底世界。能有这样豁达的心境，真是了不起的境界啊。',
		],
		dlc: 2,
		places: [2000, 0, 3, 1000, 1001],
		price: '250-400',
		positiveTags: [16, 17, 18, 20, 24, -20],
		negativeTags: [6, 15, 22],
		beverageTags: [0, 1, 10, 13],
		chat: [
			'被地上厌恶的地底世界，是我们的天堂。',
			'洞窟虽然是黑暗的，但是我的网很明亮哦。',
			'最近街道那边好热闹呀，偶尔去玩玩吧。',
			'只有抵住最黑的暗，才能收获最光的亮。',
		],
		evaluation: {
			exbad: '还不如蛛网里的猎物好吃。',
			bad: '我不是想打击你，但是味道确实不太好…',
			norm: '传说中的夜雀食堂应该不止这种程度…',
			good: '氛围和食物都是满分哦。',
			exgood: '能在黑暗的洞窟吃到这么美味的食物真是太棒了！',
			lackmoneyangry: '这家店比黑蜘蛛还要黑！',
			lackmoneynormal: '我还不太习惯地上的消费水平…',
			repell: '就算我们什么都没做也会遭到厌恶吗？',
			seenRepell: '瞧不起被厌恶者就别在这里开店了。',
		},
		spellCards: {
			positive: [
				{
					name: '「地下偶像狂欢夜」',
					description: '排队顾客会被偶像吸引，即使夜间营业结束也不会离去，持续30秒。',
				},
			],
			negative: [
				{
					name: '细索「犍陀多绳索」',
					description: '移动速度下降80%，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			18: '太熟吃不惯',
			24: '蜘蛛的口味',
		},
		collection: true,
	},
	{
		id: 2001,
		name: '水桥帕露西',
		description: [
			'原本以为她是个亲切开朗的妖怪，结果一转身就看到她在背地里说我坏话…以嫉妒为食的妖怪，不煽动别人的嫉妒心就会活不下去吗？感觉很可怜呐。不过她似乎不这么觉得。性格也阴晴不定，真是难以理解。',
			'桥姬既是桥的妖怪，也是桥的守护神。帕露西小姐其实在日复一日地守望着他人平安地从地上世界和地下世界往来…这么说来，她也是个很伟大的妖怪呢。',
			'我发现，帕露西小姐熟知所有人的优点！虽然大家都说帕露西小姐很善妒，但她的内心深处其实很憧憬大家吧？能够更进一步了解她真是太好了！',
		],
		dlc: 2,
		places: [2000],
		price: '300-400',
		positiveTags: [0, 15, 16, 31, 34, 2000, -21],
		negativeTags: [17],
		beverageTags: [-1, 4, 11, 14, 15],
		chat: [
			'你站在桥上看风景，看风景的人在楼上看你。',
			'所有人看起来都这么幸福，我好嫉妒啊…',
			'桥从此端通往彼端的连系，被寓意着从现世通往彼世的路途。',
			'为什么隔壁的菜看起来那么美味，我好嫉妒啊…',
		],
		evaluation: {
			exbad: '这么稀巴烂的厨艺是怎么开店的？',
			bad: '隔壁桌的菜绝对比我的好吃！',
			norm: '总觉得别人碗里的更香…',
			good: '这般治愈人心的美味，真是让人嫉妒啊。',
			exgood: '美味得让我一时间甚至连嫉妒都忘了。',
			lackmoneyangry: '我要把这个黑店钉在树上！',
			lackmoneynormal: '大家的口袋就那么富裕吗？',
			repell: '居然赶走我而不去赶走别的客人，好嫉妒啊。',
			seenRepell: '居然赶走别的客人而不来赶走我，好嫉妒啊。',
		},
		spellCards: {
			positive: [
				{
					name: '「嫉妒与透支」',
					description: '将在座顾客的预算拉到和在座最富顾客同等的水准。',
				},
			],
			negative: [
				{
					name: '恨符「丑时参拜」',
					description: '当夜结算时收取翻倍佣金。',
				},
			],
		},
		positiveTagMapping: {},
		collection: false,
	},
	{
		id: 2002,
		name: '星熊勇仪',
		description: [
			'很久以前就离开了幻想乡、有着大姐头气魄的鬼，性格刚毅且干脆利落。如今在管理着旧地狱街道上的温泉。偶尔去泡一泡温泉吧！',
			'原来勇仪小姐曾经是山中四天王之一。传闻说她有异常程度的怪力，腕力即便在鬼之中也几乎无可匹敌。没想到我也能结识到这么厉害的妖怪…果然还是有点儿紧张啊。',
			'本来以为鬼已经对人类失去兴趣…但勇仪小姐其实在偷偷羡慕着在地上自由往来的同伴的身影。既然对地上感兴趣，那就去地上玩吧！鬼就该是这样嘛！',
		],
		dlc: 2,
		places: [2000, 2, 1001, 2001],
		price: '600-1000',
		positiveTags: [5, 8, 12, 19, 23, 35, -1, -20],
		negativeTags: [2, 24, 28],
		beverageTags: [2, 6, 10, 17],
		chat: [
			'一个两个都往地上钻，地上真的那么有趣吗？',
			'酒就是越热闹才越好喝。',
			'酒杯就不必了，我的酒器是随身携带的。',
			'真热闹啊，比嗓门的话没有人能比得过鬼。',
		],
		evaluation: {
			exbad: '这样的料理简直是糟蹋我的酒！',
			bad: '这菜的味道有点配不上我的酒啊。',
			norm: '有好酒相送，菜随便吃吃就行了。',
			good: '温泉后的饱餐时光足以治愈人心。',
			exgood: '好马配好鞍，好酒配好菜！',
			lackmoneyangry: '敢宰鬼的黑店也是第一次见。',
			lackmoneynormal: '钻钱眼子可不太好啊。',
			repell: '胆子真不小啊。',
			seenRepell: '无趣之举。',
		},
		spellCards: {
			positive: [
				{
					name: '「接着奏乐接着舞」',
					description:
						'将一定数量的酒水升级成更高一级的酒水。必定升级三杯1级酒水，有75%的概率升级两杯2级酒水，有50%的概率升级一杯3级酒水。',
				},
			],
			negative: [
				{
					name: '四天王奥义「三步必杀」',
					description:
						'生成三重警戒圈，限制角色移动，持续60秒；移动速度下降50%，直到离开范围；进入范围将被立即击晕30秒。',
				},
			],
		},
		positiveTagMapping: {
			35: '血液沸腾起来',
			[-1]: '饱餐一顿',
		},
		collection: false,
	},
	{
		id: 2003,
		name: '古明地觉',
		description: [
			'传说中能够读心的觉妖怪，名字也是觉。大概是对自己的种族或能力很自豪吧？因为日以继夜都在工作，所以没什么搭话的机会…',
			'觉小姐真是我见过最操劳的领主了。虽然有宠物们帮忙干杂活，但是行政方面的工作似乎只有她能做。为了工作似乎放弃了很多日常爱好，唯独不能放弃读心。累到虚脱可不好啊。',
			'我明白为什么宠物们那么依恋觉小姐了。被繁重的工作埋没，心中还能一直牵挂着妹妹和宠物。在清冷的外表下的这份温柔，确实是会让人念念不忘呢。',
		],
		dlc: 2,
		places: [2001, 1, 2, 3, 4, 1000],
		price: '500-600',
		positiveTags: [3, 17, 23, 28, 29, 30],
		negativeTags: [0, 10, 22, 24, -1],
		beverageTags: [-1, 15, 16, 19],
		chat: [
			'距离太远的话，就读不到了…',
			'赶紧吃完回去工作吧。',
			'好不容易挤出一些时间，也该犒劳一下自己。',
			'美食不仅是味觉感受，更是一种精神享受。',
		],
		evaluation: {
			exbad: '这一顿比工作积攒的精神压力更大。',
			bad: '难得过来一趟，有些失望。',
			norm: '吃食只是为了支撑自己不会倒下。',
			good: '阿燐的眼光向来不错。',
			exgood: '真可谓层层叠叠，色香味齐全啊！',
			lackmoneyangry: '我很清楚成本是多少。',
			lackmoneynormal: '抱歉，把零花钱分给宠物后没剩多少了…',
			repell: '不是说要为我准备健康料理吗？',
			seenRepell: '一个人的礼貌是一面照出它肖像的镜子。',
		},
		spellCards: {
			positive: [
				{
					name: '想起「高兴的事情」',
					description: '随机发动一名已解锁的稀有顾客（不包括自己）的奖励符卡。',
				},
			],
			negative: [
				{
					name: '想起「不高兴的事情」',
					description: '随机发动一名已解锁的稀有顾客（不包括自己）的惩罚符卡。',
				},
			],
		},
		positiveTagMapping: {
			28: '吃太饱不利于思考',
			30: '缩短他乡与故乡的距离',
		},
		collection: false,
	},
	{
		id: 2004,
		name: '火焰猫燐',
		description: [
			'被称作火车的猫妖，是地灵殿之主的左右手。能够和尸体和怨灵对话似乎很方便！不过…说到火车就是偷尸体啊。就是因为这样所以被厌恶吧？唔唔，对别人的兴趣说三道四似乎不太好…',
			'仔细想想，人类刚死掉的时候，应该会茫然吧？如果能在猝然长辞之际遇到开朗善谈的阿燐，或许能中和一些对死亡的恐惧。',
			'活在偏见下的“凶兆的黑猫”，原来要经历那么艰辛的事。偏见真是不可取啊。幸好阿燐遇到了觉小姐。一个好的主人可以改变宠物的一生。希望阿燐今后可以一直过着无忧无虑地偷尸体的生活。',
		],
		dlc: 2,
		places: [2001, 1, 2, 1001, 2000, 3000, 3001],
		price: '500-700',
		positiveTags: [1, 11, 16, 17, 24, 29, -20],
		negativeTags: [18, 22],
		beverageTags: [0, 6, 12],
		chat: [
			'以阿空的性格来说，要时时刻刻盯着核熔炉的火力，真是难为她了。',
			'今天送来的怨灵有点多啊。',
			'下次叫上觉大人一起来吧。',
			'觉大人有好好吃饭吗…',
		],
		evaluation: {
			exbad: '还不如吃腐肉呢，呸呸！',
			bad: '是我看走眼了吗…',
			norm: '这种程度真的能让觉大人提起食欲吗…',
			good: '这样的好东西真是吃一次少一次啊！',
			exgood: '美味到即便是厌食症也会化身饕餮的程度！',
			lackmoneyangry: '你都强买强卖，就别怪咱吃霸王餐了！',
			lackmoneynormal: '最近手头有点紧…',
			repell: '大姐，你太伤咱的心了。',
			seenRepell: '骄傲自满可是会招来损失的。',
		},
		spellCards: {
			positive: [
				{
					name: '猫符「猫醉步」',
					description: '给顾客上含有“中酒精”标签的酒水，必然获得最高等级的评价，持续30秒。',
				},
			],
			negative: [
				{
					name: '「死灰复燃」',
					description:
						'阿燐在离去时，将会在原先座位上留下一只地底怨灵，继续以阿燐的兴趣爱好点单，地底怨灵无法被主动驱赶，也不会付款，只有按照正常流程进行满足才会主动消失。',
				},
			],
		},
		positiveTagMapping: {
			11: '地底海底相通',
		},
		collection: true,
	},
	{
		id: 2005,
		name: '灵乌路空',
		description: [
			'看守灼热地狱遗址的地狱鸦，有着火焰般热烈爽快的性格。外表看起来和其他地狱鸦不太一样，唯独脑袋空空这一点让我感到很亲切。',
			'阿空的外表之所以大放异彩，原来是因为她的体内寄宿了神灵八咫乌！自地狱的黑暗诞生而来的地狱鸦，和栖息于太阳的八咫乌，真是奇妙的组合啊！不过…让她拥有这么强大的力量真的没问题吗？',
			'最近突然觉得，没有比阿空更适合拥有这种力量的人选了。拥有异常强大的力量，却没有使用这种力量的头脑，这就是一种幸运吧？脑袋空空的阿空很可爱哦！不过我也常被说脑袋空空呢。',
		],
		dlc: 2,
		places: [2001, 1001],
		price: '500-800',
		positiveTags: [0, 6, 15, 22, 23, 34],
		negativeTags: [7, 26],
		beverageTags: [1, 4, 7],
		chat: [
			'等待美食出炉的时间是快乐的。',
			'享受美食的时间是最快乐的。',
			'天要下雨，菜要下饭。',
			'脑子里装不下的东西，就用肚子来装。',
		],
		evaluation: {
			exbad: '还不如让我扔到灼热地狱烤一烤。',
			bad: '火热程度太低了。',
			norm: '多谢老板娘招待。',
			good: '这一顿很火热啊！',
			exgood: '我得到了比灼热地狱还要热烈的感受！',
			lackmoneyangry: '假装忘记带钱吧…反正我是鸟脑袋嘛。',
			lackmoneynormal: '鸟脑袋只能装这么多钱啦。',
			repell: '当心我把你烤了哦！',
			seenRepell: '干嘛要把人赶走啊…',
		},
		spellCards: {
			positive: [
				{
					name: '「地狱的托卡马克装置」',
					description: '煮锅和蒸锅能瞬间完成料理，持续60秒。',
				},
			],
			negative: [
				{
					name: '狱光「扩散地狱火」',
					description:
						'下一次料理时没有成功完美演唱会使厨具炸毁，当晚无法使用，部分排队的顾客也会被吓得抱头鼠窜。',
				},
			],
		},
		positiveTagMapping: {
			6: '火焰的燃烧',
			22: '比火焰炽热',
			34: '火辣辣的感觉',
		},
		collection: false,
	},
	{
		id: 3000,
		name: '多多良小伞',
		description: [
			'寄宿在怪异唐伞上的灵，因为一直没有人使用，不知不觉就付丧神化了。是个只要见到别人被吓了一跳，就会快乐得手舞足蹈的家伙。',
			'这家伙的性格好麻烦啊！本来以为是个开朗亲切的妖怪，结果动不动就哭鼻子…我拿这种家伙最没办法啦！好在她总是很快就能振作起来！',
			'尽管偶尔会露出悲观的一面，但她内心深处却是个爽朗坚毅的妖怪。虽然总是遭遇挫折，却总是花样层出地努力着呢。这份能量，希望我也可以拥有！',
		],
		dlc: 3,
		places: [3000, 4001],
		price: '150-300',
		positiveTags: [3, 9, 17, 20, 23, 24, 27, -20],
		negativeTags: [22, 32, 34],
		beverageTags: [1, 3, 12, 17],
		chat: [
			'我又来了！吓~一跳了吗？',
			'这里变得更热闹了！好开心啊——！',
			'伺机寻找目标…好！一会儿就吓那个家伙吧！',
			'今天又没有吓到人…',
		],
		evaluation: {
			exbad: '难吃到吓我一跳。',
			bad: '无法带来一点惊喜。',
			norm: '还不错，就是少了点惊喜。',
			good: '好吃到吓我一跳！',
			exgood: '惊——！好吃到吓人！',
			lackmoneyangry: '我没有钱哦！吓到了吧——？！',
			lackmoneynormal: '这些钱都是小孩子们给我的…',
			repell: '哭…我真是太没用了…',
			seenRepell: '我能理解这种被嫌弃的感觉。',
		},
		spellCards: {
			positive: [
				{
					name: '雨符「雨夜怪谈」',
					description: '带有“猎奇”标签的食物制作速度提高30%，且额外提供30%续单率，持续30秒。',
				},
			],
			negative: [
				{
					name: '「超级巨幻影唐伞」',
					description: '吓跑排队中的普通顾客。',
				},
			],
		},
		positiveTagMapping: {
			9: '肚子总是空空',
			20: '好看的食物',
			24: '让人吓一跳',
		},
		collection: true,
	},
	{
		id: 3001,
		name: '村纱水蜜',
		description: [
			'居然让醉心于让船沉没的妖怪来担任圣辇船的船长，命莲寺真是从里到外都让人无法理解。这家伙能在任何水面引发水难事故，以后得更加注意厨房积水！',
			'虽然拜入佛门已经有千年之久，却还是一点儿佛门弟子的自觉都没有。过去在海上胡作非为惯了，至今仍瞒着住持到处恶作剧。不过对命莲寺不利的事，她是绝对不会做的。',
			'恣性洒脱的船长，甘愿成为佛门弟子，受佛门管束（其实也不太管得住），只为报答千年前的恩情。果然不能以貌取人呀。村纱小姐她，有着一颗有情有义的金子般的心呢。',
		],
		dlc: 3,
		places: [3000],
		price: '400-600',
		positiveTags: [0, 4, 9, 15, 16, 23, 30],
		negativeTags: [2, 24, 28, 2000],
		beverageTags: [2, 3, 8, 14],
		chat: [
			'那个倒霉死神发现自己的船漏水了吗？',
			'白天大家都那么克制了，晚上大闹一场也可以吧？',
			'我也很羡慕今朝有酒今朝醉的生活啊…',
			'吃饱了还得载那个家伙去魔界…',
		],
		evaluation: {
			exbad: '比船上的备用食物还要难吃！',
			bad: '也就和船上的备用食物差不多。',
			norm: '我也不是什么挑食的人。',
			good: '不错哟！我的船正缺一位你这样的厨娘。',
			exgood: '你做的料理散发着和圣辇船一样的光辉！',
			lackmoneyangry: '钱太沉了，我的船载不动呐。',
			lackmoneynormal: '地上的生活成本比海上高多了。',
			repell: '我一定要把你从船上扔下去！',
			seenRepell: '真遗憾，我就是冲着热闹来的啊。',
		},
		spellCards: {
			positive: [
				{
					name: '「船灵流连不散」',
					description:
						'获得“船幽灵附身”状态，持续15秒。拥有此状态时所获得的其他奖励符卡（不包括此符卡），都将延长有效时间，延长的长度等于获得新符卡时，本符卡的剩余时间。',
				},
			],
			negative: [
				{
					name: '溺符「深海漩涡」',
					description:
						'无法行动（可通过上下左右摇杆减少时间），持续5秒。之后的20秒内，上下左右移动方向相反。',
				},
			],
		},
		positiveTagMapping: {
			16: '食物的保质期',
			30: '食物的相逢',
		},
		collection: false,
	},
	{
		id: 3002,
		name: '封兽鵺',
		description: [
			'古老的真相不明的妖怪——鵺。长得和传说完全不一样真可惜…虽然也是命莲寺的弟子，但总是见到她独自在寺院附近无所事事地游荡，似乎不太合群的样子。',
			'她就像是被忽视、通过恶作剧来吸引大家注意力的别扭的孩子。内心希望融入寺中，却笨挫地不知道该怎么表达…明明活了这么久，还是不谙世故呢。',
			'越是在意就越容易畏缩…结果她的内心就和她的形象一样无法被人看清，这难道就是“无法明状之物”的寂寞吗？但她如今已经展露出自己的真相，大家以后也一定会慢慢理解她的率真的！',
		],
		dlc: 3,
		places: [3000, 4001],
		price: '300-500',
		positiveTags: [0, 16, 18, 19, 20, 24, 27, 30, -21],
		negativeTags: [13, 2000, -20],
		beverageTags: [4, 5, 11, 17],
		chat: [
			'你听说过幽灵食堂的都市传说吗？',
			'最近的人类是不是都缺根筋？',
			'孤独才是享受美食的最好状态。',
			'好不容易找到的容身之处，我绝不离开。',
		],
		evaluation: {
			exbad: '这种东西不值得我展露真相。',
			bad: '马马虎虎吧。',
			norm: '看来你还没有挖掘出美食的真相。',
			good: '这就是美食的真相吗？！',
			exgood: '展露真相就是为了品尝这样的美味！',
			lackmoneyangry: '平安时代的强盗都没有你猖獗！',
			lackmoneynormal: '自平安时代攒下来的钱已经快见底了…',
			repell: '反正我也独来独往惯了。',
			seenRepell: '我就是为了感受一下热闹才来的。',
		},
		spellCards: {
			positive: [
				{
					name: '开心「东方红绿蓝」',
					description:
						'开动飞碟转盘，必然中奖，结果为以下四种情况中的一种：红红红：无论上什么菜都必然获得最高等级的评价，持续15秒；绿绿绿：食材和酒水不会被消耗，持续15秒；蓝蓝蓝：收入提高100%，持续15秒；红绿蓝：同时获得以上三种Buff。',
				},
			],
			negative: [
				{
					name: '恶心「东方红红蓝」',
					description:
						'开动飞碟转盘，必然Miss，结果为以下四种情况中的一种：红红绿：无论上什么菜都必然获得极度不满的评价，持续15秒；绿绿〇：食材和酒水消耗量提高到三倍，持续15秒；蓝蓝〇：收入减少66%，持续15秒；红红蓝：同时获得以上三种buff。',
				},
			],
		},
		positiveTagMapping: {
			16: '腐肉',
			20: '拍个不停',
		},
		collection: false,
	},
	{
		id: 3003,
		name: '物部布都',
		description: [
			'通过长时间自己诅咒自己从而沉眠的古代人。大概是睡了太久，思考方式也跟古时候一样，和普通人完全脱节…目前在努力学习现代知识，结果来说变得更加不伦不类了。',
			'如果不提她那套落伍的作风，其实她也蛮有仙人那种风格，尤其对风水什么的似乎很有研究。我是搞不懂啦…要不下次装修的时候请她帮忙看看好了。',
			'无法完全割舍过去，就说明对过去还留有怀念吧？尽管这样，布都小姐还是毅然决然地成为尸解仙的实验品。我虽然无法理解人类的这份忠心，但也感到非常敬佩！',
		],
		dlc: 3,
		places: [3001],
		price: '600-900',
		positiveTags: [4, 5, 7, 10, 12, 35, -20],
		negativeTags: [13, 18, -21],
		beverageTags: [1, 4, 11, 16],
		chat: [
			'平淡无奇的锅碗瓢盆里，盛满了人类的一生。',
			'若能让吾把这个盘子摔了，店里的生意会更上一层楼。',
			'后厨的火力够吗？需要吾帮忙添一把火吗？',
			'与火为伴的厨子生活说不定挺适合吾…',
		],
		evaluation: {
			exbad: '火候把握不好的话就让吾来助汝烧一把吧！',
			bad: '只能算是无功无过吧。',
			norm: '多谢款待。',
			good: '口腹之欲都要被勾起来了！',
			exgood: '国之宴席也莫过于此！',
			lackmoneyangry: '贵店的物价恐怕连国库都能掏空。',
			lackmoneynormal: '差点就在众目睽睽下吃霸王餐了！',
			repell: '小人无节，弃本逐末！',
			seenRepell: '礼者，人道之极也。',
		},
		spellCards: {
			positive: [
				{
					name: '圣童女「太阳神的贡品」',
					description:
						'根据顾客评价获得酒水奖励，“普通”评价获得1级酒水，“满意”评价获得2级酒水，“完美”评价获得3级酒水，持续10秒。',
				},
			],
			negative: [
				{
					name: '传薪「浴火捏盘」',
					description: '只能使用一个托盘进行服务，被禁用托盘内的还未拿走的物品会被焚毁，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			12: '吾之时代',
		},
		collection: false,
	},
	{
		id: 3004,
		name: '霍青娥',
		description: [
			'经常见到她在神庙附近晃荡嬉玩的样子，似乎对修行不太热心…但又十分热衷于向别人传达修道的好处。实在搞不明白她到底在想什么。是个看起来很正统，行为和思想却很另类的仙人。',
			'想要做成一件事就会不计后果地去达成，就算自己的行为不被人理解，她也会摆出一副理所当然的态度。要说她是被欲望驱使，又觉得恰恰相反…她所做的那些事，与其说是为了欲望，或许只是单纯的性格使然。',
			'邪仙不一定就是邪恶的仙人。仅仅由于思考和行动都不够妥当就被断绝天人之路，确实是让我有些费解…我只知道青娥小姐非常有个性！如果成为天人就要泯灭个性，那我希望青娥小姐还是一直保持这个样子比较好。',
		],
		dlc: 3,
		places: [3001],
		price: '400-900',
		positiveTags: [2, 5, 14, 17, 27, 28, 30, -20],
		negativeTags: [6, 9],
		beverageTags: [0, 6, 12, 18],
		chat: [
			'小麻雀离烟火气有点太近了呢…',
			'我可爱的部下们受你关照了哟。',
			'四方食事，不过一碗人间烟火。',
			'想吃仙人的妖怪不少，给仙人做饭的还是第一次见呢。',
		],
		evaluation: {
			exbad: '要不是走火入魔怎么可能会来吃这种东西！',
			bad: '是我看走眼了吗？',
			norm: '还要再加把劲哦。',
			good: '美食当前还嚷嚷着辟谷就太不解风情了。',
			exgood: '努力活着才能吃到这样的美味呢。',
			lackmoneyangry: '我像是身上有很重铜臭味的人吗？',
			lackmoneynormal: '小麻雀也挺会宰客的呢。',
			repell: '你可要想清楚哟…',
			seenRepell: '是我看走眼了吗？',
		},
		spellCards: {
			positive: [
				{
					name: '邪术「天下无墙」',
					description: '伙伴在食堂区域移动时可以穿过顾客或障碍物，持续30秒。',
				},
			],
			negative: [
				{
					name: '入魔「走火入魔」',
					description:
						'稀有顾客每次结账，无论评价高低，都有30%的概率放一次惩罚符卡。如果是本来就会放惩罚符卡的情况，则多放一次。持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			2: '满嘴荤腥',
			14: '我的家乡',
			28: '宵夜的份量',
			30: '吃遍各地美食',
		},
		collection: false,
	},
	{
		id: 3005,
		name: '苏我屠自古',
		description: [
			'古代人的亡灵。过去似乎怀有很深的怨恨，所以性质上是妖怪们最害怕的怨灵。有点儿不太敢接触她呢…',
			'实际接触后，发现屠自古小姐的性格确实是直爽又豁达，还充满活力。一点儿也不像是怨灵呢。大概是怨恨已经消散得差不多了吧？能让心胸豁达的屠自古小姐变成怨灵，一定是相当痛苦的事情…',
			'没想到没想到，让屠自古小姐变成怨灵的元凶竟然是布都小姐！可她们两人的感情还是很要好的样子？！屠自古小姐的心胸何止是豁达的程度，她大概离成佛只有一步之遥了。',
		],
		dlc: 3,
		places: [3001],
		price: '500-600',
		positiveTags: [3, 6, 9, 12, 19, 23, 33],
		negativeTags: [17, 21],
		beverageTags: [2, 5, 10, 15],
		chat: [
			'三餐正常，四餐满意。',
			'美食和风景，可以抵抗全世界所有的悲伤和迷惘。',
			'死了以后就什么都不用担心了。',
			'遇酒且呵呵，人生能几何！',
		],
		evaluation: {
			exbad: '拿糟糠来糊弄我吗？！',
			bad: '还不如我自己瞎折腾弄得好吃。',
			norm: '聊胜于无。',
			good: '这般美味比仇恨更让人惦记。',
			exgood: '有此美食作伴就算千年孤独也不在话下！',
			lackmoneyangry: '什么黑店！太子大人给的家用竟然堪堪支付一顿饭钱？！',
			lackmoneynormal: '我的钱和我的怨恨都消散得差不多了。',
			repell: '你就不怕我怨恨你吗？',
			seenRepell: '麻雀老板的心眼也太小了…',
		},
		spellCards: {
			positive: [
				{
					name: '雷影「电光石火」',
					description: '自己和伙伴的移动速度提升30%，持续30秒。',
				},
			],
			negative: [
				{
					name: '天罚「天雷暴击」',
					description: '下一次没有成功完美演唱的料理，将会引来天雷，击晕一位伙伴30秒。',
				},
			],
		},
		positiveTagMapping: {
			9: '就用肚子来装',
			12: '过去吃过的',
			33: '被雷劈过一样',
		},
		collection: true,
	},
	{
		id: 4000,
		name: '射命丸文',
		description: [
			'每天在幻想乡各处奔走，收集题材来写成新闻的鸦天狗。也是大名鼎鼎的《文文。新闻》的作者。之所以说大名鼎鼎，并不是这个报纸有多出色，而是派发得实在太多了…',
			'本来就很强的她，再加上有新闻这种强力的武器，导致文文小姐在幻想乡里经常不被待见。不过看着如此拼命工作的她，感觉也会受到鼓舞呢。如果她的新闻能少些胡扯就好了。',
			'报纸真的是非常伟大的东西！文文小姐创作的报刊，记录了幻想乡的过去，虽然稍微有些失真的地方…但也还是有值得回忆的地方！希望文文小姐最终能够找到适合她的新闻风格。',
		],
		dlc: 4,
		places: [4000, 0, 1, 2, 3, 4, 1000, 1001, 2000, 2001, 3000, 3001, 4001, 5000, 5001],
		price: '500-600',
		positiveTags: [0, 3, 8, 12, 19, 20, -20],
		negativeTags: [13, -21],
		beverageTags: [2, 3, 5, 19],
		chat: [
			'今天的素材也不太能用呢…',
			'想要获得情报就要深入群众。',
			'劳逸结合才是长久之道哟。',
			'新闻和做菜一样，加点料更香。',
		],
		evaluation: {
			exbad: '烂到这种程度也足够上头条了！',
			bad: '喂喂，做成这样没关系吗…',
			norm: '作为新闻素材的话感觉无波无澜呢。',
			good: '这个菜有成为爆款的潜力呢。',
			exgood: '这个菜绝对能成为头条！',
			lackmoneyangry: '感谢我没有报导这种漫天要价的行为吧！',
			lackmoneynormal: '自费做了太多报纸，差点连夜宵也吃不起。',
			repell: '喂喂？！不怕我报导出去吗？',
			seenRepell: '把客人都赶走我还怎么打探情报？',
		},
		spellCards: {
			positive: [
				{
					name: '「八衢潮流风靡幻想」',
					description: `明天开始店铺变为“明星店”，三天后恢复正常。${LABEL_BR}“明星店”：提高10%顾客预算和5%客流量，“${TAG_SIGNATURE}”标签成为流行标签。如果店铺已是“明星店”或当晚已宣传，则此符卡转化为“「食堂风起厨神无双」”。`,
				},
				{
					name: '「食堂风起厨神无双」',
					description: `成品带有“${TAG_SIGNATURE}”标签的今日菜单上的料理将成为明星料理。制作明星料理时，如果料理时间小于5秒，则瞬间完成；在舆论的裹挟下，追捧“${TAG_POPULAR_POSITIVE}”标签的顾客食用明星料理后额外提高30%续单率，返还当单酒水消耗的预算，并必定增加一次续单上限（增加续单上限效果每桌顾客只触发一次），持续30秒。`,
				},
			],
			negative: [
				{
					name: '「笔枪纸弹禁制之道」',
					description:
						'无法进行投掷上菜，持续30秒。同时在报纸上对黑心店铺进行抨击，使“明星店”加成明天起消失，并使伙伴【拉尔瓦】在场上播撒的催眠粉消失。',
				},
			],
		},
		positiveTagMapping: {
			8: '有酒无菜',
			20: '入我相机',
		},
		collection: false,
	},
	{
		id: 4001,
		name: '梅蒂欣',
		description: [
			'独居在剧毒的铃兰田野的付丧神，因为才出生不久，所以经验和知识都严重地不足，也不懂得该怎么和人相处。总在偌大的铃兰田野里自言自语甚至手舞足蹈的样子，可爱中透着一些诡异…性格倒是直来直往。',
			'虽然成为了妖怪，但身体似乎还是人偶的样子。所以就算体内充盈了毒也不会感到任何不适。对人类的友好度很低，以前还会在食物里下毒来操纵人类…因为太年轻下手不懂得区分轻重，在她的心志成长起来以前，一定要特别注意！',
			'谁能想到毒人偶其实是这么单纯的孩子呢？你教给她什么，她就会吸收什么。看着新生妖怪一点点地成长起来原来是这种感觉！因为我自己也很年轻，所以很少有作为前辈的经历。现在我想为这个孩子保驾护航，让她幸福地成长…虽然我可能还没有她强。',
		],
		dlc: 4,
		places: [4000],
		price: '200-400',
		positiveTags: [17, 19, 20, 21, 26, 28, 29, 4001],
		negativeTags: [25],
		beverageTags: [-1, 12, 13, 15],
		chat: ['孤独是毒也是药。', '毒取少量即为药。', '饮酒过量可是对身体的毒哟。', '向日葵要是也有毒就好了。'],
		evaluation: {
			exbad: '完全无法和铃铃的毒相比！',
			bad: '铃铃不太喜欢这种味道。',
			norm: '所谓料理也没有比毒药出彩很多嘛。',
			good: '我和铃铃一致好评！',
			exgood: '这是除了毒以外能让我感受到的最大满足！',
			lackmoneyangry: '铃铃说你们就是黑店！',
			lackmoneynormal: '我和铃铃好不容易攒下来的钱快见底了…',
			repell: '我要让这双驱赶我的手烂掉！',
			seenRepell: '铃铃说她突然没什么兴致了。',
		},
		spellCards: {
			positive: [
				{
					name: '分解「剧毒中和」',
					description:
						'移除“铃兰「凋零花园」”状态；梅蒂欣操纵料理中可能存在的有害元素，使料理时的标签不再产生冲突，持续30秒，并获得带有“中酒精”标签的酒水一瓶。同时，可使【帕秋莉】的惩罚符卡失效。',
				},
			],
			negative: [
				{
					name: '铃兰「凋零花园」',
					description:
						'移除“分解「剧毒中和」”状态；制作料理时铃铃会额外为料理追加特殊的“忧郁之毒”标签，食用带有该标签的食物的顾客不会续单，持续30秒。此效果可被酒水【牛奶】解除。',
				},
			],
		},
		positiveTagMapping: {
			17: '毒最基础的味道',
			21: '不能受热',
			26: '森林里疯长的',
			29: '追求奇妙的体验',
			4001: '最上乘的调味品',
		},
		collection: true,
	},
	{
		id: 4002,
		name: '风见幽香',
		description: [
			'虽然看起来是一副高雅的淑女形象，但不知道为什么，很多人将她视作“花之暴君”。虽然恐怖的传说满天飞，但大家其实都没有见过她欺负人类或者弱小妖怪。真实的她，究竟是一位怎样的人呢？',
			'只要见过她照顾花儿的样子，那些有关她的谣言就会不攻自破。但我还是不明白，她有那么强大的妖力，为什么会容忍谣言满天飞，为什么要默默地承受那些恶意中伤呢？',
			'大错特错！她从来都没有“忍受”过那些谣言，因为她根本就不在乎。于是连澄清都变得多此一举。幽香小姐最为强大之处，正是她的心。我想，并不是强大的妖力让她睥睨众人，真正让她立于不败之地的，是她纯粹又干净的自我。',
		],
		dlc: 4,
		places: [4000],
		price: '1200-1800',
		positiveTags: [4, 5, 7, 13, 27, 29, 30, -20],
		negativeTags: [9, 12, 15, 22],
		beverageTags: [7, 8, 9, 18],
		chat: [
			'我对无聊的战斗不感兴趣。',
			'花儿们看起来也很高兴。',
			'这里从来没有过这样的氛围。',
			'花间有酒，独酌何碍。',
		],
		evaluation: {
			exbad: '呵——！我接受你的挑衅——！',
			bad: '如此相待，最随和的花儿也不会愿盛开。',
			norm: '这样是无法获得花儿的青睐的。',
			good: '心情就像缓缓打开的花蕾一样呢。',
			exgood: '你拥有的是让心花皆绽放的能力！',
			lackmoneyangry: '我没有留下一记魔炮你就该感恩戴德了。',
			lackmoneynormal: '漫天要价是无法延续生意的。',
			repell: null,
			seenRepell: null,
		},
		spellCards: {
			positive: [
				{
					name: '「花鸟风月群芳沐」',
					description: `在场上种下一朵鲜花并利用能力使其生长，满心情时额外种下一朵，每朵生长的鲜花每24秒生产25小费。除幽香以外的稀有顾客释放奖励符卡时，随机一朵生长的鲜花将吸收符卡之力而盛放，吸引当地出没的稀有顾客造访食堂，被鲜花吸引来的稀有顾客会摘走这朵鲜花。鲜花盛放期间顾客用餐结束后额外提高15心情，15秒后鲜花凋谢，获得一层“落英缀裳”。${LABEL_BR}“落英缀裳”：可以抵挡一次中断Combo的失误。`,
				},
			],
			negative: [
				{
					name: '「决斗Spark!!!」',
					description:
						'用微笑的表情走到自己所在座位那一排的最上方，然后一发魔炮将这排桌子轰飞，当夜不可修复，并吓跑所有在这些位置用餐的顾客。',
				},
			],
		},
		positiveTagMapping: {
			5: '流传至今的过去',
			7: '不要油手碰花',
			13: '绅士风度',
			27: '冬紫罗兰',
			29: '蓝色满天星',
		},
		collection: false,
	},
	{
		id: 4003,
		name: '鬼人正邪',
		description: [
			'擅长花言巧语的天邪鬼。打着要颠倒幻想乡的口号，蛊惑了许多年轻气盛的妖怪甚至人类来当手下，但却因为资金不足无法善待他们，甚至找天狗刊登广告骗游客来收取过路费…无论怎么看，都是个乱来的家伙。',
			'正邪小姐真的想下克上吗？感觉她对造反成功之后的事情并没什么兴趣。或许她只是从和社会作对汲取乐趣，并不是真的想改变这个社会。',
			'看着同伴一个接一个的离开，一般人多少都会觉得此路不通吧？但是正邪小姐完全没有想过放弃。在如今人人都悠闲地过着普通日子的幻想乡中，她是少有的不达目的绝不罢休的那一类。从某种程度来说，还蛮让我敬佩的…',
		],
		dlc: 4,
		places: [4001],
		price: '300-600',
		positiveTags: [6, 8, 22, 23, 24, 27, 35, -21],
		negativeTags: [4, -20],
		beverageTags: [1, 5, 11, 14],
		chat: [
			'温温吞吞永远都无法革命成功。',
			'弱小的妖怪们，和我一起站起来吧！',
			'总有一天我会把你收入麾下。',
			'依恋“家的味道”也太软弱了！',
		],
		evaluation: {
			exbad: '我要颠倒正是这种将糟糠奉为美食的世界！',
			bad: '软弱的味道。',
			norm: '“一般”颠倒过来还是“一般”。',
			good: '力量源源不绝！这就是美食的威力吗？',
			exgood: '力量满满！此刻的我无论什么都能将其颠倒！',
			lackmoneyangry: '小费就当做是你孝敬的保护费了！',
			lackmoneynormal: '靠开食堂来敛财真是绝妙的主意啊。',
			repell: '你以为这是谁的地盘？！',
			seenRepell: '弱小妖怪什么时候才可以不被欺压？！',
		},
		spellCards: {
			positive: [
				{
					name: '欺符「超限效应」',
					description:
						'令全场除自身以外的顾客的厌恶标签反转为喜好标签，持续30秒。当场上包括排队顾客在内的普通顾客数量之和不少于7时，此符卡转化为“逆弓「天壤梦弓的诏敕」”。',
				},
				{
					name: '逆弓「天壤梦弓的诏敕」',
					description:
						'使场上包括排队顾客在内的普通顾客额外获得一次续单上限和25%预算，每位普通顾客最多可以受到此效果影响三次。',
				},
			],
			negative: [
				{
					name: '逆转「颠倒世界」',
					description:
						'将自身的预算和全场最高预算水平的顾客预算翻转，并在接下来的15秒内持续将除自己以外的所有顾客的预算降低到全场最低预算顾客水平。',
				},
			],
		},
		positiveTagMapping: {
			22: '滋滋冒气',
			27: '不可能实现',
			35: '颠覆强者',
		},
		collection: false,
	},
	{
		id: 4004,
		name: '少名针妙丸',
		description: [
			'非常崇拜一寸法师的小人族的城主，性格克制认真，是一个有着英雄梦的勇者厨。向往冒险的深闺公主还真是新鲜呢。擅长和菓子这一点和气质很相衬！',
			'明明很向往勇者的冒险，也做了非常多的准备，但是却迟迟没有踏上旅程。对于能否留下完美的传说这件事非常在意。会不会有些在意过头了…',
			'终于解开心结的针妙丸小姐勇敢地踏上了道路，而那些“凭着一股勇气就可以拯救世界”的故事就是她的精神道标。从她身上我也明白到，太在意结果就会寸步难行，果然还是随心而动比较适合我！',
		],
		dlc: 4,
		places: [4001],
		price: '600-1200',
		positiveTags: [5, 12, 17, 20, 25, 28, 35, -20],
		negativeTags: [13, -1],
		beverageTags: [0, 4, 16, 17],
		chat: [
			'来这里就可以听到好故事吗？',
			'辉针城从来没有这么热闹过…',
			'她应该也常来这里吧？',
			'谢谢你给这座寂寞的城带来尘嚣。',
		],
		evaluation: {
			exbad: '这道菜难吃得能侵蚀内心的勇气！',
			bad: '就算是作为路上的充饥之物都不够格呀。',
			norm: '勉强能在路上作充饥之物吧。',
			good: '这道菜给我的体验就像读勇者故事一样！',
			exgood: '这道菜让我充满了踏上旅程的勇气！',
			lackmoneyangry: '虽然是贵族，却是破败了的…',
			lackmoneynormal: '小人族闭关太久，外面的物价已经这么高了吗？',
			repell: '你竟然驱赶未来的勇者大人？！',
			seenRepell: '身为勇者，我不能容许这种事发生。',
		},
		spellCards: {
			positive: [
				{
					name: '宝槌「通货膨胀危机」',
					description:
						'使用万宝槌敲击收银台，叠加一层“万宝槌之力”。万宝槌充盈的魔力将在营业结束时使营业额膨胀，第一层“万宝槌之力”使收入提高7%，之后每层使收入提高2%。同时，充盈的万宝槌之力使伙伴【赤蛮奇】分裂出的辘轳首产生暴走，移动速度提高200%。',
				},
			],
			negative: [
				{
					name: '小槌「你给我变大吧!」',
					description: '身体将会被放大到原先的三倍，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			5: '充满勇气的故事',
			12: '名神的后裔',
			20: '跟别人分享',
			28: '我的食量',
		},
		collection: true,
	},
	{
		id: 4005,
		name: '今泉影狼',
		description: [
			'稳重温婉的狼女，给人一种亲切的邻家大姐姐的感觉。不知是不是因为月人在竹林里住下的缘故，那里和月亮相关的妖怪似乎很多，影狼小姐也是其中一员。',
			'影狼小姐似乎很在意皮肤，这么爱美的狼人还真是第一次见呢。草根妖怪的日常真是平和又热闹。偶尔忍不住也会想…如果我不开店，大概也在过着这样的生活吧。',
			'影狼小姐作为狼的部分，是在外面世界已经绝种的本州狼。一度被敬仰、被崇拜，最后却落得灭绝下场真可怜。幻想乡的人类和妖怪要多多爱护我们兽（禽）类呀！',
		],
		dlc: 4,
		places: [4, 4001],
		price: '300-600',
		positiveTags: [0, 3, 10, 12, 20, 21, -20],
		negativeTags: [22],
		beverageTags: [1, 3, 6, 11],
		chat: [
			'太晚睡对皮肤不好…',
			'节食减肥绝对不是美丽之道。',
			'大晚上的感觉也好热呀…',
			'是不是应该把头发也剪一下呢…',
			'老板娘辛苦了。',
		],
		evaluation: {
			exbad: '这样的料理感受不到任何善意。',
			bad: '看来老板娘的厨艺也不是很稳定嘛。',
			norm: '在我心里你应该能做得更好。',
			good: '我能品尝出料理里的善意哦！',
			exgood: '老板娘做的菜才是真正的圆满！',
			lackmoneyangry: '掉下来的毛如果能变成钱就好了。',
			lackmoneynormal: '宵夜还真是一不小心就会吃过量…',
			repell: '草根妖怪也是有尊严的！',
			seenRepell: '为什么不能和平相处呢？',
		},
		spellCards: {
			positive: [
				{
					name: '狼魂「野性觉醒」',
					description:
						'接下来的30秒内，顾客会爱上“肉”和“山珍”标签，在对料理评分时作为自身的喜好进行评价，原本喜好这些标签的顾客食用相关料理时必然触发最高评价。',
				},
			],
			negative: [
				{
					name: '饿狼「暴食的月下舞踏」',
					description:
						'接下来的30秒内，所有顾客的料理如果没有添加“饱腹”标签，会触发最差评价，原本厌恶“饱腹”标签的顾客食用相关料理时必然触发最差评价。',
				},
			],
		},
		positiveTagMapping: {
			0: '人家是狼',
			12: '本州风格',
			21: '从胃里降温',
		},
		collection: false,
	},
	{
		id: 5000,
		name: '铃仙',
		description: [
			'似乎因为我来自地上，所以对我很亲切的月之使者，和永远亭的铃仙小姐有着一样的名字。偶尔会表现出对地上的向往，不知道是不是过去发生了什么…也可能是因为月之使者的训练太辛苦了吧。',
			'原来铃仙曾经是一只捣药兔，因为厌烦无休止的捣药逃到幻想乡而发生了许多事，所以才成为一名月之使者。难怪她会对地上表现出眷恋。不过她似乎也不喜欢月之使者的工作，感觉她从内到外都过得好辛苦啊…',
			'一直活在后悔中是一种怎样的心情呢？如果时间可以重来，她就不会从捣药的工作中逃走了吗？那样她就会感到幸福吗？这些问题我都没能问出口…不过，与其徘徊在过去，还是向前看比较好吧？希望她有朝一日能得到真正的自由。',
		],
		dlc: 5,
		places: [5000],
		price: '200-350',
		positiveTags: [3, 10, 11, 14, 17, 28, 30],
		negativeTags: [27, -3],
		beverageTags: [2, 4, 5, 10, 15],
		chat: ['今天也好累啊…', '忙碌的一天终于结束了！', '现在是犒赏自己的时间！', '肌肉好酸痛。'],
		evaluation: {
			exbad: '真是糟糕的一天…',
			bad: '今天也是就这样过去了吗…',
			norm: '谢谢，我恢复力气了。',
			good: '谢谢老板娘治愈了我这一天的疲惫！',
			exgood: '这就是我的光！！！',
			lackmoneyangry: '就算把我卖了我也付不起呀！',
			lackmoneynormal: '打工的钱快花完了…',
			repell: '这就是属于我的命运吧。',
			seenRepell: '这个世道到处都是不公的对待。',
		},
		spellCards: {
			positive: [
				{
					name: '「月免的篝火盛宴」',
					description:
						'召开一场盛大的篝火盛宴，场上每只存在的兔子生成一个随机食材或一瓶随机酒水，接下来30秒内出现新的兔子时会同样生成食材或酒水。生成食材的概率为80%，生成酒水的概率为20%。',
				},
			],
			negative: [
				{
					name: '「酒醉迷乱」',
					description:
						'铃仙向场上打出一颗狂气之弹，影响场上的顾客，持续30秒。受到狂气影响的顾客食用不带有“高酒精”标签的酒水必定给出最低评价。当场上有伙伴【铃仙】时，此效果仅持续10秒。',
				},
			],
		},
		positiveTagMapping: {
			10: '月之都如果有山',
			11: '不那么死气沉沉',
			14: '月兔也是仙子',
			28: '兔子的胃很小',
			30: '无法抵达的地方',
		},
		collection: true,
	},
	{
		id: 5001,
		name: '绵月丰姬',
		description: [
			'绵月家的姐姐。性格和蔼温柔，偶尔会露出孩子气的一面。除了偶尔会在月之使者训练时给兔子们带小点心，几乎没有参与月之使者的训练，因此很受月兔的喜爱。',
			'丰姬小姐真是相当——相当喜欢桃子，以及相当——相当优哉游哉。像她这么强大的人，真的可以这样什么都不用操心吗？无论在什么环境下都能活得这么天真，这应该也算是一种能力吧？',
			'原来丰姬小姐心里也有想要完成的事呢。她是从什么时候开始产生想要隐退的想法呢？或许从一开始，她就只是被迫继承月之使者首领的工作吧。至今没有隐退，一来是没有合适的继任者，二来…恐怕还是为了依姬小姐吧？',
		],
		dlc: 5,
		places: [5000],
		price: '1200-1500',
		positiveTags: [2, 4, 12, 17, 21, 25, 31, -20],
		negativeTags: [10, 15, 23],
		beverageTags: [2, 3, 6, 12, 17],
		chat: [
			'偶尔也要吃吃桃子以外的呢。',
			'吃喜欢的东西，过可爱的人生。',
			'今天的第五顿饭启动！',
			'吃货最高境界就是眼见为食。',
		],
		evaluation: {
			exbad: '要不是为了不浪费食物…',
			bad: '还是去吃桃子好了。',
			norm: '不浪费食物是我的底线。',
			good: '好吃！还想吃更多更多。',
			exgood: '好吃到我想在店里住下来了哟！',
			lackmoneyangry: '我不是已经把桃子留下了吗？',
			lackmoneynormal: '太计较钱财会失了风度哟。',
			repell: '小麻雀太坏了。',
			seenRepell: '不可以欺负人哟，小麻雀。',
		},
		spellCards: {
			positive: [
				{
					name: '方圆「山海千重」',
					description:
						'丰姬连接海和山，链接幻想乡的一个地点，使该区域的普通顾客和稀有顾客可以穿越“面”前来。通过丰姬的能力链接的地区刷新效果分别独立，刷新速率为原先的33%。',
				},
			],
			negative: [
				{
					name: '晦朔「天地未形」',
					description:
						'丰姬从当地出没的稀有顾客以及当晚邀请的稀有顾客中随机选择三个还未出现的顾客，使她们“神隐”，今晚无法前来夜雀食堂。',
				},
			],
		},
		positiveTagMapping: {
			2: '吃草帮助消化',
			12: '喜欢上和歌了',
			21: '好热',
			25: '料理里的故事',
		},
		collection: false,
	},
	{
		id: 5002,
		name: '绵月依姬',
		description: [
			'绵月家的妹妹。个性认真严谨，担负着兔子们的战斗、学习、礼法的训练——几乎包揽了月之使者首领该做的所有活儿。虽然实际上几乎没有战斗，但对待训练却很严格，兔子们要是偷懒就会被严厉惩罚。',
			'因为性格太过于一板一眼，对待训练又十分严厉，兔子们都不太亲近她。和清闲自在的姐姐相反，依姬小姐似乎一直处于无法放松的状态，可能聪明人总是容易想太多…',
			'依姬小姐继承了师傅的意志，想要为月之都做出贡献，所以她才时刻保持着危机感。严格操练士兵，也是不希望她们在战争中死去。将所有一切背负下来的依姬小姐，真是坚强又温柔啊…',
		],
		dlc: 5,
		places: [5000],
		price: '1000-1200',
		positiveTags: [4, 5, 7, 14, 22, 23, 25, 28],
		negativeTags: [10, 26],
		beverageTags: [4, 5, 11, 14, 19],
		chat: [
			'这时候来冥想一下吧。',
			'等餐时顺便做一下明天的训练计划吧。',
			'吃完后再做做运动吧。',
			'没想到有这么多人有吃夜宵的习惯。',
		],
		evaluation: {
			exbad: '0分！',
			bad: '40分。',
			norm: '60分。',
			good: '不错，可以有90分。',
			exgood: '这个值得满分！',
			lackmoneyangry: '我不可能放任你在月都胡来！',
			lackmoneynormal: '这定价…明天来谈一谈吧。',
			repell: '我可以理解为这是你下的战书吗？',
			seenRepell: '军队不能出现不公。',
		},
		spellCards: {
			positive: [
				{
					name: '神诏「众神谕使」',
					description:
						'依姬召唤神灵，附加一层“神耀桂冠”，如果本次提供的料理带有“传说”标签，则额外附加一层。当稀有顾客产生不为完美的评价时，消耗一层“神耀桂冠”引发神迹，将评价提升至完美。',
				},
			],
			negative: [
				{
					name: '诫罚「诸神圣裁」',
					description: '带有“传说”标签的料理或使用带有“传说”标签的食材制作的料理无法被制作，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			4: '月之民不食糟糠',
			5: '令后人传诵的功绩',
			22: '不要让血液冷下来',
			28: '锻炼不宜吃太多',
		},
		collection: false,
	},
	{
		id: 5003,
		name: '爱莲',
		description: [
			'勤劳、善良热情的小女孩，开着一家“蓬松松爱莲”魔法店，还养了一只叫做苏格拉底的、个性有点儿酷的猫。',
			'只要遇到需要帮助的人，爱莲小姐就会尽十二分努力去帮助，是个非常友好的魔法使！爱莲小姐对工作也一直保持着相当的热忱，每次和她对话感觉自己也变得活力满满了。',
			'明明外表和个性看起来都很年幼，却是个已经活了几千年的大魔法使，真是完全看不出来！活得久的妖怪我也见了不少，但活了那么久还能保持这份纯真、浪漫和善良的，爱莲小姐真是独一人！',
		],
		dlc: 5,
		places: [5001],
		price: '300-500',
		positiveTags: [3, 9, 13, 17, 21, 29, -20],
		negativeTags: [1, 6, 18],
		beverageTags: [0, 4, 10, 13, 17],
		chat: [
			'苏格拉底也要多吃点哦。',
			'魔界也有这样的店真是太好了。',
			'有没有我能帮得上忙的地方呢？',
			'耐心等待就好。',
		],
		evaluation: {
			exbad: '工作需要再用心一些…',
			bad: '唔，辛苦了…',
			norm: '多谢老板娘款待！',
			good: '我和苏格拉底都很满意哦！',
			exgood: '好吃得苏格拉底都变得亮晶晶了！',
			lackmoneyangry: '对不起，我会更努力地工作赚钱的…',
			lackmoneynormal: '得更努力工作赚钱才行了…',
			repell: '不能带苏格拉底进来吗？',
			seenRepell: '对待客人要一视同仁。',
		},
		spellCards: {
			positive: [
				{
					name: '「恋爱的糖果屋」',
					description:
						'当完成场上顾客的订单且至少获得普通评价后，在座位附近掉落一枚“蓬松松糖果”以供拾取，持续30秒。',
				},
			],
			negative: [
				{
					name: '「呜撒的猫咪」',
					description: '伙伴移动速度下降30%，工作速度下降50%，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			21: '毕竟是猫舌头',
		},
		collection: true,
	},
	{
		id: 5004,
		name: '魅魔',
		description: [
			'独自在魔界进行着（危险？）研究的…学者？自称是神灵，但被大家视为恶灵或邪灵。不管怎么样，能感受到她扎扎实实的强大和自信，她到底是怎样的存在呢？',
			'魅魔小姐竟然诞生源自那个雾雨家的魔法实验，真是太让人惊讶了！不过，就算有着这样的渊源，信念坚定的魅魔小姐也绝不会受任何人所有或支配。追求和探索真理是魅魔小姐一生的目标，就算因此和雾雨家决裂、打了上百年的仗也不曾改变过本心。',
			'原来魅魔小姐就是魔理沙小姐的师傅！我早就应该想到的，她们俩真的有很多共同点！无论是追求知识的执著和专注这点，还是道德感方面…以及，从来不会展现自己软弱和脆弱的一面…表面看起来完全不同的，这两个孤独又坚定的人，过去会是什么样子的呢？',
		],
		dlc: 5,
		places: [5001],
		price: '2000-3000',
		positiveTags: [1, 10, 16, 18, 23, 24, 26],
		negativeTags: [4, 7],
		beverageTags: [2, 3, 5, 8, 14],
		chat: [
			'这组实验数据还需要再验证…',
			'回过神来已经几天没吃饭了啊。',
			'稍微吃点再继续实验吧。',
			'等待的时间继续刚刚的计算吧。',
		],
		evaluation: {
			exbad: '就像在知识宝库上轻浮蹦迪一般让人愤怒。',
			bad: '就像外行人做内行事一般让人感到焦躁。',
			norm: '就像胸无点墨的人炫耀自己的知识一般无聊。',
			good: '就像终于寻得了公式得出理想结果一般令人振奋！',
			exgood: '就像邂逅了未解之谜一般令人陶醉！',
			lackmoneyangry: '被小瞧了啊，忘记我的恐怖了吗——？',
			lackmoneynormal: '略为小贵，无伤大雅。',
			repell: '哦？竟这样对我，考虑清楚后果了吗？',
			seenRepell: '最有效率的做法啊，脑子转的很快嘛。',
		},
		spellCards: {
			positive: [
				{
					name: '「幽冥的轮回」',
					description: `如果场上不存在“幽玄封魔阵”则生成法阵，如果存在则为法阵填充2点能量。${LABEL_BR}“幽玄封魔阵”：除魅魔以外的稀有顾客释放任意符卡时填充1点能量。能量达到7点时，消耗全部能量引发“梦符「时空一粟」”。`,
				},
				{
					name: '梦符「时空一粟」',
					description:
						'场上所有就座的顾客的剩余预算回复到上限，制作料理不消耗食材且瞬间完成，顾客必定给出最高评价，持续20秒。',
				},
			],
			negative: [
				{
					name: '「渎神的代价」',
					description: '受到“恶灵缠怨”：无法获得夜雀之歌类Buff，且无法触发特殊厨具效果，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			16: '陈腐的东西不能入口',
			18: '最原始的味道',
			23: '激活身体和思维',
		},
		collection: false,
	},
	{
		id: 5005,
		name: '露易兹',
		description: [
			'经常偷偷溜出魔界甚至去外界旅行（工作）的魔界人，几乎随身带着一个可以自动行走的行李箱。工作内容是在一个叫做“博客”的地方分享自己的旅行过程，据说很受外面世界的人类欢迎。真奇怪，人类这么喜欢看别人旅行吗？',
			'原来露易兹小姐不仅仅分享旅行过程，也经常分享自己的创意设计。她不仅见多识广，有非常多有趣的想法和创意，还很了解时尚，很会夸人，很会做甜品…真希望自己也能成为像露易兹小姐这样优秀的人呀。',
			'就算像露易兹小姐这样满心满意地为了人类而行动的人，也一样无法得到所有人的认同。想要互相理解真不是一件容易的事啊。但就算这样，露易兹小姐也没有打算放弃热爱的工作。希望她的未来能够一直“不负热爱”。',
		],
		dlc: 5,
		places: [5001, 0, 1, 2, 3, 4, 1000, 1001, 3000, 3001, 4000, 4001],
		price: '800-1000',
		positiveTags: [1, 13, 17, 20, 28, 30, -20],
		negativeTags: [6, 9],
		beverageTags: [1, 3, 7, 10, 18],
		chat: [
			'好想去人间界呀。',
			'其实人间界也有这样的店哦。',
			'偶尔就这样呆在魔界也挺好的。',
			'魔界难得有这么热闹的时候呢。',
		],
		evaluation: {
			exbad: '这要是发到博客会被扔烂番茄。',
			bad: '这种水平就算发到博客也没有人会关注。',
			norm: '不温不火的水平呢。',
			good: '美味得我都想发博客了！',
			exgood: '我一定要在博客上推荐这道料理！',
			lackmoneyangry: '旅游景点的餐厅都没有你家贵！',
			lackmoneynormal: '这好像高于一般定价了吧…',
			repell: '赶客的景点是没有未来的…',
			seenRepell: '再有名的景点也没有傲慢对待客人的资格。',
		},
		spellCards: {
			positive: [
				{
					name: '「传奇的格列佛」',
					description:
						'露易兹召唤一架魔法相机停留在店内，如果稀有顾客本尊离开时未吃饱且预算未耗尽，则相机拍下该稀有顾客并转换为一份“旅者博客”。当日结束后“旅者博客”解放（如果拍摄时当日已结束，则立即解放），投影出其拍摄的顾客形象再次光临食堂，以此方式形成的稀有顾客的影像可以使用符卡，喜好和原先无异，但预算为其离开时的预算，续单上限为其离开时剩余的可点单数。',
				},
			],
			negative: [
				{
					name: '「遗落的水晶鞋」',
					description: '当晚营业结束后，再经过60秒，将会强制驱逐店铺内的顾客并关店。',
				},
			],
		},
		positiveTagMapping: {
			20: '适合发博客',
			28: '晚上不宜太饱',
			30: '旅行的乐趣',
		},
		collection: false,
	},
	{
		id: 6,
		name: '森近霖之助',
		description: [
			'自诩为普通的商人，买卖全凭兴趣，十分乱来。作为经营者前辈来说，应该是一个很好的反面教材吧？不过，偶尔也能淘到一些有用东西就是了。',
			null,
			null,
		],
		dlc: 0,
		places: [1, 1000, 4000],
		price: '250-400',
		positiveTags: [3, 9, 16, -20],
		negativeTags: [6, 8, 24, -21],
		beverageTags: [5, 10],
		chat: [
			'说到经营，我可是前辈哦…你那是什么眼神啊！',
			'不能理解的事情就不要去理它，要不然在幻想乡可活不下去。',
			'首先应当认真思考，并陈述了自己的想法后再问他人。',
			'我不是那种会动粗的人，所以才能好好地活这么长时间。',
			'你这儿还是太简陋了，要不要去我店里选几个道具，算你便宜哦。',
		],
		evaluation: {
			exbad: '就这种水平也敢开店？',
			bad: '普普通通吧。',
			norm: '偶尔换换口味也不错呢。',
			good: '可以啊！居然做得这么好！',
			exgood: '太好吃了！麻雀难道是料理的天才吗？！',
			lackmoneyangry: '怎么有人卖东西比我还离谱啊？！',
			lackmoneynormal: '钱不太够…下次你去我那，我给你打个九九折吧！',
			repell: '你以后也别想到我的店里来了！',
			seenRepell: '你有没有一点身为经营者的自觉啊？！',
		},
		spellCards: {
			positive: [
				{
					name: '「香霖堂购物节」',
					description: '获得一张香霖堂购物七折的打折卡，仅限次日使用，过期作废。',
				},
			],
			negative: [
				{
					name: '「虚构的情报」',
					description: '随机隐藏已经解锁的稀有顾客的喜好信息。',
				},
			],
		},
		positiveTagMapping: {
			9: '不能吃不饱',
		},
		collection: false,
	},
	{
		id: 4008,
		name: '蕾米莉亚',
		description: [
			'红魔馆的主人。远远看去还以为是个幼童，走近却被她的气势压得不敢说话，不愧是响彻一方的吸血鬼领主！但任性起来真的和小孩子很像…',
			'虽然她还不太成熟，但她背负着许多人的命运。明明是那么小小的肩膀，却把一大家子全都庇护在自己的羽翼下，还真有点儿一家之主的感觉。蕾米小姐，也不完全像大家认为的那样以自我为中心呢。',
			null,
		],
		dlc: 4,
		places: [2, 3],
		price: '4950-5000',
		positiveTags: [4, 5, 13, 17, 18, -20],
		negativeTags: [15, 34, 2000, -2],
		beverageTags: [2, 8, 12, 13, 17],
		chat: [
			'芙兰那孩子的精力真是用不尽啊…',
			'一会也带点回去给芙兰尝尝吧。',
			'这家店的命运说不定已经悄悄地改变了。',
			'和我们家的女仆比起来还差得远呢。',
		],
		evaluation: {
			exbad: '做出这样的东西，果然应该用神枪刺穿你吧？',
			bad: '我一开始就没有对你抱有任何期待。',
			norm: '和我们家的女仆比起来还差得远呢。',
			good: '这次真的不错呢，总算值得一点期待了。',
			exgood: '只有这样的美味才能够配得上吸血鬼的尊贵身份！',
			lackmoneyangry: '咲夜只给我准备了这么多钱！',
			lackmoneynormal: '我还不习惯自己带钱出门…',
			repell: '哼，看来我是太纵容你了啊。',
			seenRepell: '还是回家吃咲夜做的吧。',
		},
		spellCards: {
			positive: [
				{
					name: '红符「红色不夜城」',
					description: `本日结束时使食堂进入“红色不夜城”状态（如果当日已结束，则立即触发），持续至营业结束。${LABEL_BR}“红色不夜城”：普通顾客的预算不会低于500；伙伴的工作速度提高100%，如果是咲夜则将工作速度提高至极限；顾客的续单率提高100%；发动时如果蕾米莉亚本人此时依然在场，则接下来60秒内不会闭店，并以300%的速率继续刷新普通顾客。否则在场上的最后一位稀有顾客离开时，依照当晚触发的奖励符卡数量召唤对应数量的妖精女仆前来。`,
				},
			],
			negative: [
				{
					name: '夜符「红雾异变再临」',
					description: '释放血雾覆盖左下角的订单区域，持续60秒。',
				},
			],
		},
		positiveTagMapping: {
			13: '异国风味',
		},
		collection: false,
	},
	{
		id: 39,
		name: '魂魄妖梦',
		description: [
			'侍奉着冥界之主的庭师兼侍卫、厨师。也就是说，她不仅要一个人照顾两百由旬的西行寺庭院，还要守卫西行寺家以及主人的安危，同时还要照顾大胃王主人的饮食需求！无论哪一个都是重担呢，希望她能在夜雀食堂得到一些治愈吧！',
			null,
			null,
		],
		dlc: 0,
		places: [0, 1, 2, 4],
		price: '300-400',
		positiveTags: [3, 7, 16, 23],
		negativeTags: [6, 15, 24],
		beverageTags: [-1, 4, 12],
		chat: [
			'终于可以轻松地来光顾了！',
			'之前太失礼了，老板娘能不计前嫌真是太好了。',
			'唉，侍奉幽幽子大人累得快让我的骨头散架了。',
			'老板娘如果有什么需要帮忙的，尽管开口！',
			'如果冥界也有一家食堂那我就轻松多了。',
		],
		evaluation: {
			exbad: '就算是恶作剧也太过分了！',
			bad: '诶——不应该是这个味道吧？',
			norm: '我应该也可以做到这种程度吧？',
			good: '呜呜，我要是也能做出这个味道就好了！',
			exgood: '啊——这就是我无论如何都无法实现出来的味道吗！',
			lackmoneyangry: '爷爷说过，被敲诈的时候要掉头就走！',
			lackmoneynormal: '对不起！我只能付得起这么多…',
			repell: '为、为什么啊…',
			seenRepell: '被赶走的人也太可怜了…',
		},
		spellCards: {
			positive: [
				{
					name: '狱界剑「二百由旬之一闪」',
					description: '制作料理台的料理时能瞬间完成，持续60秒。',
				},
			],
			negative: [
				{
					name: '天上剑「天人之五衰」',
					description: '顾客耐心衰减速度翻倍，且每2秒减少1点气氛，持续60秒。',
				},
			],
		},
		positiveTagMapping: {},
		collection: false,
	},
	{
		id: 40,
		name: '西行寺幽幽子',
		description: [
			'差点儿吞噬了幻想乡的可怕的家伙。原以为恢复神志后就会世界和平，结果一见面就想吃了我？！现在偶尔也会到食堂用餐，有时候会看着我咽口水…我这辈子都不想再见到这个亡灵。',
			null,
			null,
		],
		dlc: 0,
		places: [2, 3, 4, 3001],
		price: '1500-2000',
		positiveTags: [0, 1, 4, 5, 9, 12, 14, -1],
		negativeTags: [2, 7, 28],
		beverageTags: [2, 3, 7],
		chat: [
			'我对梦里的味道念念不忘，所以就来了。',
			'唔，麻雀的小碎骨有点太多了…',
			'这家店的老板娘真的不能吃吗？好可惜…',
			'不要紧张，把我视为普通客人就好了哟。',
			'进食的时候被这样警惕地盯着，我会不好意思的哦。',
		],
		evaluation: {
			exbad: '这东西看起来还不如老板娘好吃。',
			bad: '唔，这不是我印象中的味道呢。',
			norm: '和我印象中的味道还差了一点。',
			good: '果然偶尔要出来吃一下外面的美食呢。',
			exgood: '这就是那个让我念念不忘的味道！',
			lackmoneyangry: '哎呀，忘记带钱了呢。',
			lackmoneynormal: '要结账了吗？我看看，这么多就够了吧。',
			repell: '我不会把你的店吃垮的啦。',
			seenRepell: '诶？小麻雀真没劲…',
		},
		spellCards: {
			positive: [
				{
					name: '「食物瞬间消失术」',
					description:
						'接下来直到营业结束为止，顾客会瞬间吃下所有料理。再次触发时此符卡转化为“「墨染浮櫻化醉蝶」”。',
				},
				{
					name: '「墨染浮櫻化醉蝶」',
					description:
						'幽幽子释放1/3/5/8（随使用次数提升）只蝴蝶飞向保温箱，每只蝴蝶吞噬保温箱中存储的一个料理，转化为等同于四倍料理价格的金钱（享受小费倍率加成）。',
				},
			],
			negative: [
				{
					name: '「加料加量不加价」',
					description: '接下来直到营业结束为止，料理不加满五个档位的料，都会收到差评。',
				},
			],
		},
		positiveTagMapping: {},
		collection: false,
	},
	{
		id: 30,
		name: '萌澄果',
		description: [
			'MC幻想乡的板娘，通过“联动之门”穿越过来的异世界人，同时也担当驻夜雀食堂的形象大使，不断邀请着夜雀食堂世界的居民去MC幻想乡做客，积极的推进着两边的生态发展中。',
			null,
			null,
		],
		dlc: 0,
		places: [0, 1, 2, 3, 4, 1000, 1001, 3000, 3001, 4000, 4001, 5000, 5001],
		price: '1200-1600',
		positiveTags: [0, 1, 17, 29, -20],
		negativeTags: [22, 24, -21],
		beverageTags: [3, 12, 13, 14],
		chat: [
			'这个世界会提供什么料理呢？期待期待。',
			'这个世界的人不像我们那边棱角分明呢。',
			'这个世界的大家都好可爱，连我都可爱了！',
		],
		evaluation: {
			exbad: '你们就拿这样的东西招待异世界的旅人吗？！',
			bad: '我远道而来就为了个这？',
			norm: '挺期待的，但也就那么回事吧。',
			good: '好吃好吃！不枉我穿越通道来这边一次呀！',
			exgood: '太好吃了！我要介绍给我们世界的每一个人！',
			lackmoneyangry: '这边世界流行宰客吗？',
			lackmoneynormal: '啊，差点预算就被爆破了。',
			repell: '呜呜，我要找kk投诉你开黑店！',
			seenRepell: '哇——这个世界的老板娘这么生猛的吗！',
		},
		spellCards: {},
		positiveTagMapping: {},
		collection: false,
	},
	{
		id: 31,
		name: '蹦蹦跳跳的三妖精',
		description: [
			'蹦蹦跳跳的三妖精讨伐大作战中的主角，通过“联动之门”穿越过来的异世界妖精。因为无尽的好奇心和行动力，在本世界也受到了大家的欢迎，看到她们就感到元气满满。',
			null,
			null,
		],
		dlc: 0,
		places: [0, 1, 2, 3, 4, 1001],
		price: '300-400',
		positiveTags: [3, 17, 21, 26, 28, 29, -20],
		negativeTags: [18, 22, 24, -21],
		beverageTags: [-1, 12, 13, 15],
		chat: [
			'哈哈哈，今天会用什么来招待我们呢！',
			'我们的画风跟其他人真的不一样啊…',
			'三个人一起坐…说实话有点挤啊…',
			'老板娘！快把最上好的东西端出来吧！',
			'幸好有带一些钱…不过大家要省着点花呀。',
			'真想偷偷的溜进后厨学两招。',
		],
		evaluation: {
			exbad: '这玩意儿！狗都不吃！',
			bad: '拿这东西忽悠妖精你的良心不会痛吗？',
			norm: '也就那么回事吧。',
			good: '你加什么东西呀？！为什么会这么好吃？！',
			exgood: '好、好吃！HIGH起来了！',
			lackmoneyangry: '宰客啦！老板娘宰客啦！',
			lackmoneynormal: '差一点就要付不起钱被关在瓶子里了…',
			repell: '哇——这个世界欺负柔弱的妖精！',
			seenRepell: '什么叫黑心老板娘啊，我们算是见识了！',
		},
		spellCards: {},
		positiveTagMapping: {},
		collection: false,
	},
	{
		id: 36,
		name: '冴月麟',
		description: [
			'在村子里的医馆担任护士的人类，性情直率纯粹，在医护的方面非常细心，对入院治愈后仍不爱惜自己身体的病人恨铁不成钢。面对这种病人，她会偷偷在下针的时候加大力度…',
			null,
			null,
		],
		dlc: 0,
		places: [0, 1, 2, 3, 4],
		price: '400-600',
		positiveTags: [1, 3, 14, 34, -20],
		negativeTags: [6, 8, 18, -21],
		beverageTags: [-1, 13, 16],
		chat: [
			'我的麟是麒麟的麟哦！很厉害吧。',
			'这儿的客人比我们医馆多多了。',
			'今天又因为扎针的时候下手太重被客人投诉了…',
			'竹林那边的赤脚医生是从哪里冒出来的？',
			'我没什么耐心，一会儿上菜可别让我等太久啊！',
		],
		evaluation: {
			exbad: '别以为老娘登场少就好欺负啊！',
			bad: '这也没比药好吃多少…',
			norm: '还不错吧。',
			good: '好、好吃！就连妖怪做饭都比我好吃…',
			exgood: '积攒了一天的疲劳被治愈了！',
			lackmoneyangry: '胡扯！别以为你乱开价我会搭理你！',
			lackmoneynormal: '我就只有这么多钱了…',
			repell: '赶我走？下次别让我在医馆看到你！',
			seenRepell: '区别待遇真没意思。',
		},
		spellCards: {
			positive: [
				{
					name: '「扶我起来，我还能吃」',
					description:
						'包括排队顾客在内的所有顾客，有30%的概率增加一次额外续单，每位顾客的概率独立计算。通过此种方式增加的额外续单将无视预算上限。',
				},
			],
			negative: [
				{
					name: '「饭要一口一口吃才健康」',
					description: '包括排队顾客在内的所有顾客，用餐时间增加一倍，但此技能效果优先级低于立刻完食类Buff。',
				},
			],
		},
		positiveTagMapping: {},
		collection: false,
	},
	{
		id: 37,
		name: '立空汐',
		description: [
			'来自八寒地狱的鬼卒，据说鬼卒的工作就是凌辱堕入地狱的罪人，好可怕！无论穿着打扮还是性格都是喧哗派，时常操着不像这个时代的混混的口头禅，好斗又好强，不是在打架，就是在找架打的路上。真怕她哪天会憋不住把我的店拆了…',
			null,
			null,
		],
		dlc: 0,
		places: [0, 2, 3, 4, 1001],
		price: '500-800',
		positiveTags: [0, 8, 10, 12, 23, -3, -21],
		negativeTags: [2, 7, -20],
		beverageTags: [2, 3, 4],
		chat: [
			'生前好好行善积德，才不会在死后受我凌虐。',
			'善恶到头终有报。',
			'我残暴？呵呵，皆是那些幽灵罪有应得。',
			'同情心什么的根本就不需要。',
			'人类啊，好好珍惜活着的幸福吧。',
		],
		evaluation: {
			exbad: '你想下地狱吗？！',
			bad: '地上的食物就这种水平吗？',
			norm: '也就这样吧。',
			good: '地上的食物果然有意思！',
			exgood: '我都想破格把你掳到八寒地狱来做饭呢！',
			lackmoneyangry: '敢敲诈我？有本事就来地狱讨吧！',
			lackmoneynormal: '凭什么是你来定价？我说了算！',
			repell: '可恶！你要是将来落在我手上…',
			seenRepell: '哼，地上也一样是欺善怕恶。',
		},
		spellCards: {
			positive: [
				{
					name: '「不玩尽兴还想走?!」',
					description:
						'使用空间能力将在场顾客封闭起来，只要顾客还吃得下并且有能消费得起的料理，就必须消费，直到花费额度至少到达预算的70%才会解除。在解除前，顾客无法离开桌子，只能继续点单。持续60秒。',
				},
			],
			negative: [
				{
					name: '拷问「頞部陀」',
					description: `制作含有“清淡”或“素”标签的料理，最终只能做出${DARK_MATTER_NAME}，持续120秒。`,
				},
			],
		},
		positiveTagMapping: {},
		collection: false,
	},
	{
		id: 38,
		name: '时焉侑',
		description: [
			'新地狱的行政高官，八寒地狱鬼神长，似乎也是新地狱行政和司法方面的高级顾问。这样的大人物为什么会到我的店里来呢…难道我的店在地狱也有很名吗？',
			null,
			null,
		],
		dlc: 0,
		places: [1, 2],
		price: '1300-1800',
		positiveTags: [5, 8, 13, 14, 25, 30],
		negativeTags: [1, 6, 9],
		beverageTags: [1, 3, 7, 8],
		chat: [
			'地狱的改革，势必会引发一场激烈的斗争…',
			'今日的执著，会造成明日的后悔。',
			'一切恶法，本是虚妄。',
			'在无尽的未来里，有无数种可能。',
			'那个妖怪贤者…呵呵，原来如此。',
		],
		evaluation: {
			exbad: '痛苦的经验总是最有力的教训。',
			bad: '不进则退，不得则亡。',
			norm: '我所看到的…你的水平不应如此。',
			good: '不错，凭着去时走错路的经验，回来时就顺利了。',
			exgood: '地上有如此珍馐，让人几欲流连忘返。',
			lackmoneyangry: '买卖不公者终堕刀锯地狱。',
			lackmoneynormal: '定价不公也是罪。我只能按规则来付这笔钱。',
			repell: '即便是幻想乡也无法接受地狱来客吗？',
			seenRepell: '任何人都不该被时间轻易抹去。',
		},
		spellCards: {
			positive: [
				{
					name: '因果「推理与判断之眼」',
					description: '辨识顾客的剩余预算和点单次数，持续120秒。',
				},
			],
			negative: [
				{
					name: '律符「颠倒错乱」',
					description: '无论上的料理和酒水如何合衬顾客的心意，得到的评价都是随机的一种，持续60秒。',
				},
			],
		},
		positiveTagMapping: {},
		collection: false,
	},
	{
		id: 1003,
		name: '饕餮尤魔',
		description: [
			'畜生界什么同盟的盟主，传说中的饕餮的动物灵，是个什么都能吸收的不得了的大胃王！性格会受吞下的事物的影响，如今似乎有了对美食的追求，偶尔会到店里来做客…体型和模样都像个小孩子，希望不会被哪个不怕死的妖怪给小瞧了吧…',
			null,
			null,
		],
		dlc: 1,
		places: [1001, 0, 2, 3, 1000, 4, 2000, 2001, 3000, 3001, 4000, 4001, 5000, 5001],
		price: '9999-9999',
		positiveTags: [0, 4, 5, 9, 16, 18, 23, 27, -1],
		negativeTags: [],
		beverageTags: [2, 5, 11, 14],
		chat: [
			'小看这人世可是会吃苦头的哦？',
			'血池的恐惧、悲欢、憎恶、怨恨也很美味呢。',
			'我的信条是“坐收渔利”。',
			'刚欲同盟的成员多半都是些各行其是的家伙。',
			'吃掉这个小麻雀的话，我是不是也能做出这么美味的食物。',
		],
		evaluation: {
			exbad: '血池的恐惧、悲欢、憎恶、怨恨，你也想感受一下吗？！',
			bad: '我不是为了这种东西跑到地上来的——！',
			norm: '和黑水的味道差不多吧。',
			good: '一直以来小瞧地上了，这一趟来得值！',
			exgood: '只有这种舌尖上的享受，才配得上我无限的胃袋！',
			lackmoneyangry: '连我钱都想讹？先看看你有没有这个本事！',
			lackmoneynormal: '这家饭店不讲理的程度和畜生界有得一拼。',
			repell: '真以为我不会对你下手？',
			seenRepell: '地上和畜生界也没什么不同，无趣。',
		},
		spellCards: {
			positive: [
				{
					name: '「饕餮的饕餮之宴」',
					description: '除尤魔以外的顾客都只会点最贵的食物和酒水，且这些订单不消耗预算，持续30秒。',
				},
			],
			negative: [
				{
					name: '「刚欲兽神饕餮的晚餐」',
					description:
						'暴走的尤魔将会随机吞噬掉3-5个食材和1-3个酒水，并吞噬1个厨具，使该厨具当晚无法使用。在血池地狱挑战中，会额外恢复5%的HP。',
				},
			],
		},
		positiveTagMapping: {
			9: '无限的胃袋',
			16: '馊掉的东西',
			18: '血淋淋的食物',
			[-1]: '指头缝都塞不满',
		},
		collection: false,
	},
	{
		id: 2006,
		name: '古明地恋',
		description: [
			'地灵殿之主的妹妹，封闭了第三只眼的觉！由于封闭了内心所以存在感也变得很低，神秘的身影让她在地底收获了许多追崇者。总是挂着灿烂的笑容，但谁也无法知道她真正的内心是怎么想的。就连她自己也不知道。',
			null,
			null,
		],
		dlc: 2,
		places: [2001, 0, 1, 2, 3, 4, 1000, 1001, 2000, 3000, 3001, 4000, 4001, 5000, 5001],
		price: '800-1200',
		positiveTags: [15, 17, 18, 24, 27, 29],
		negativeTags: [],
		beverageTags: [2, 5, 15, 16],
		chat: [
			'贪吃不胖，美梦不空。',
			'只要填饱肚子就不会感到空虚啦！',
			'怪诞评审好酷——啊呀！那不就是我嘛！',
			'等啊等——会等来什么呢。',
		],
		evaluation: {
			exbad: '把小麻雀装饰在家里一定很好看。',
			bad: '明明肚子空空却不想吃呢。',
			norm: '吃饱啦。',
			good: '姐姐说肚子吃得鼓鼓的就表示吃饱了！',
			exgood: '这么棒的老板娘装饰在家里一定很好看！',
			lackmoneyangry: '为什么吃饭要付钱啊？',
			lackmoneynormal: '我就随便带了点钱，你都拿去好了。',
			repell: '怎么啦怎么啦？是没看到我吗？',
			seenRepell: '恋恋喜欢热闹啦！',
		},
		spellCards: {
			positive: [
				{
					name: '「自在极意无意识」',
					description:
						'顾客点单、吃饭和店员操作等所有需要冷却时间的动作，全部无冷却、无意识发动，达到理论速度的极限，持续60秒。',
				},
			],
			negative: [
				{
					name: '「自我极意无意识」',
					description: '普通顾客点单全部变成被恋恋遮住的盲单，需要通过查询图鉴喜好来完成，持续60秒。',
				},
			],
		},
		positiveTagMapping: {
			27: '永远猜不到我想要的是什么',
		},
		collection: false,
	},
	{
		id: 3009,
		name: '二岩猯藏',
		description: [
			'妖怪狸的首领，有着相应的威严和领导风范，擅长变幻术。不过再如何擅长变幻的妖兽，想要完全藏起尾巴和耳朵都是不可能的。另外尾巴的大小其实是妖力的计量表，或许她从最初开始就没有藏起自己尾巴的打算。',
			null,
			null,
		],
		dlc: 3,
		places: [0, 1, 2, 3000, 3001],
		price: '1000-1200',
		positiveTags: [0, 1, 3, 5, 8, 12, 31, -20],
		negativeTags: [22, 34],
		beverageTags: [2, 4, 5, 17],
		chat: [
			'叶子变的钱非常便利哦。',
			'这种传统与现代交融的风格颇合老朽心意。',
			'老朽还年轻着呐。',
			'那边的…嚯嚯嚯，这么拙劣的变身可骗不了老朽。',
		],
		evaluation: {
			exbad: '竟敢戏弄老朽？让你见识什么是真正的恶作剧！',
			bad: '有点让老朽失望啊。',
			norm: '只有这种程度吗？',
			good: '嚯嚯嚯——不愧是老朽寄望的妖兽。',
			exgood: '这是值得狸猫来报恩的一顿款待呐！',
			lackmoneyangry: '老朽没有用叶子结账就已经很讲义气了！！！',
			lackmoneynormal: '叶子老朽倒是有很多，钱就只有这些了。',
			repell: '现在的妖怪怎么连敬老的美德都忘了。',
			seenRepell: '还是回去和狸猫们喝酒更有趣。',
		},
		spellCards: {
			positive: [
				{
					name: '「魔卡小狸十股变化」',
					description:
						'召唤若干狸猫，变化成就座顾客的样子（不包括揣藏本人），并重新加入到排队队列中。狸猫变化的顾客，喜好和预算与变化对象无异，但所有狸猫变化成的稀有顾客整晚只能释放一次变化对象的符卡。',
				},
			],
			negative: [
				{
					name: '「惩罚无良商家的最好办法」',
					description:
						'接下来的30秒内，收到的都是叶子变成的钱币，晚间结算时才会发现，这期间获得的金钱全部不会成为收入。',
				},
			],
		},
		positiveTagMapping: {
			12: '佐渡老家',
		},
		collection: false,
	},
	{
		id: 5012,
		name: '八云紫',
		description: [
			'创造了幻想乡的贤者之一，据说是幻想乡最古老的妖怪，虽然神出鬼没而且性格有点儿不近人情，但其实一直以来暗中维护着幻想乡的安全和稳定…虽然没有得到多数人的理解，但恐怕也没有像她一样真挚地对待幻想乡、爱着幻想乡的人了。',
			null,
			null,
		],
		dlc: 5,
		places: [0, 1, 3, 4, 1000, 1001, 2000, 2001, 3000, 3001, 4000, 4001, 5000, 5001],
		price: '4000-6000',
		positiveTags: [3, 4, 5, 20, 21, 24, 32],
		negativeTags: [9, 26],
		beverageTags: [1, 2, 5, 17],
		chat: ['久违地出来吃饭了呢…', '接下来可以睡个长觉了。', '一路走来真是辛苦你了。', '你的努力我都看在眼里。'],
		evaluation: {
			exbad: '这种东西连呆在隙间的资格都没有。',
			bad: '这种东西应该扔到隙间去。',
			norm: '似乎和我想象的有所出入。',
			good: '不错，难怪享有盛名。',
			exgood: '做得好！你值得拥有更多！',
			lackmoneyangry: '我不能允许幻想乡存在这种漫天要价的行为！',
			lackmoneynormal: '小麻雀的生意经做得稍微有点过头了哟。',
			repell: '要到隙间来谈谈吗？',
			seenRepell: '我期待的幻想乡并非这种模样。',
		},
		spellCards: {
			positive: [
				{
					name: '「人与妖的梦乡」',
					description:
						'在当日结束前触发时，冻结所有剩余时间大于44秒的Buff时间，使之不再减少，直至当日结束。再次触发或在当日结束后触发，所有剩余时间大于44秒的Buff时间增加当前剩余时长的10%（每种类型的Buff至多通过此符卡增加17秒）。',
				},
			],
			negative: [
				{
					name: '「现与隐的境界」',
					description:
						'在场上开启数个会变换位置的隙间，如果接近隙间，则会被吸入其中，然后随机传送到其他隙间处，同时托盘内的酒水会消失，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			20: '食之品相',
		},
		collection: false,
	},
] as const satisfies ICustomerRare[];
