/* eslint-disable sort-keys */
import type {ICustomerRare} from './types';
import {
	DARK_MATTER_NAME,
	TAG_ECONOMICAL,
	TAG_EXPENSIVE,
	TAG_LARGE_PARTITION,
	TAG_POPULAR_NEGATIVE,
	TAG_POPULAR_POSITIVE,
} from '@/data/constant';

export const CUSTOMER_RARE_LIST = [
	{
		id: 0,
		name: '莉格露',
		description: [
			'喜欢虫子的老友。虽然咱们已经认识了很久，但我还是受不了围在她身边的那群虫子。',
			'这家伙表面上是个萤火虫妖怪，其实是强大的上古虫族的末裔哦，所以才总摆出一副了不起的样子。',
			'我很了解她，虽然看起来脾气不太好，但其实是很为朋友着想的家伙！谁能想到，就是这么个小小的萤火虫，希冀着用自己的微末光芒，孤独又决然地照亮这衰败已久的一族呢？',
		],
		dlc: 0,
		places: ['妖怪兽道', '魔法森林', '太阳花田'],
		price: '200-400',
		positiveTags: ['肉', '甜', '生', '猎奇'],
		negativeTags: ['素', '清淡', '凉爽'],
		beverageTags: ['低酒精', '可加冰'],
		collection: true,
		spellCards: {
			positive: [
				{
					name: '灯符「荧光现象」',
					description: '顾客刷新时间减少30%，持续60秒。',
				},
			],
			negative: [
				{
					name: '蠢符「夜虫龙卷」',
					description: '将店内的顾客统统驱赶。',
				},
			],
		},
		positiveTagMapping: {},
	},
	{
		id: 1,
		name: '露米娅',
		description: [
			'喜欢黑暗的老友，总觉得她脑子空空的样子。但不得不说，和我很合得来。无论是第一点还是第二点。',
			'这家伙总是到处漂荡，我从来都不知道她在做什么。一段时间没见，就能从她口中听到些新鲜的词汇…她到底是去哪了呢？',
			'相识越久，越觉得自己对她的过去一无所知，就算问她，她也只会说不记得了。不过就算如此，我们也依然是好友，永远都会是好友。',
		],
		dlc: 0,
		places: ['妖怪兽道', '魔法森林'],
		price: '150-350',
		positiveTags: ['肉', '饱腹', '生', '招牌', '猎奇', TAG_POPULAR_POSITIVE],
		negativeTags: ['下酒', TAG_EXPENSIVE, TAG_POPULAR_NEGATIVE],
		beverageTags: ['苦', '气泡'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '月符「月光射线」',
					description: '随机获得图鉴中记录的三种肉类食材（如果图鉴中记录的肉类食材只有两种，则获得两种）。',
				},
			],
			negative: [
				{
					name: '暗符「境界线」',
					description: '在厨房放出黑雾，让你无法辨识哪些是厨具，哪些是食柜，黑雾持续20秒消失。',
				},
			],
		},
		positiveTagMapping: {
			生: '新鲜',
			招牌: '拿手好菜',
		},
	},
	{
		id: 2,
		name: '橙',
		description: [
			'与其说是凶兆的黑猫，不如说是凶巴巴的黑猫。',
			'老是脱口而出要监视我们什么的，就那么怕我们赖账吗？明明一直都很准时还债的啊！',
			'我说，这家伙果然有什么不可告人的目的吧？总觉得她在拙劣地隐瞒着什么…不过这孩子性格这么直，我能感受到她对我是没有恶意的！所以，不管她是不是真的隐瞒了什么，我都会对她一如既往的。',
		],
		dlc: 0,
		places: ['妖怪兽道'],
		price: '400-600',
		positiveTags: ['肉', '水产', '重油', '甜', '烧烤', TAG_POPULAR_POSITIVE],
		negativeTags: ['素', '灼热', '猎奇', TAG_POPULAR_NEGATIVE],
		beverageTags: ['水果', '辛'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '仙符「凤凰卵」',
					description: '随机获得三种鱼类食材，偶尔会出现高级货。',
				},
			],
			negative: [
				{
					name: '方符「奇门遁甲」',
					description: '减少顾客的出现率。',
				},
			],
		},
		positiveTagMapping: {
			水产: '猫吃鱼',
			烧烤: '肉串起来',
		},
	},
	{
		id: 3,
		name: '稗田阿求',
		description: [
			'人类村子中的名门望族，编撰《幻想乡缘起》的稗田家家主，是个了不起的大小姐。',
			'明明是才华横溢的大小姐，但是身体却很糟糕。即便拖着这样的身体，她也偶尔会来店里做客，真是让人又惊喜又担忧啊。',
			'虽然这位大小姐看起来是无可挑剔的优雅，但骨子里似乎透着一股倔强和任性呢。轮回转生吗…就算这样，现在的她，也确实是一个小孩子没错吧？',
		],
		dlc: 0,
		places: ['人间之里', '命莲寺'],
		price: '500-800',
		positiveTags: ['高级', '清淡', '和风', '甜', '文化底蕴', '汤羹', TAG_POPULAR_POSITIVE],
		negativeTags: ['重油', '咸', '灼热', TAG_POPULAR_NEGATIVE],
		beverageTags: ['可加热', '清酒'],
		collection: true,
		spellCards: {
			positive: [
				{
					name: '撰书「这也全部是妖精干的吗」',
					description: '获得一张签名色纸。',
				},
			],
			negative: [
				{
					name: '口授「黑心店家的黑心历史」',
					description: '店内气氛掉落到冰点，顾客也会降低心情。',
				},
			],
		},
		positiveTagMapping: {
			甜: '甜食不健康',
			高级: '稗田家主',
		},
	},
	{
		id: 4,
		name: '上白泽慧音',
		description: [
			'在人类村子开私塾的妖怪。哎呀，总觉得她与其说是妖怪，倒不如说更像是人类呢。',
			'明明是妖怪，却深受人类的信赖，收集了不少信仰心吧？在村民们的心中，她比巫女更可靠。听说还在村子里代理着巫女的工作。',
			'一边担忧着人类，一边担忧着妖怪，真是伟大啊，所谓贤者就是指这样的存在吧？她似乎有着另一个形态，一个我应该没有见过的形态，但却又隐约觉得自己见过。',
		],
		dlc: 0,
		places: ['人间之里', '魔法森林', '命莲寺'],
		price: '400-800',
		positiveTags: ['素', '家常', '清淡', '和风', '中华', '文化底蕴', TAG_POPULAR_POSITIVE],
		negativeTags: ['重油', '咸', TAG_LARGE_PARTITION, TAG_POPULAR_NEGATIVE],
		beverageTags: ['烧酒', '清酒', '利口酒'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '三种神器「剑」',
					description: '随机获得两种蔬菜类食材。',
				},
				{
					name: '三种神器「镜」',
					description: '料理不会消耗任何材料，持续15秒。',
				},
				{
					name: '三种神器「玉」',
					description: '随机解锁一名未完全解锁全部喜好的稀有顾客的一条信息。',
				},
				{
					name: '三种神器「乡」',
					description: '吸引大量居民前来就餐。',
				},
			],
			negative: [
				{
					name: '国符「秘笈头槌」',
					description: '眩晕20秒（上下左右乱打可以快速恢复）。',
				},
			],
		},
		positiveTagMapping: {},
	},
	{
		id: 5,
		name: '茨木华扇',
		description: [
			'一本正经的谜之仙人。总觉得她和一般的仙人哪里不太一样…不过我也没见过别的仙人就是了。',
			'仙人说话都是这样一板一眼吗？和她对话有种挨训的感觉…不过能让主食霞的仙人来自己的店里光顾，还是挺有成就感的。',
			'虽然有点儿啰嗦，但真是个热心的家伙，是不是有点儿像（有点儿严厉的）邻家姐姐的感觉呢？气质和一开始相比变了不少，该说是更柔和了吗？',
		],
		dlc: 0,
		places: ['人间之里', '旧地狱', '神灵庙'],
		price: '400-600',
		positiveTags: ['家常', '下酒', '和风', '文化底蕴'],
		negativeTags: ['生', '辣', TAG_ECONOMICAL],
		beverageTags: ['中酒精', '直饮', '古典'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '「猛兽的艺术用法」',
					description: '每隔一段时间，在场排队和就座的顾客，每人随机打赏1-30円。',
				},
			],
			negative: [
				{
					name: '「断恶修善的禁欲考验」',
					description: '顾客只会点最便宜的食物和绿茶，持续30秒。',
				},
			],
		},
		positiveTagMapping: {},
	},
	{
		id: 7,
		name: '博丽灵梦',
		description: [
			'贫穷且凶狠的巫女小姐…让人怀疑她真的是人类吗？总之，千万要小心不要惹她生气。',
			'灵梦小姐真是一点儿都不客气啊…不过，不知不觉也受了她不少照顾呢。开始有点儿明白为什么有那么多妖怪聚集在她身边了。',
			'所谓刀子嘴豆腐心，说的就是灵梦小姐这样的人吧。虽然看起来挺没心没肺的，但那双眼睛却总是能直视前方。博丽的巫女是灵梦小姐真是太好了。',
		],
		dlc: 0,
		places: ['博丽神社', '妖怪兽道', '人间之里', '魔法森林', '妖怪之山'],
		price: '150-300',
		positiveTags: ['高级', '饱腹', '甜', '不可思议', TAG_ECONOMICAL, TAG_POPULAR_POSITIVE],
		negativeTags: ['下酒', TAG_EXPENSIVE, TAG_POPULAR_NEGATIVE],
		beverageTags: ['无酒精', '低酒精', '可加热'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '梦符「二重结界」',
					description: '发动一次保护结界，可以完全防御下一位稀有顾客的惩罚符卡。',
				},
			],
			negative: [
				{
					name: '"灵符「梦想封印」',
					description: '封印你菜单上的三个料理，在接下来的30秒内无法被制作。',
				},
			],
		},
		positiveTagMapping: {
			高级: '便宜高级料理',
			不可思议: '符合我的称号',
			[TAG_ECONOMICAL]: '贵的买不起',
		},
	},
	{
		id: 8,
		name: '伊吹萃香',
		description: [
			'没想到现在的幻想乡居然还有鬼存在，第一次见到的时候真的吓了一跳！不过…她真的是鬼吗？',
			'毫无疑问，她就是鬼。虽然平时摆着一副小小的身姿和迷迷糊糊的模样，但言语间的气魄，有时会瞬间像一座山一样压下来。真不愧是传说中的山中王者啊。',
			'鬼虽然是很可怕的种族，但是一旦成为朋友，就是最值得信赖的伙伴！萃香小姐虽然总是醉醺醺的，但是心思清明着呢。那种豪情逸致，真让人向往啊。',
		],
		dlc: 0,
		places: ['博丽神社', '妖怪之山', '辉针城'],
		price: '600-800',
		positiveTags: ['肉', '下酒', '和风', '力量涌现', '小巧', TAG_POPULAR_POSITIVE],
		negativeTags: ['重油', TAG_POPULAR_NEGATIVE],
		beverageTags: ['高酒精', '直饮'],
		collection: true,
		spellCards: {
			positive: [
				{
					name: '酒吞奥义「鬼进酒」',
					description: '赠送一种酒水给你，偶尔会出现超高级货。',
				},
			],
			negative: [
				{
					name: '「百万鬼夜行」',
					description: '从你的酒柜里偷走三瓶最高级的酒。',
				},
			],
		},
		positiveTagMapping: {
			肉: '大口吃肉',
			下酒: '佐酒小菜',
			小巧: '分身多个',
		},
	},
	{
		id: 9,
		name: '比那名居天子',
		description: [
			'传说中气焰嚣张、目中无人的不良天人，如果可以的话，真不想招待这样的客人啊。',
			'我得为之前说过的话道歉，怎么能对客人生出不想招待的念头呢？就算她气焰嚣张、目中无人、口无遮拦、毫无常识、鼻子比天高，我都必须要好好招待她！尽量吧。',
			'其实，这家伙也不是那么讨厌啦。虽然嘴巴是坏了点儿（是很坏），但说不定…是个相当天真的家伙呢。似乎在天界过得不是很舒心，如果在地上能让她好好释放压力就好了。',
		],
		dlc: 0,
		places: ['博丽神社', '妖怪之山', '旧地狱', '神灵庙', '太阳花田'],
		price: '2000-3000',
		positiveTags: ['素', '传说', '清淡', '甜', '适合拍照', '果味', TAG_EXPENSIVE, TAG_POPULAR_NEGATIVE],
		negativeTags: ['肉', '家常', '重油', TAG_POPULAR_POSITIVE],
		beverageTags: ['高酒精', '鸡尾酒'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '「全人类的绯想天」',
					description: '使全部正在就餐的顾客的心情暴涨至85%。',
				},
			],
			negative: [
				{
					name: '「天罚的石柱」',
					description: '破坏桌椅，吓走桌面上的顾客，该桌椅在60秒内无法再被使用。',
				},
			],
		},
		positiveTagMapping: {
			清淡: '重油下等',
			适合拍照: '卖相要好',
			[TAG_EXPENSIVE]: '我不缺钱',
		},
	},
	{
		id: 10,
		name: '雾雨魔理沙',
		description: [
			'非常开朗健谈的人类魔法使，独自住在人烟罕至的魔法森林里修行，不管是人类、妖精还是妖怪都能轻松与之打成一片。对蘑菇似乎有很深刻的研究！',
			'虽然看起来无所事事，其实也经营着一家“雾雨魔法店”。因为她喜欢收集却从不整理的性格，这家店常常被误以为是垃圾回收站。客人可想而知也是没有的。',
			'虽然性格上有着心术不良的地方，但本性正直，和她一起的感觉很愉快！她从不愿让人看到她努力的样子，但我们都知道…这个自小就离家修行的小女孩，如果可以更多地依靠别人就好了。',
		],
		dlc: 1,
		places: [
			'魔法森林',
			'妖怪兽道',
			'人间之里',
			'博丽神社',
			'红魔馆',
			'迷途竹林',
			'妖怪之山',
			'旧地狱',
			'地灵殿',
			'命莲寺',
			'神灵庙',
			'太阳花田',
			'辉针城',
		],
		price: '3000-5000',
		positiveTags: ['传说', '重油', '和风', '灼热', '菌类', TAG_POPULAR_POSITIVE],
		negativeTags: ['猎奇', TAG_POPULAR_NEGATIVE],
		beverageTags: ['低酒精', '可加冰'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '流星「超级英仙座」',
					description: '随机获得三种菌类食材，偶然会出现高级货。',
				},
			],
			negative: [
				{
					name: '魔符「拿来吧你」',
					description: '随机偷走两样东西，可能是食材、料理或酒水。',
				},
			],
		},
		positiveTagMapping: {
			传说: '古老价值',
			重油: '麻辣烫/不要清淡',
			灼热: '八卦炉/发光发热',
		},
	},
	{
		id: 15,
		name: '红美铃',
		description: [
			'没想到给恶魔之家的看门的妖怪居然是个热血亲切的大姐！可惜爱睡觉，每次想去找她聊聊都看到她在打盹。',
			'美铃小姐独自守卫着这么大的洋馆，连个轮班的都没有，难怪会睡眠不足啦。要是在我力所能及的范围内，能帮到她一点点忙就好了。',
			'原来美铃小姐的家乡在海的另一边。但是幻想乡是没有海的，美铃小姐是不是已经回不去了？她的家乡有很多耳熟能详的名菜，我努力学习做给她吃，或许可以缓解一些她的思乡之情。',
		],
		dlc: 0,
		places: ['红魔馆'],
		price: '200-400',
		positiveTags: ['肉', '饱腹', '中华', '力量涌现', TAG_POPULAR_POSITIVE],
		negativeTags: ['西式', '猎奇', '果味', TAG_POPULAR_NEGATIVE],
		beverageTags: ['可加热', '古典', '提神'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '华符「芳华绚烂」',
					description: '每2秒提升1点店内气氛，且期间完成稀有顾客的订单后获得的好感度提高，持续30秒。',
				},
			],
			negative: [
				{
					// cSpell:ignore pOnda
					name: '「NOver say no to pOnda」',
					description: '将店内的顾客统统驱赶。',
				},
			],
		},
		positiveTagMapping: {
			中华: '家乡的味道',
		},
	},
	{
		id: 16,
		name: '琪露诺',
		description: [
			'自称最强的、长着冰之羽翼的妖精，那样的翅膀也能飞起来真是神奇啊。当然神奇的还有她的脑回路，老是做一些和大家相反的选择，总之别太深究她说的话就好了。',
			'虽然是冰之妖精，却是个热血的家伙！说不定她真的是最强的妖精，尤其是那股勇往直前的气势，真是见了棺材也不掉泪，撞了南墙也不回头。了不起了不起！',
			'我发现，和她在一起的时候，会不知不觉就被她的气势带走，这就是领袖的气质吗？！不过这种感觉很轻松，说不定我们很合拍呢！难道说我也是笨蛋吗？哈哈开玩笑啦。',
		],
		dlc: 0,
		places: ['红魔馆', '妖怪之山'],
		price: '100-200',
		positiveTags: ['甜', '适合拍照', '凉爽', '猎奇', TAG_POPULAR_NEGATIVE],
		negativeTags: ['下酒', '文化底蕴', TAG_EXPENSIVE, TAG_POPULAR_POSITIVE],
		beverageTags: ['可加冰', '水果', '甘'],
		collection: true,
		spellCards: {
			positive: [
				{
					name: '「甜美的冰霜小妖精」',
					description: '随机获得三种带有“可加冰”标签的平价酒水和2-5枚冰块。',
				},
			],
			negative: [
				{
					name: '冻符「完美冻结」',
					description:
						'随机冻住三只厨具，如果厨具中有正在制作或完成但还未拿走的料理，则会直接被冻碎，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			适合拍照: '丑拒',
			猎奇: '真正的勇士',
		},
	},
	{
		id: 27,
		name: '帕秋莉',
		description: [
			'总是穿着睡衣躲在树荫下的奇怪的魔法使。似乎不在意别人的眼光，对潮流什么的也不感兴趣。虽然头脑很好，不过看起来弱不禁风的样子。比起头脑好，身体好更重要啊。',
			'帕秋莉小姐总是手不离书，一直盯着书本看眼睛不会累吗？而且书上说的也不一定都是对的啊，像这样光读书不出门，就算知识渊博，常识却稍微有些不足呢。',
			'师傅原来身患贫血症和哮喘症，真是让人担心啊（我只在这里叫一下应该可以吧？）。虽然认识这么久，师傅对我的态度依然不太亲切，但却教了我不少知识，我可不能辜负她。',
		],
		dlc: 0,
		places: ['红魔馆', '魔法森林', '地灵殿'],
		price: '600-1000',
		positiveTags: ['高级', '西式', '甜', '适合拍照', '梦幻'],
		negativeTags: ['咸', '生', '灼热', '猎奇'],
		beverageTags: ['鸡尾酒', '利口酒', '气泡'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '知识的奇妙冒险「文化之风」',
					description: '给顾客上含有“文化底蕴”标签的料理，必然获得最高等级的评价，持续30秒。',
				},
			],
			negative: [
				{
					name: '金水符「水银之毒」',
					description: `接下来制作的料理，有50%的概率会变成${DARK_MATTER_NAME}，持续30秒。`,
				},
			],
		},
		positiveTagMapping: {
			西式: '文化差异',
			适合拍照: '卖相好',
		},
	},
	{
		id: 24,
		name: '藤原妹红',
		description: [
			'隐居在竹林里的不可思议的人类，欲望极低，对世间追逐的一切都没有兴趣。因为曾经吃了什么奇怪的东西而成为不老不死之身（不能乱吃东西啊）。',
			'妹红小姐真是帅气啊，虽然是人类，却强到没边，性格也很豪迈。据说爱吃辣的人性格都很爽快，妹红小姐可是无辣不欢呢。',
			'她比我想象中的要心思细腻，过去似乎经历了很多难以想象的苦难。即便如此，她仍然心存良善，一直暗中帮助别人。这样的她，一定会获得幸福的！',
		],
		dlc: 0,
		places: ['迷途竹林', '妖怪兽道'],
		price: '300-600',
		positiveTags: ['灼热', '果味', '烧烤', '燃起来了', '辣'],
		negativeTags: ['高级', '不可思议', TAG_EXPENSIVE],
		beverageTags: ['烧酒', '辛', '苦'],
		collection: true,
		spellCards: {
			positive: [
				{
					name: '不死「火鸟 凤翼天翔」',
					description: '所有厨具的料理速度加快50%，持续20秒。',
				},
			],
			negative: [
				{
					name: '藤原「灭罪寺院伤」',
					description: '无论提供多好的料理，最高只能获得顾客的普通评价，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			燃起来了: '不灭火焰',
		},
	},
	{
		id: 25,
		name: '蓬莱山辉夜',
		description: [
			'住在永远亭的公主殿下，据说来自月亮。放着好好的月之公主不做，跑到幻想乡来当家里蹲到底是为什么呢？',
			'外表看起来是气质优雅的公主殿下，实际行事却有些无赖…有点儿理解为什么她能成为那只黑兔子的主人了（黑形容的是心哦）。',
			'原来高贵的公主也会和普通人一样烦恼工作的事情。辉夜小姐和我也没什么不同嘛。作为工作了数载的前辈，我得好好为迷惘的后辈打气呢！',
		],
		dlc: 0,
		places: ['迷途竹林', '辉针城'],
		price: '1000-1500',
		positiveTags: ['传说', '和风', '文化底蕴', '不可思议', TAG_POPULAR_POSITIVE],
		negativeTags: ['招牌', '猎奇', TAG_LARGE_PARTITION, TAG_POPULAR_NEGATIVE],
		beverageTags: ['清酒', '古典', '现代'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '「永夜归返 世间开明」',
					description: '增加相当于现实时间30秒的营业时间。',
				},
			],
			negative: [
				{
					name: '神宝「蓬莱的玉枝 梦色之乡」',
					description: '减少相当于现实时间30秒的营业时间，到时间时会强行终止营业。',
				},
			],
		},
		positiveTagMapping: {
			和风: '大和抚子',
			文化底蕴: '地上历史',
		},
	},
	{
		id: 29,
		name: '因幡帝',
		description: [
			// cSpell:ignore PTSD
			'突然出现在店里的妖怪兔，总是坏笑着来找茬，只要她的耳朵出现在视线范围里，我的PTSD就犯了。',
			'虽然总是高价强卖我东西，而且还狡猾的打包卖什么的…但有些东西的确对我来说很有用。',
			'一直让灵梦小姐退治她也挺可怜的…总之要是经济宽裕的话，让她来店里也不是坏事，听说能看到她的话，就能获得一般人想象不到的幸运？',
		],
		dlc: 0,
		places: ['迷途竹林'],
		price: '200-400',
		positiveTags: ['传说', '甜', '凉爽', '小巧', '梦幻', TAG_POPULAR_POSITIVE],
		negativeTags: ['重油', '山珍', '猎奇', TAG_POPULAR_NEGATIVE],
		beverageTags: ['无酒精', '水果', '甘'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '生机「四十叶草般的幸运」',
					description: '所有食材采集点的冷却时间清零，且次日进行采集活动时，可以额外获得1-2份食材。',
				},
			],
			negative: [
				{
					name: '想起「那年的素兔的恐怖」',
					description:
						'再一次激活强买强卖功能，如果不买，将发动另一张符卡“恶作剧「Combo消失术」”。“恶作剧「Combo消失术」”：中断你的Combo，且在30秒内无法再获得Combo。',
				},
			],
		},
		positiveTagMapping: {
			小巧: '三分饱',
		},
	},
	{
		id: 1000,
		name: '河城荷取',
		description: [
			'如果说河童都是些唯利是图的商人，作为小头目的她更是其中的佼佼者！虽然说商人趋利也没什么好指责的，但是再多一点儿人情味不是也挺好吗？',
			'荷取小姐的头脑真是相当好啊，堪称是商业和技术的天才！一直以为河童性本趋利，可是她们却愿意在技术上一掷千金，我真是搞不懂她们了。',
			'能够抓住一切机会、将危机转化为商机的能力，真是让我叹为观止。在她身上学到的一切，值得我用一辈子去消化！',
		],
		dlc: 1,
		places: ['妖怪之山'],
		price: '400-500',
		positiveTags: ['水产', '高级', '下酒', '咸', '招牌', '猎奇'],
		negativeTags: ['素', '山珍', '文化底蕴'],
		beverageTags: ['中酒精', '高酒精', '清酒', '直饮'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '河童「延展手臂」',
					description: '伙伴可以通过“延展手臂”远程上菜上酒，持续120秒。',
				},
			],
			negative: [
				{
					name: '水符「山洪暴发」',
					description: '随机冲走3-5名顾客。',
				},
			],
		},
		positiveTagMapping: {
			高级: '上最好的',
			猎奇: '无法理解的口味',
		},
	},
	{
		id: 1001,
		name: '犬走椛',
		description: [
			'常常在妖怪山上巡逻的白狼天狗，嗅觉、听觉非常灵敏，被称为山上的千里眼，能迅速发现入侵者。正因为有这样的守卫在，我们这种小妖怪平时根本不敢上山。',
			'因为妖怪之山基本没什么侵入者，所以守卫的工作非常清闲。夜雀食堂开张以后，她对于工作之余多了个去处似乎非常高兴，面上虽然没怎么显露，但尾巴暴露了心情。',
			'性格原本也算是一板一眼的，熟悉以后经常能听到她那些毫无城府的牢骚，还时不时能看到她露出乖巧、呆萌的一面。比想象中的好应付啊…早知道这样，我就早点儿到山上来了！',
		],
		dlc: 1,
		places: ['妖怪之山'],
		price: '300-400',
		positiveTags: ['肉', '重油', '下酒', '山珍', TAG_LARGE_PARTITION],
		negativeTags: ['素', '清淡', '猎奇'],
		beverageTags: ['中酒精', '高酒精', '直饮'],
		collection: true,
		spellCards: {
			positive: [
				{
					name: '「天狗例行小酌」',
					description: '大量白狼天狗顾客上门，持续120秒。',
				},
			],
			negative: [
				{
					name: '「戒严令」',
					description: '禁止任何顾客前来，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			肉: '身为狼',
			重油: '不健康',
			[TAG_LARGE_PARTITION]: '多吃点',
		},
	},
	{
		id: 1005,
		name: '东风谷早苗',
		description: [
			'数年前与守矢神社一起突如其来的巫女。据说来自外界，和她一起来的还有两位神明…以及一座湖。这件事实在太离奇了，直到现在都感觉怪吓人的。',
			'和喜欢宅在屋里喝茶的博丽巫女不同，早苗小姐非常勤奋，随处都能看到她在努力收集信仰的身影。以人类之身来收集信仰真是了不起啊，似乎是什么现人神呢。',
			'博丽神社在幻想乡有着特殊的、绝对的地位，无论是守矢神社还是早苗小姐，想超越博丽之名都很艰难。不过，在早苗小姐的兢兢业业下，现在大家都记住了守矢巫女之名，真是太好了！',
		],
		dlc: 1,
		places: ['魔法森林', '妖怪之山', '命莲寺', '神灵庙'],
		price: '400-600',
		positiveTags: ['家常', '和风', '甜', '适合拍照', '梦幻', TAG_POPULAR_POSITIVE],
		negativeTags: ['重油', '生', '灼热', '猎奇', TAG_POPULAR_NEGATIVE],
		beverageTags: ['无酒精', '低酒精', '清酒', '直饮', '水果', '甘', '苦', '气泡', '现代'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '神德「五谷丰穰米之浴」',
					description: '生成三个酒水和三个食材。',
				},
			],
			negative: [
				{
					name: '奇迹「白昼新星」',
					description: '无法获得Buff，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			家常: '二神所在之地',
			和风: '大和民族',
			适合拍照: '手机',
			梦幻: '女孩子',
		},
	},
	{
		id: 1002,
		name: '爱丽丝',
		description: [
			'住在魔法森林的魔法使，有着金色的头发和白皙的皮肤，外貌精致得就像人偶一样。据说，她的家里也尽是些人偶。被她操纵的那些人偶栩栩如生，感觉还…蛮瘆人的。',
			'这些人偶真的是被操纵的吗？无论是谁见了都会有这样的疑问。虽然她看起来对别人漠不关心，但是待人接物却都非常周到，这就是所谓的都市派吗？',
			'想要走进她的心房真是不容易啊。她矜持而又好客，温柔而又疏离。她之所以制作这么多人偶，会不会是因为孤独呢？',
		],
		dlc: 1,
		places: ['魔法森林', '太阳花田'],
		price: '500-800',
		positiveTags: ['家常', '高级', '西式', '甜', '文化底蕴'],
		negativeTags: ['肉', '重油', '饱腹', '猎奇'],
		beverageTags: ['低酒精', '西洋酒', '现代'],
		collection: true,
		spellCards: {
			positive: [
				{
					name: '「和人偶一起玩的孩子」',
					description: '爱丽丝的人偶幻化为顾客，填充剩余的全部座位。',
				},
			],
			negative: [
				{
					name: '魔符「狡猾的献祭」',
					description: '炸飞一个厨具，持续60秒。',
				},
			],
		},
		positiveTagMapping: {
			高级: '低级趣味',
		},
	},
	{
		id: 1004,
		name: '矢田寺成美',
		description: [
			'原本是安置在魔法之森的地藏石像，因为森林的魔力而得到了生命——森林里居然蕴藏着能够将存在本身进行变化的魔力，难怪有那么多魔法使住在这，这对修行来说也太便利了！',
			'还以为地藏像会更稳重一点儿，结果也就是刚认识的时候会摆个架子，稍微见多几次面就把话匣子全打开了嘛。是个直率的女孩呢。',
			'好不容易成为了拥有自我的生命体，结果还是个家里蹲，这不是很可惜吗？！我一定要想办法让这家伙提起干劲！',
		],
		dlc: 1,
		places: ['魔法森林', '命莲寺'],
		price: '300-600',
		positiveTags: ['清淡', '山珍', '和风', '文化底蕴', '特产'],
		negativeTags: ['重油', '饱腹'],
		beverageTags: ['低酒精', '中酒精', '可加冰', '直饮', '古典'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '魔符「即席菩提」',
					description: '顾客在结账时，会额外支付50%的小费作为化缘，持续60秒。',
				},
			],
			negative: [
				{
					name: '地藏「业火救济」',
					description: '业火随机烧掉三个Buff纸张，其带来的效果也会随之失效。',
				},
			],
		},
		positiveTagMapping: {
			和风: '曾经土地唯一',
			特产: '想尝美食但懒',
		},
	},
	{
		id: 2000,
		name: '黑谷山女',
		description: [
			'在黑暗的风穴遇到的亲切的指路人。因为知道自己惹人讨厌所以几乎不会到村里去，明明那么可爱…真希望地上的大家也能认识她呢！',
			'山女小姐原来是类似地底偶像一样的存在呢！不愧是她。不过，和她那可爱的性格相对的是，她的爱好似乎异于常人。',
			'虽然一直被误会乃至成为“被厌恶者”，山女小姐也并不在意。我能感觉到，她确实深爱着这个地底世界。能有这样豁达的心境，真是了不起的境界啊。',
		],
		dlc: 2,
		places: ['旧地狱', '妖怪兽道', '红魔馆', '魔法森林', '妖怪之山'],
		price: '250-400',
		positiveTags: ['鲜', '甜', '生', '适合拍照', '猎奇', TAG_POPULAR_POSITIVE],
		negativeTags: ['重油', '咸', '灼热'],
		beverageTags: ['低酒精', '中酒精', '啤酒', '甘'],
		collection: true,
		spellCards: {
			positive: [
				{
					name: '「地下偶像狂欢夜」',
					description: '排队顾客会被偶像吸引，即使夜间营业结束也不会离去，持续30秒。',
				},
			],
			negative: [
				{
					name: '细索「犍陀多绳索」',
					description: '移动速度下降80%，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			生: '太熟吃不惯',
			猎奇: '蜘蛛的口味',
		},
	},
	{
		id: 2001,
		name: '水桥帕露西',
		description: [
			'原本以为她是个亲切开朗的妖怪，结果一转身就看到她在背地里说我坏话…以嫉妒为食的妖怪，不煽动别人的嫉妒心就会活不下去吗？感觉很可怜呐。不过她似乎不这么觉得。性格也阴晴不定，真是难以理解。',
			'桥姬既是桥的妖怪，也是桥的守护神。帕露西小姐其实在日复一日地守望着他人平安地从地上世界和地下世界往来…这么说来，她也是个很伟大的妖怪呢。',
			'我发现，帕露西小姐熟知所有人的优点！虽然大家都说帕露西小姐很善妒，但她的内心深处其实很憧憬大家吧？能够更进一步了解她真是太好了！',
		],
		dlc: 2,
		places: ['旧地狱'],
		price: '300-400',
		positiveTags: ['肉', '咸', '鲜', '果味', '辣', '酸', TAG_POPULAR_NEGATIVE],
		negativeTags: ['甜'],
		beverageTags: ['无酒精', '可加热', '直饮', '辛', '苦'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '「嫉妒与透支」',
					description: '将在座顾客的预算拉到和在座最富顾客同等的水准。',
				},
			],
			negative: [
				{
					name: '恨符「丑时参拜」',
					description: '当夜结算时收取翻倍佣金。',
				},
			],
		},
		positiveTagMapping: {
			咸: '眼泪的味道',
			辣: '愤怒的味道',
			酸: '妒意的味道',
		},
	},
	{
		id: 2002,
		name: '星熊勇仪',
		description: [
			'很久以前就离开了幻想乡、有着大姐头气魄的鬼，性格刚毅且干脆利落。如今在管理着旧地狱街道上的温泉。偶尔去泡一泡温泉吧！',
			'原来勇仪小姐曾经是山中四天王之一。传闻说她有异常程度的怪力，腕力即便在鬼之中也几乎无可匹敌。没想到我也能结识到这么厉害的妖怪…果然还是有点儿紧张啊。',
			'本来以为鬼已经对人类失去兴趣…但勇仪小姐其实在偷偷羡慕着在地上自由往来的同伴的身影。既然对地上感兴趣，那就去地上玩吧！鬼就该是这样嘛！',
		],
		dlc: 2,
		places: ['旧地狱', '博丽神社', '妖怪之山', '地灵殿'],
		price: '600-1000',
		positiveTags: [
			'传说',
			'下酒',
			'和风',
			'招牌',
			'力量涌现',
			'燃起来了',
			TAG_LARGE_PARTITION,
			TAG_POPULAR_POSITIVE,
		],
		negativeTags: ['素', '猎奇', '小巧'],
		beverageTags: ['高酒精', '清酒', '啤酒', '古典'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '「接着奏乐接着舞」',
					description:
						'将一定数量的酒水升级成更高一级的酒水。必定升级三杯1级酒水，有75%的概率升级两杯2级酒水，有50%的概率升级一杯3级酒水。',
				},
			],
			negative: [
				{
					name: '四天王奥义「三步必杀」',
					description:
						'生成三重警戒圈，限制你的移动，持续60秒；移动速度下降50%，直到离开范围；进入范围将被立即击晕30秒。',
				},
			],
		},
		positiveTagMapping: {
			燃起来了: '热血沸腾起来',
			[TAG_LARGE_PARTITION]: '饱餐一顿',
		},
	},
	{
		id: 2003,
		name: '古明地觉',
		description: [
			'传说中能够读心的觉妖怪，名字也是觉。大概是对自己的种族或能力很自豪吧？因为日以继夜都在工作，所以没什么搭话的机会。',
			'觉小姐真是我见过最操劳的领主了。虽然有宠物们帮忙干杂活，但是行政方面的工作似乎只有她能做。为了工作似乎放弃了很多日常爱好，唯独不能放弃读心。累到虚脱可不好啊。',
			'我明白为什么宠物们那么依恋觉小姐了。被繁重的工作埋没，心中还能一直牵挂着妹妹和宠物。在清冷的外表下的这份温柔，确实是会让人念念不忘呢。',
		],
		dlc: 2,
		places: ['地灵殿', '人间之里', '博丽神社', '红魔馆', '迷途竹林', '魔法森林'],
		price: '500-600',
		positiveTags: ['家常', '甜', '力量涌现', '小巧', '梦幻', '特产'],
		negativeTags: ['肉', '山珍', '灼热', '猎奇', TAG_LARGE_PARTITION],
		beverageTags: ['无酒精', '苦', '气泡', '提神'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '想起「高兴的事情」',
					description: '随机发动一名已解锁的稀有顾客（不包括自己）的奖励符卡。',
				},
			],
			negative: [
				{
					name: '想起「不高兴的事情」',
					description: '随机发动一名已解锁的稀有顾客（不包括自己）的惩罚符卡。',
				},
			],
		},
		positiveTagMapping: {
			小巧: '吃太饱不利于思考',
			特产: '缩短他乡与故乡的距离',
		},
	},
	{
		id: 2004,
		name: '火焰猫燐',
		description: [
			'被称作火车的猫妖，是地灵殿之主的左右手。能够和尸体和怨灵对话似乎很方便！不过…说到火车就是偷尸体啊。就是因为这样所以被厌恶吧？唔唔，对别人的兴趣说三道四似乎不太好。',
			'仔细想想，人类刚死掉的时候，应该会茫然吧？如果能在猝然长辞之际遇到开朗善谈的阿燐，或许能中和一些对死亡的恐惧。',
			'活在偏见下的“凶兆的黑猫”，原来要经历那么艰辛的事。偏见真是不可取啊。幸好阿燐遇到了觉小姐。一个好的主人可以改变宠物的一生。希望阿燐今后可以一直过着无忧无虑地偷尸体的生活。',
		],
		dlc: 2,
		places: ['地灵殿', '人间之里', '博丽神社', '妖怪之山', '旧地狱', '命莲寺', '神灵庙'],
		price: '500-700',
		positiveTags: ['水产', '海味', '鲜', '甜', '猎奇', '梦幻', TAG_POPULAR_POSITIVE],
		negativeTags: ['生', '灼热'],
		beverageTags: ['低酒精', '清酒', '水果'],
		collection: true,
		spellCards: {
			positive: [
				{
					name: '猫符「猫醉步」',
					description: '给顾客上含有“中酒精”标签的酒水，必然获得最高等级的评价，持续30秒。',
				},
			],
			negative: [
				{
					name: '「死灰复燃」',
					description:
						'阿燐在离去时，将会在原先座位上留下一只地底怨灵，继续以阿燐的兴趣爱好点单，地底怨灵无法被主动驱赶，也不会付款，只有按照正常流程进行满足才会主动消失。',
				},
			],
		},
		positiveTagMapping: {
			海味: '地底海底相连',
		},
	},
	{
		id: 2005,
		name: '灵乌路空',
		description: [
			'看守灼热地狱遗址的地狱鸦，有着火焰般热烈爽快的性格。外表看起来和其他地狱鸦不太一样，唯独脑袋空空这一点让我感到很亲切。',
			'阿空的外表之所以大放异彩，原来是因为她的体内寄宿了神灵八咫乌！自地狱的黑暗诞生而来的地狱鸦，和栖息于太阳的八咫乌，真是奇妙的组合啊！不过…让她拥有这么强大的力量真的没问题吗？',
			'最近突然觉得，没有比阿空更适合拥有这种力量的人选了。拥有异常强大的力量，却没有使用这种力量的头脑，这就是一种幸运吧？脑袋空空的阿空很可爱哦！不过我也常被说脑袋空空呢。',
		],
		dlc: 2,
		places: ['地灵殿', '妖怪之山'],
		price: '500-800',
		positiveTags: ['肉', '重油', '咸', '灼热', '力量涌现', '辣'],
		negativeTags: ['清淡', '菌类'],
		beverageTags: ['中酒精', '可加热', '鸡尾酒'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '「地狱的托卡马克装置」',
					description: '煮锅和蒸锅能瞬间完成料理，持续60秒。',
				},
			],
			negative: [
				{
					name: '狱光「扩散地狱火」',
					description:
						'下一次料理时没有成功完美演唱会使厨具炸毁，当晚无法使用，部分排队的顾客也会被吓得抱头鼠窜。',
				},
			],
		},
		positiveTagMapping: {},
	},
	{
		id: 3000,
		name: '多多良小伞',
		description: [
			'寄宿在怪异唐伞上的灵，因为一直没有人使用，不知不觉就付丧神化了。是个只要见到别人被吓了一跳，就会快乐得手舞足蹈的家伙。',
			'这家伙的性格好麻烦啊！本来以为是个开朗亲切的妖怪，结果动不动就哭鼻子…我拿这种家伙最没办法啦！好在她总是很快就能振作起来！',
			'尽管偶尔会露出悲观的一面，但她内心深处却是个爽朗坚毅的妖怪。虽然总是遭遇挫折，却总是花样层出地努力着呢。这份能量，希望我也可以拥有！',
		],
		dlc: 3,
		places: ['命莲寺', '辉针城'],
		price: '150-300',
		positiveTags: ['家常', '饱腹', '甜', '适合拍照', '力量涌现', '猎奇', '不可思议', TAG_POPULAR_POSITIVE],
		negativeTags: ['灼热', '汤羹', '辣'],
		beverageTags: ['中酒精', '可加冰', '水果', '古典'],
		collection: true,
		spellCards: {
			positive: [
				{
					name: '雨符「雨夜怪谈」',
					description: '带有“猎奇”标签的食物制作速度提高30%，且额外提供30%续单率，持续30秒。',
				},
			],
			negative: [
				{
					name: '「超级巨幻影唐伞」',
					description: '排队中的普通顾客被吓跑。',
				},
			],
		},
		positiveTagMapping: {
			饱腹: '肚子总是空空',
			适合拍照: '好看的食物',
			猎奇: '让人吓一跳',
		},
	},
	{
		id: 3001,
		name: '村纱水蜜',
		description: [
			'居然让醉心于让船沉没的妖怪来担任圣辇船的船长，命莲寺真是从里到外都让人无法理解。这家伙能在任何水面引发水难事故，以后得更加注意厨房积水！',
			'虽然拜入佛门已经有千年之久，却还是一点儿佛门弟子的自觉都没有。过去在海上胡作非为惯了，至今仍瞒着住持到处恶作剧。不过对命莲寺不利的事，她是绝对不会做的。',
			'恣性洒脱的船长，甘愿成为佛门弟子，受佛门管束（其实也不太管得住），只为报答千年前的恩情。果然不能以貌取人呀。村纱小姐她，有着一颗有情有义的金子般的心呢。',
		],
		dlc: 3,
		places: ['命莲寺'],
		price: '400-600',
		positiveTags: ['肉', '高级', '饱腹', '咸', '鲜', '力量涌现', '特产'],
		negativeTags: ['素', '猎奇', '小巧', '酸'],
		beverageTags: ['高酒精', '可加冰', '西洋酒', '辛'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '「船灵流连不散」',
					description:
						'获得“船幽灵附身”状态，持续15秒。拥有此状态时所获得的其他奖励符卡（不包括此符卡），都将延长有效时间，延长的长度等于获得新符卡时，本符卡的剩余时间。',
				},
			],
			negative: [
				{
					name: '溺符「深海漩涡」',
					description:
						'无法行动（可通过上下左右摇杆减少时间），持续5秒。之后的20秒内，上下左右移动方向相反。',
				},
			],
		},
		positiveTagMapping: {
			高级: '混到船长地位',
			饱腹: '连船舵都转不动',
			鲜: '保质期一小时',
			特产: '食物的相逢',
		},
	},
	{
		id: 3002,
		name: '封兽鵺',
		description: [
			'古老的真相不明的妖怪——鵺。长得和传说完全不一样真可惜…虽然也是命莲寺的弟子，但总是见到她独自在寺院附近无所事事地游荡，似乎不太合群的样子。',
			'她就像是被忽视、通过恶作剧来吸引大家注意力的别扭的孩子。内心希望融入寺中，却笨挫地不知道该怎么表达…明明活了这么久，还是不谙世故呢。',
			'越是在意就越容易畏缩…结果她的内心就和她的形象一样无法被人看清，这难道就是“无法明状之物”的寂寞吗？但她如今已经展露出自己的真相，大家以后也一定会慢慢理解她的率真的！',
		],
		dlc: 3,
		places: ['命莲寺', '辉针城'],
		price: '300-500',
		positiveTags: ['肉', '鲜', '生', '招牌', '适合拍照', '猎奇', '不可思议', '特产', TAG_POPULAR_NEGATIVE],
		negativeTags: ['西式', '酸', TAG_POPULAR_POSITIVE],
		beverageTags: ['可加热', '烧酒', '直饮', '古典'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '开心「东方红绿蓝」',
					description:
						'开动飞碟转盘，必然中奖，结果为以下四种情况中的一种：红红红：无论上什么菜都必然获得最高等级的评价，持续15秒；绿绿绿：食材和酒水不会被消耗，持续15秒；蓝蓝蓝：收入提高100%，持续15秒；红绿蓝：同时获得以上三种Buff。',
				},
			],
			negative: [
				{
					name: '恶心「东方红红蓝」',
					description:
						'开动飞碟转盘，必然Miss，结果为以下四种情况中的一种：红红绿：无论上什么菜都必然获得极度不满的评价，持续15秒；绿绿〇：食材和酒水消耗量提高到三倍，持续15秒；蓝蓝〇：收入减少66%，持续15秒；红红蓝：同时获得以上三种buff。',
				},
			],
		},
		positiveTagMapping: {
			鲜: '腐肉吃得够多了',
			适合拍照: '对我拍个不停',
		},
	},
	{
		id: 3003,
		name: '物部布都',
		description: [
			'通过长时间自己诅咒自己从而沉眠的古代人。大概是睡了太久，思考方式也跟古时候一样，和普通人完全脱节…目前在努力学习现代知识，结果来说变得更加不伦不类了。',
			'如果不提她那套落伍的作风，其实她也蛮有仙人那种风格，尤其对风水什么的似乎很有研究。我是搞不懂啦…要不下次装修的时候请她帮忙看看好了。',
			'无法完全割舍过去，就说明对过去还留有怀念吧？尽管这样，布都小姐还是毅然决然地成为尸解仙的实验品。我虽然无法理解人类的这份忠心，但也感到非常敬佩！',
		],
		dlc: 3,
		places: ['神灵庙'],
		price: '600-900',
		positiveTags: ['高级', '传说', '清淡', '山珍', '和风', '燃起来了', TAG_POPULAR_POSITIVE],
		negativeTags: ['西式', '生', TAG_POPULAR_NEGATIVE],
		beverageTags: ['中酒精', '可加热', '直饮', '气泡'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '圣童女「太阳神的贡品」',
					description:
						'根据顾客评价获得酒水奖励，“普通”评价获得1级酒水，“满意”评价获得2级酒水，“完美”评价获得3级酒水，持续10秒。',
				},
			],
			negative: [
				{
					name: '传薪「浴火捏盘」',
					description: '只能使用一个托盘进行服务，被禁用托盘内的还未拿走的物品会被焚毁，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			和风: '吾之时代',
			燃起来了: '内心燃烧',
		},
	},
	{
		id: 3004,
		name: '霍青娥',
		description: [
			'经常见到她在神庙附近晃荡嬉玩的样子，似乎对修行不太热心…但又十分热衷于向别人传达修道的好处。实在搞不明白她到底在想什么。是个看起来很正统，行为和思想却很另类的仙人。',
			'想要做成一件事就会不计后果地去达成，就算自己的行为不被人理解，她也会摆出一副理所当然的态度。要说她是被欲望驱使，又觉得恰恰相反…她所做的那些事，与其说是为了欲望，或许只是单纯的性格使然。',
			'邪仙不一定就是邪恶的仙人。仅仅由于思考和行动都不够妥当就被断绝天人之路，确实是让我有些费解…我只知道青娥小姐非常有个性！如果成为天人就要泯灭个性，那我希望青娥小姐还是一直保持这个样子比较好。',
		],
		dlc: 3,
		places: ['神灵庙'],
		price: '400-900',
		positiveTags: ['素', '传说', '中华', '甜', '不可思议', '小巧', '特产', TAG_POPULAR_POSITIVE],
		negativeTags: ['重油', '饱腹'],
		beverageTags: ['低酒精', '清酒', '水果', '现代'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '邪术「天下无墙」',
					description: '伙伴在食堂区域移动时可以穿过顾客或障碍物，持续30秒。',
				},
			],
			negative: [
				{
					name: '入魔「走火入魔」',
					description:
						'稀有顾客每次结账，无论评价高低，都有30%的概率放一次惩罚符卡。如果是本来就会放惩罚符卡的情况，则多放一次。持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			素: '满嘴荤腥',
			中华: '我的家乡',
			小巧: '宵夜宜少',
			特产: '各地美食',
		},
	},
	{
		id: 3005,
		name: '苏我屠自古',
		description: [
			'古代人的亡灵。过去似乎怀有很深的怨恨，所以性质上是妖怪们最害怕的怨灵。有点儿不太敢接触她呢。',
			'实际接触后，发现屠自古小姐的性格确实是直爽又豁达，还充满活力。一点儿也不像是怨灵呢。大概是怨恨已经消散得差不多了吧？能让心胸豁达的屠自古小姐变成怨灵，一定是相当痛苦的事情。',
			'没想到没想到，让屠自古小姐变成怨灵的元凶竟然是布都小姐！可她们两人的感情还是很要好的样子？！屠自古小姐的心胸何止是豁达的程度，她大概离成佛只有一步之遥了。',
		],
		dlc: 3,
		places: ['神灵庙'],
		price: '500-600',
		positiveTags: ['家常', '重油', '饱腹', '和风', '招牌', '力量涌现', '烧烤'],
		negativeTags: ['甜', '凉爽'],
		beverageTags: ['高酒精', '烧酒', '啤酒', '苦'],
		collection: true,
		spellCards: {
			positive: [
				{
					name: '雷影「电光石火」',
					description: '自己和伙伴的移动速度提升30%，持续30秒。',
				},
			],
			negative: [
				{
					name: '天罚「天雷暴击」',
					description: '下一次没有成功完美演唱的料理，将会引来天雷，击晕一位伙伴30秒。',
				},
			],
		},
		positiveTagMapping: {
			家常: '孤独守护千年',
			重油: '成为亡灵之后都能吃',
			饱腹: '就用肚子来装',
			和风: '过去吃过的',
			烧烤: '被雷劈过一样',
		},
	},
	{
		id: 4000,
		name: '射命丸文',
		description: [
			'每天在幻想乡各处奔走，收集题材来写成新闻的鸦天狗。也是大名鼎鼎的《文文。新闻》的作者。之所以说大名鼎鼎，并不是这个报纸有多出色，而是派发得实在太多了。',
			'本来就很强的她，再加上有新闻这种强力的武器，导致文文小姐在幻想乡里经常不被待见。不过看着如此拼命工作的她，感觉也会受到鼓舞呢。如果她的新闻能少些胡扯就好了。',
			'报纸真的是非常伟大的东西！文文小姐创作的报刊，记录了幻想乡的过去，虽然稍微有些失真的地方…但也还是有值得回忆的地方！希望文文小姐最终能够找到适合她的新闻风格。',
		],
		dlc: 4,
		places: [
			'太阳花田',
			'妖怪兽道',
			'人间之里',
			'博丽神社',
			'红魔馆',
			'迷途竹林',
			'魔法森林',
			'妖怪之山',
			'旧地狱',
			'地灵殿',
			'命莲寺',
			'神灵庙',
			'辉针城',
		],
		price: '500-600',
		positiveTags: ['肉', '家常', '下酒', '和风', '招牌', '适合拍照', TAG_POPULAR_POSITIVE],
		negativeTags: ['西式', TAG_POPULAR_NEGATIVE],
		beverageTags: ['高酒精', '可加冰', '烧酒', '提神'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '「八衢潮流风靡幻想」',
					description: `明天开始店铺变为“明星店”，三天后恢复正常。“明星店”：提高10%顾客预算和5%客流量，“招牌”标签成为流行标签。如果店铺已是“明星店”或当晚已宣传，则此符卡转化为“「食堂风起厨神无双」”。“「食堂风起厨神无双」”：成品带有“招牌”标签的今日菜单上的料理将成为明星料理。制作明星料理时，如果料理时间小于5秒，则瞬间完成；在舆论的裹挟下，追捧“${TAG_POPULAR_POSITIVE}”标签的顾客食用明星料理后额外提高30%续单率，返还当单酒水消耗的预算，并必定增加一次续单上限（增加续单上限效果每桌顾客只触发一次），持续30秒。`,
				},
			],
			negative: [
				{
					name: '「笔枪纸弹禁制之道」',
					description:
						'无法进行投掷上菜，持续30秒。同时在报纸上对黑心店铺进行抨击，使“明星店”加成明天起消失，并使伙伴【拉尔瓦】在场上播撒的催眠粉消失。',
				},
			],
		},
		positiveTagMapping: {
			适合拍照: '入我相机',
		},
	},
	{
		id: 4001,
		name: '梅蒂欣',
		description: [
			'独居在剧毒的铃兰田野的付丧神，因为才出生不久，所以经验和知识都严重地不足，也不懂得该怎么和人相处。总在偌大的铃兰田野里自言自语甚至手舞足蹈的样子，可爱中透着一些诡异…性格倒是直来直往。',
			'虽然成为了妖怪，但身体似乎还是人偶的样子。所以就算体内充盈了毒也不会感到任何不适。对人类的友好度很低，以前还会在食物里下毒来操纵人类…因为太年轻下手不懂得区分轻重，在她的心志成长起来以前，一定要特别注意！',
			'谁能想到毒人偶其实是这么单纯的孩子呢？你教给她什么，她就会吸收什么。看着新生妖怪一点点地成长起来原来是这种感觉！因为我自己也很年轻，所以很少有作为前辈的经历。现在我想为这个孩子保驾护航，让她幸福地成长…虽然我可能还没有她强。',
		],
		dlc: 4,
		places: ['太阳花田'],
		price: '200-400',
		positiveTags: ['甜', '招牌', '适合拍照', '凉爽', '菌类', '小巧', '梦幻', '毒'],
		negativeTags: ['文化底蕴'],
		beverageTags: ['无酒精', '水果', '甘', '苦'],
		collection: true,
		spellCards: {
			positive: [
				{
					name: '分解「剧毒中和」',
					description:
						'移除“铃兰「凋零花园」”状态；梅蒂欣操纵料理中可能存在的有害元素，使料理时的标签不再产生冲突，持续30秒，并获得带有“中酒精”标签的酒水一瓶。同时，可使【帕秋莉】的惩罚符卡失效。',
				},
			],
			negative: [
				{
					name: '铃兰「凋零花园」',
					description:
						'移除“分解「剧毒中和」”状态；制作料理时铃铃会额外为料理追加特殊的“忧郁之毒”标签，食用带有该标签的食物的顾客不会续单，持续30秒。此效果可被酒水【牛奶】解除。',
				},
			],
		},
		positiveTagMapping: {
			甜: '毒的基础是甜',
			凉爽: '不能受热',
			菌类: '森林里疯长的',
			梦幻: '故意中毒',
		},
	},
	{
		id: 4002,
		name: '风见幽香',
		description: [
			'虽然看起来是一副高雅的淑女形象，但不知道为什么，很多人将她视作“花之暴君”。虽然恐怖的传说满天飞，但大家其实都没有见过她欺负人类或者弱小妖怪。真实的她，究竟是一位怎样的人呢？',
			'只要见过她照顾花儿的样子，那些有关她的谣言就会不攻自破。但我还是不明白，她有那么强大的妖力，为什么会容忍谣言满天飞，为什么要默默地承受那些恶意中伤呢？',
			'大错特错！她从来都没有“忍受”过那些谣言，因为她根本就不在乎。于是连澄清都变得多此一举。幽香小姐最为强大之处，正是她的心。我想，并不是强大的妖力让她睥睨众人，真正让她立于不败之地的，是她纯粹又干净的自我。',
		],
		dlc: 4,
		places: ['太阳花田'],
		price: '1200-1800',
		positiveTags: ['高级', '传说', '清淡', '西式', '不可思议', '梦幻', '特产', TAG_POPULAR_POSITIVE],
		negativeTags: ['饱腹', '和风', '咸', '灼热'],
		beverageTags: ['鸡尾酒', '西洋酒', '利口酒', '现代'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '「花鸟风月群芳沐」',
					description:
						'在场上种下一朵鲜花并利用能力使其生长，满心情时额外种下一朵，每朵生长的鲜花每24秒生产25小费。除幽香以外的稀有顾客释放奖励符卡时，随机一朵生长的鲜花将吸收符卡之力而盛放，吸引当地出没的稀有顾客造访食堂，被鲜花吸引来的稀有顾客会摘走这朵鲜花。鲜花盛放期间顾客用餐结束后额外提高15心情，15秒后鲜花凋谢，获得一层“「落英缀裳」”。“「落英缀裳」”：可以抵挡一次中断Combo的失误。',
				},
			],
			negative: [
				{
					name: '「决斗Spark!!!」',
					description:
						'用微笑的表情走到自己所在座位那一排的最上方，然后一发魔炮将这排桌子轰飞，当夜不可修复，并吓跑所有在这些位置用餐的顾客。',
				},
			],
		},
		positiveTagMapping: {
			传说: '流传至今的过去',
			清淡: '不要油手碰花',
			西式: '绅士风度',
			不可思议: '冬紫罗兰',
			梦幻: '蓝色满天星',
		},
	},
	{
		id: 4004,
		name: '少名针妙丸',
		description: [
			'非常崇拜一寸法师的小人族的城主，性格克制认真，是一个有着英雄梦的勇者厨。向往冒险的深闺公主还真是新鲜呢。擅长和菓子这一点和气质很相衬！',
			'明明很向往勇者的冒险，也做了非常多的准备，但是却迟迟没有踏上旅程。对于能否留下完美的传说这件事非常在意。会不会有些在意过头了。',
			'终于解开心结的针妙丸小姐勇敢地踏上了道路，而那些“凭着一股勇气就可以拯救世界”的故事就是她的精神道标。从她身上我也明白到，太在意结果就会寸步难行，果然还是随心而动比较适合我！',
		],
		dlc: 4,
		places: ['辉针城'],
		price: '600-1200',
		positiveTags: ['传说', '和风', '甜', '适合拍照', '文化底蕴', '小巧', '燃起来了', TAG_POPULAR_POSITIVE],
		negativeTags: ['西式', TAG_LARGE_PARTITION],
		beverageTags: ['低酒精', '可加热', '气泡', '古典'],
		collection: true,
		spellCards: {
			positive: [
				{
					name: '宝槌「通货膨胀危机」',
					description:
						'使用万宝槌敲击收银台，叠加一层“万宝槌之力”。万宝槌充盈的魔力将在营业结束时使营业额膨胀，第一层“万宝槌之力”使收入提高7%，之后每层使收入提高2%。同时，充盈的万宝槌之力使伙伴【赤蛮奇】分裂出的辘轳首产生暴走，移动速度提高200%。',
				},
			],
			negative: [
				{
					name: '小槌「你给我变大吧!」',
					description: '身体将会被放大到原先的三倍，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			传说: '充满勇气的故事',
			和风: '小人的祖先',
			适合拍照: '和别人分享',
			小巧: '看我的样子',
		},
	},
	{
		id: 4003,
		name: '鬼人正邪',
		description: [
			'擅长花言巧语的天邪鬼。打着要颠倒幻想乡的口号，蛊惑了许多年轻气盛的妖怪甚至人类来当手下，但却因为资金不足无法善待他们，甚至找天狗刊登广告骗游客来收取过路费…无论怎么看，都是个乱来的家伙。',
			'正邪小姐真的想下克上吗？感觉她对造反成功之后的事情并没什么兴趣。或许她只是从和社会作对汲取乐趣，并不是真的想改变这个社会。',
			'看着同伴一个接一个的离开，一般人多少都会觉得此路不通吧？但是正邪小姐完全没有想过放弃。在如今人人都悠闲地过着普通日子的幻想乡中，她是少有的不达目的绝不罢休的那一类。从某种程度来说，还蛮让我敬佩的。',
		],
		dlc: 4,
		places: ['辉针城'],
		price: '300-600',
		positiveTags: ['重油', '下酒', '灼热', '力量涌现', '猎奇', '不可思议', '燃起来了', TAG_POPULAR_NEGATIVE],
		negativeTags: ['高级', TAG_POPULAR_POSITIVE],
		beverageTags: ['中酒精', '烧酒', '直饮', '辛'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '欺符「超限效应」',
					description:
						'令全场除自身以外的顾客的厌恶标签反转为喜好标签，持续30秒。当场上包括排队顾客在内的普通顾客数量之和不少于7时，此符卡转化为“逆弓「天壤梦弓的诏敕」”。“逆弓「天壤梦弓的诏敕」”：使场上包括排队顾客在内的普通顾客额外获得一次续单上限和25%预算，每位普通顾客最多可以受到此效果影响三次。',
				},
			],
			negative: [
				{
					name: '逆转「颠倒世界」',
					description:
						'将自身的预算和全场最高预算水平的顾客预算翻转，并在接下来的15秒内持续将除自己以外的所有顾客的预算降低到全场最低预算顾客水平。',
				},
			],
		},
		positiveTagMapping: {
			灼热: '滋滋冒气',
			不可思议: '不可能实现',
			燃起来了: '弱者颠覆强者',
		},
	},
	{
		id: 4005,
		name: '今泉影狼',
		description: [
			'稳重温婉的狼女，给人一种亲切的邻家大姐姐的感觉。不知是不是因为月人在竹林里住下的缘故，那里和月亮相关的妖怪似乎很多，影狼小姐也是其中一员。',
			'影狼小姐似乎很在意皮肤，这么爱美的狼人还真是第一次见呢。草根妖怪的日常真是平和又热闹。偶尔忍不住也会想…如果我不开店，大概也在过着这样的生活吧。',
			'影狼小姐作为狼的部分，是在外面世界已经绝种的本州狼。一度被敬仰、被崇拜，最后却落得灭绝下场真可怜。幻想乡的人类和妖怪要多多爱护我们兽（禽）类呀！',
		],
		dlc: 4,
		places: ['迷途竹林', '辉针城'],
		price: '300-600',
		positiveTags: ['肉', '家常', '山珍', '和风', '适合拍照', '凉爽', TAG_POPULAR_POSITIVE],
		negativeTags: ['灼热'],
		beverageTags: ['中酒精', '可加冰', '清酒', '直饮'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '狼魂「野性觉醒」',
					description:
						'接下来的30秒内，顾客会爱上“肉”和“山珍”标签，在对料理评分时作为自身的喜好进行评价，原本喜好这些标签的顾客食用相关料理时必然触发最高评价。',
				},
			],
			negative: [
				{
					name: '饿狼「暴食的月下舞踏」',
					description:
						'接下来的30秒内，所有顾客的料理如果没有添加“饱腹”标签，会触发最差评价，原本厌恶“饱腹”标签的顾客食用相关料理时必然触发最差评价。',
				},
			],
		},
		positiveTagMapping: {
			肉: '人家是狼',
			和风: '本州狼',
			凉爽: '从胃里降温',
		},
	},
	{
		id: 5000,
		name: '铃仙',
		description: [
			'似乎因为我来自地上，所以对我很亲切的月之使者，和永远亭的铃仙小姐有着一样的名字。偶尔会表现出对地上的向往，不知道是不是过去发生了什么…也可能是因为月之使者的训练太辛苦了吧。',
			'原来铃仙曾经是一只捣药兔，因为厌烦无休止的捣药逃到幻想乡而发生了许多事，所以才成为一名月之使者。难怪她会对地上表现出眷恋。不过她似乎也不喜欢月之使者的工作，感觉她从内到外都过得好辛苦啊。',
			'一直活在后悔中是一种怎样的心情呢？如果时间可以重来，她就不会从捣药的工作中逃走了吗？那样她就会感到幸福吗？这些问题我都没能问出口…不过，与其徘徊在过去，还是向前看比较好吧？希望她有朝一日能得到真正的自由。',
		],
		dlc: 5,
		places: ['月之都'],
		price: '200-350',
		positiveTags: ['家常', '山珍', '海味', '中华', '甜', '小巧', '特产'],
		negativeTags: ['不可思议', TAG_EXPENSIVE],
		beverageTags: ['高酒精', '可加热', '烧酒', '啤酒', '苦'],
		collection: true,
		spellCards: {
			positive: [
				{
					name: '「月免的篝火盛宴」',
					description:
						'召开一场盛大的篝火盛宴，场上每只存在的兔子生成一个随机食材或一瓶随机酒水，接下来30秒内出现新的兔子时会同样生成食材或酒水。生成食材的概率为80%，生成酒水的概率为20%。',
				},
			],
			negative: [
				{
					name: '「酒醉迷乱」',
					description:
						'铃仙向场上打出一颗狂气之弹，影响场上的顾客，持续30秒。受到狂气影响的顾客食用不带有“高酒精”标签的酒水必定给出最低评价。',
				},
			],
		},
		positiveTagMapping: {
			山珍: '月都如果有山',
			海味: '静海不那么死气沉沉',
			中华: '月兔也是仙子',
			小巧: '兔子的胃很小',
			特产: '无法抵达的地方',
		},
	},
	{
		id: 5001,
		name: '绵月丰姬',
		description: [
			'绵月家的姐姐。性格和蔼温柔，偶尔会露出孩子气的一面。除了偶尔会在月之使者训练时给兔子们带小点心，几乎没有参与月之使者的训练，因此很受月兔的喜爱。',
			'丰姬小姐真是相当——相当喜欢桃子，以及相当——相当优哉游哉。像她这么强大的人，真的可以这样什么都不用操心吗？无论在什么环境下都能活得这么天真，这应该也算是一种能力吧？',
			'原来丰姬小姐心里也有想要完成的事呢。她是从什么时候开始产生想要隐退的想法呢？或许从一开始，她就只是被迫继承月之使者首领的工作吧。至今没有隐退，一来是没有合适的继任者，二来…恐怕还是为了依姬小姐吧？',
		],
		dlc: 5,
		places: ['月之都'],
		price: '1200-1500',
		positiveTags: ['素', '高级', '和风', '甜', '凉爽', '文化底蕴', '果味', TAG_POPULAR_POSITIVE],
		negativeTags: ['山珍', '咸', '力量涌现'],
		beverageTags: ['高酒精', '可加冰', '清酒', '水果', '古典'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '方圆「山海千重」',
					description:
						'丰姬连接海和山，链接幻想乡的一个地点，使该区域的普通顾客和稀有顾客可以穿越“面”前来。通过丰姬的能力链接的地区刷新效果分别独立，刷新速率为原先的33%。',
				},
			],
			negative: [
				{
					name: '晦朔「天地未形」',
					description:
						'丰姬从当地出没的稀有顾客以及当晚邀请的稀有顾客中随机选择三个还未出现的顾客，使她们“神隐”，今晚无法前来夜雀食堂。',
				},
			],
		},
		positiveTagMapping: {
			素: '吃草助消化',
			和风: '喜欢上和歌了',
			凉爽: '好热',
			文化底蕴: '料理里的故事',
		},
	},
	{
		id: 5002,
		name: '绵月依姬',
		description: [
			'绵月家的妹妹。个性认真严谨，担负着兔子们的战斗、学习、礼法的训练——几乎包揽了月之使者首领该做的所有活儿。虽然实际上几乎没有战斗，但对待训练却很严格，兔子们要是偷懒就会被严厉惩罚。',
			'因为性格太过于一板一眼，对待训练又十分严厉，兔子们都不太亲近她。和清闲自在的姐姐相反，依姬小姐似乎一直处于无法放松的状态，可能聪明人总是容易想太多。',
			'依姬小姐继承了师傅的意志，想要为月之都做出贡献，所以她才时刻保持着危机感。严格操练士兵，也是不希望她们在战争中死去。将所有一切背负下来的依姬小姐，真是坚强又温柔啊。',
		],
		dlc: 5,
		places: ['月之都'],
		price: '1000-1200',
		positiveTags: ['高级', '传说', '清淡', '中华', '灼热', '力量涌现', '文化底蕴', '小巧'],
		negativeTags: ['山珍', '菌类'],
		beverageTags: ['可加热', '烧酒', '直饮', '辛', '提神'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '神诏「众神谕使」',
					description:
						'依姬召唤神灵，附加一层“神耀桂冠”，如果本次提供的料理带有“传说”标签，则额外附加一层。当稀有顾客产生不为完美的评价时，消耗一层“神耀桂冠”引发神迹，将评价提升至完美。',
				},
			],
			negative: [
				{
					name: '诫罚「诸神圣裁」',
					description: '带有“传说”标签的料理或使用带有“传说”标签的食材制作的料理无法被制作，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			高级: '月之民不食糟糠',
			传说: '令后人传诵的功绩',
			灼热: '不要让血冷下来',
			小巧: '锻炼不宜多吃',
		},
	},
	{
		id: 5003,
		name: '爱莲',
		description: [
			'勤劳、善良热情的小女孩，开着一家“蓬松松爱莲”魔法店，还养了一只叫做苏格拉底的、个性有点儿酷的猫。',
			'只要遇到需要帮助的人，爱莲小姐就会尽十二分努力去帮助，是个非常友好的魔法使！爱莲小姐对工作也一直保持着相当的热忱，每次和她对话感觉自己也变得活力满满了。',
			'明明外表和个性看起来都很年幼，却是个已经活了几千年的大魔法使，真是完全看不出来！活得久的妖怪我也见了不少，但活了那么久还能保持这份纯真、浪漫和善良的，爱莲小姐真是独一人！',
		],
		dlc: 5,
		places: ['魔界'],
		price: '300-500',
		positiveTags: ['家常', '饱腹', '西式', '甜', '凉爽', '梦幻', TAG_POPULAR_POSITIVE],
		negativeTags: ['水产', '重油', '生'],
		beverageTags: ['低酒精', '可加热', '啤酒', '甘', '古典'],
		collection: true,
		spellCards: {
			positive: [
				{
					name: '「恋爱的糖果屋」',
					description:
						'当完成场上顾客的订单且至少获得普通评价后，在座位附近掉落一枚“蓬松松糖果”以供拾取，持续30秒。',
				},
			],
			negative: [
				{
					name: '「呜撒的猫咪」',
					description: '伙伴移动速度下降30%，工作速度下降50%，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			凉爽: '毕竟是猫舌头',
		},
	},
	{
		id: 5004,
		name: '魅魔',
		description: [
			'独自在魔界进行着（危险？）研究的…学者？自称是神灵，但被大家视为恶灵或邪灵。不管怎么样，能感受到她扎扎实实的强大和自信，她到底是怎样的存在呢？',
			'魅魔小姐竟然诞生源自那个雾雨家的魔法实验，真是太让人惊讶了！不过，就算有着这样的渊源，信念坚定的魅魔小姐也绝不会受任何人所有或支配。追求和探索真理是魅魔小姐一生的目标，就算因此和雾雨家决裂、打了上百年的仗也不曾改变过本心。',
			'原来魅魔小姐就是魔理沙小姐的师傅！我早就应该想到的，她们俩真的有很多共同点！无论是追求知识的执著和专注这点，还是道德感方面…以及，从来不会展现自己软弱和脆弱的一面…表面看起来完全不同的，这两个孤独又坚定的人，过去会是什么样子的呢？',
		],
		dlc: 5,
		places: ['魔界'],
		price: '2000-3000',
		positiveTags: ['水产', '山珍', '鲜', '生', '力量涌现', '猎奇', '菌类'],
		negativeTags: ['高级', '清淡'],
		beverageTags: ['高酒精', '可加冰', '烧酒', '西洋酒', '辛'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '「幽冥的轮回」',
					description:
						'如果场上不存在“幽玄封魔阵”则生成法阵，如果存在则为法阵填充2点能量。“幽玄封魔阵”：除魅魔以外的稀有顾客释放任意符卡时填充1点能量。能量达到7点时，消耗全部能量引发“梦符「时空一粟」”。“梦符「时空一粟」”：场上所有就座的顾客的剩余预算回复到上限，制作料理不消耗食材且瞬间完成，顾客必定给出最高评价，持续20秒。',
				},
			],
			negative: [
				{
					name: '「渎神的代价」',
					description: '受到“恶灵缠怨”：无法获得夜雀之歌类Buff，且无法触发特殊厨具效果，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			鲜: '陈腐东西不能入口',
			生: '最原始的味道',
			力量涌现: '激活身体和思维',
		},
	},
	{
		id: 5005,
		name: '露易兹',
		description: [
			'经常偷偷溜出魔界甚至去外界旅行（工作）的魔界人，几乎随身带着一个可以自动行走的行李箱。工作内容是在一个叫做“博客”的地方分享自己的旅行过程，据说很受外面世界的人类欢迎。真奇怪，人类这么喜欢看别人旅行吗？',
			'原来露易兹小姐不仅仅分享旅行过程，也经常分享自己的创意设计。她不仅见多识广，有非常多有趣的想法和创意，还很了解时尚，很会夸人，很会做甜品…真希望自己也能成为像露易兹小姐这样优秀的人呀。',
			'就算像露易兹小姐这样满心满意地为了人类而行动的人，也一样无法得到所有人的认同。想要互相理解真不是一件容易的事啊。但就算这样，露易兹小姐也没有打算放弃热爱的工作。希望她的未来能够一直“不负热爱”。',
		],
		dlc: 5,
		places: [
			'魔界',
			'妖怪兽道',
			'人间之里',
			'博丽神社',
			'红魔馆',
			'迷途竹林',
			'魔法森林',
			'妖怪之山',
			'旧地狱',
			'地灵殿',
			'命莲寺',
			'神灵庙',
			'太阳花田',
			'辉针城',
		],
		price: '800-1000',
		positiveTags: ['水产', '西式', '甜', '适合拍照', '小巧', '特产', TAG_POPULAR_POSITIVE],
		negativeTags: ['重油', '饱腹'],
		beverageTags: ['中酒精', '可加冰', '鸡尾酒', '啤酒', '现代'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '「传奇的格列佛」',
					description:
						'露易兹召唤一架魔法相机停留在店内，如果稀有顾客本尊离开时未吃饱且预算未耗尽，则相机拍下该稀有顾客并转换为一份“旅者博客”。当日结束后“旅者博客”解放（如果拍摄时当日已结束，则立即解放），投影出其拍摄的顾客形象再次光临食堂，以此方式形成的稀有顾客的影像可以使用符卡，喜好和原先无异，但预算为其离开时的预算，续单上限为其离开时剩余的可点单数。',
				},
			],
			negative: [
				{
					name: '「遗落的水晶鞋」',
					description: '当晚营业结束后，再经过60秒，将会强制驱逐店铺内的顾客并关店。',
				},
			],
		},
		positiveTagMapping: {
			适合拍照: '适合发博客',
			小巧: '晚上不宜太饱',
			特产: '旅行的乐趣',
		},
	},
	{
		id: 6,
		name: '森近霖之助',
		description: [
			'自诩为普通的商人，买卖全凭兴趣，十分乱来。作为经营者前辈来说，应该是一个很好的反面教材吧？不过，偶尔也能淘到一些有用东西就是了。',
			null,
			null,
		],
		dlc: 0,
		places: ['人间之里', '魔法森林', '太阳花田'],
		price: '250-400',
		positiveTags: ['家常', '饱腹', '鲜', TAG_POPULAR_POSITIVE],
		negativeTags: ['重油', '下酒', '猎奇', TAG_POPULAR_NEGATIVE],
		beverageTags: ['烧酒', '啤酒'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '「香霖堂购物节」',
					description: '获得一张香霖堂购物七折的打折卡，仅限次日使用，过期作废。',
				},
			],
			negative: [
				{
					name: '「虚构的情报」',
					description: '随机隐藏已经解锁的稀有顾客的喜好信息。',
				},
			],
		},
		positiveTagMapping: {
			鲜: '嘴很刁',
		},
	},
	{
		id: 4008,
		name: '蕾米莉亚',
		description: [
			'红魔馆的主人。远远看去还以为是个幼童，走近却被她的气势压得不敢说话，不愧是响彻一方的吸血鬼领主！但任性起来真的和小孩子很像…虽然她还不太成熟，但她背负着许多人的命运。明明是那么小小的肩膀，却把一大家子全都庇护在自己的羽翼下，还真有点儿一家之主的感觉。蕾米小姐，也不完全像大家认为的那样以自我为中心呢。',
			null,
			null,
		],
		dlc: 4,
		places: ['博丽神社', '红魔馆'],
		price: '4950-5000',
		positiveTags: ['高级', '传说', '西式', '甜', '生', TAG_POPULAR_POSITIVE],
		negativeTags: ['咸', '辣', '酸', TAG_ECONOMICAL],
		beverageTags: ['高酒精', '西洋酒', '水果', '甘', '古典'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '红符「红色不夜城」',
					description:
						'本日结束时使食堂进入“红色不夜城”状态（如果当日已结束，则立即触发），持续至营业结束。“红色不夜城”：普通顾客的预算不会低于500；伙伴的工作速度提高100%，如果是咲夜则将工作速度提高至极限；顾客的续单率提高100%；发动时如果蕾米莉亚本人此时依然在场，则接下来60秒内不会闭店，并以300%的速率继续刷新普通顾客。否则在场上的最后一位稀有顾客离开时，依照当晚触发的奖励符卡数量召唤对应数量的妖精女仆前来。',
				},
			],
			negative: [
				{
					name: '夜符「红雾异变再临」',
					description: '释放血雾覆盖左下角的订单区域，持续60秒。',
				},
			],
		},
		positiveTagMapping: {
			西式: '异国风味',
		},
	},
	{
		id: 11,
		name: '魂魄妖梦',
		description: [
			'莫名其妙的家伙…大概是心里压着什么事吧，总是沉着一张脸的样子。偶尔来店里就餐，评价也很严格。如果我努力得到她的认可，不知道能不能看到她的笑容呢？',
			null,
			null,
		],
		dlc: 0,
		places: ['妖怪兽道', '人间之里', '博丽神社', '迷途竹林'],
		price: '300-400',
		positiveTags: ['家常', '清淡', '鲜', '力量涌现'],
		negativeTags: ['重油', '咸', '猎奇'],
		beverageTags: ['无酒精', '可加热', '水果'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '狱界剑「二百由旬之一闪」',
					description: '制作料理台的料理时能瞬间完成，持续60秒。',
				},
			],
			negative: [
				{
					name: '天上剑「天人之五衰」',
					description: '顾客耐心衰减速度翻倍，且每2秒减少1点气氛，持续60秒。',
				},
			],
		},
		positiveTagMapping: {},
	},
	{
		id: 23,
		name: '西行寺幽幽子',
		description: [
			'差点儿吞噬了幻想乡的可怕的家伙。原以为恢复神志后就会世界和平，结果一见面就想吃了我？！现在偶尔也会到食堂用餐，有时候会看着我咽口水…我这辈子都不想再见到这个亡灵。',
			null,
			null,
		],
		dlc: 0,
		places: ['博丽神社', '红魔馆', '迷途竹林', '神灵庙'],
		price: '1500-2000',
		positiveTags: ['肉', '水产', '高级', '传说', '饱腹', '和风', '中华', TAG_LARGE_PARTITION],
		negativeTags: ['素', '清淡', '小巧'],
		beverageTags: ['高酒精', '可加冰', '鸡尾酒'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '「食物瞬间消失术」',
					description:
						'接下来直到营业结束为止，顾客会瞬间吃下所有料理。再次触发时此符卡转化为“「墨染浮櫻化醉蝶」”。“「墨染浮櫻化醉蝶」”：幽幽子释放1/3/5/8（随使用次数提升）只蝴蝶飞向保温箱，每只蝴蝶吞噬保温箱中存储的一个料理，转化为等同于四倍料理价格的金钱（享受小费倍率加成）。',
				},
			],
			negative: [
				{
					name: '「加料加量不加价」',
					description: '接下来直到营业结束为止，料理不加满五个档位的料，都会收到差评。',
				},
			],
		},
		positiveTagMapping: {},
	},
	{
		id: 36,
		name: '冴月麟',
		description: [
			'在村子里的医馆担任护士的人类，性情直率纯粹，在医护的方面非常细心，对入院治愈后仍不爱惜自己身体的病人恨铁不成钢。面对这种病人，她会偷偷在下针的时候加大力度。',
			null,
			null,
		],
		dlc: 0,
		places: ['妖怪兽道', '人间之里', '博丽神社', '红魔馆', '迷途竹林'],
		price: '400-600',
		positiveTags: ['水产', '家常', '中华', '辣', TAG_POPULAR_POSITIVE],
		negativeTags: ['重油', '下酒', '生', TAG_POPULAR_NEGATIVE],
		beverageTags: ['无酒精', '甘', '气泡'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '「扶我起来，我还能吃」',
					description:
						'包括排队顾客在内的所有顾客，有30%的概率增加一次额外续单，每位顾客的概率独立计算。通过此种方式增加的额外续单将无视预算上限。',
				},
			],
			negative: [
				{
					name: '「饭要一口一口吃才健康」',
					description: '包括排队顾客在内的所有顾客，用餐时间增加一倍，但此技能效果优先级低于立刻完食类Buff。',
				},
			],
		},
		positiveTagMapping: {},
	},
	{
		id: 37,
		name: '立空汐',
		description: [
			'来自八寒地狱的鬼卒，据说鬼卒的工作就是凌辱堕入地狱的罪人，好可怕！无论穿着打扮还是性格都是喧哗派，时常操着不像这个时代的混混的口头禅，好斗又好强，不是在打架，就是在找架打的路上。真怕她哪天会憋不住把我的店拆了。',
			null,
			null,
		],
		dlc: 0,
		places: ['妖怪兽道', '博丽神社', '红魔馆', '迷途竹林', '妖怪之山'],
		price: '500-800',
		positiveTags: ['肉', '下酒', '山珍', '和风', '力量涌现', TAG_EXPENSIVE, TAG_POPULAR_NEGATIVE],
		negativeTags: ['素', '清淡', TAG_POPULAR_POSITIVE],
		beverageTags: ['高酒精', '可加冰', '可加热'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '「不玩尽兴还想走?!」',
					description:
						'使用空间能力将在场顾客封闭起来，只要顾客还吃得下并且有能消费得起的料理，就必须消费，直到花费额度至少到达预算的70%才会解除。在解除前，顾客无法离开桌子，只能继续点单。持续60秒。',
				},
			],
			negative: [
				{
					name: '拷问「頞部陀」',
					description: `制作含有“清淡”或“素”标签的料理，最终只能做出${DARK_MATTER_NAME}，持续120秒。`,
				},
			],
		},
		positiveTagMapping: {},
	},
	{
		id: 38,
		name: '时焉侑',
		description: [
			'新地狱的行政高官，八寒地狱鬼神长，似乎也是新地狱行政和司法方面的高级顾问。这样的大人物为什么会到我的店里来呢…难道我的店在地狱也有很名吗？',
			null,
			null,
		],
		dlc: 0,
		places: ['人间之里', '博丽神社'],
		price: '1300-1800',
		positiveTags: ['传说', '下酒', '西式', '中华', '文化底蕴', '特产'],
		negativeTags: ['水产', '重油', '饱腹'],
		beverageTags: ['中酒精', '可加冰', '鸡尾酒', '西洋酒'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '因果「推理与判断之眼」',
					description: '辨识顾客的剩余预算和点单次数，持续120秒。',
				},
			],
			negative: [
				{
					name: '律符「颠倒错乱」',
					description: '无论上的料理和酒水如何合衬顾客的心意，得到的评价都是随机的一种，持续60秒。',
				},
			],
		},
		positiveTagMapping: {},
	},
	{
		id: 1003,
		name: '饕餮尤魔',
		description: [
			'畜生界什么同盟的盟主，传说中的饕餮的动物灵，是个什么都能吸收的不得了的大胃王！性格会受吞下的事物的影响，如今似乎有了对美食的追求，偶尔会到店里来做客…体型和模样都像个小孩子，希望不会被哪个不怕死的妖怪给小瞧了吧。',
			null,
			null,
		],
		dlc: 1,
		places: [
			'妖怪之山',
			'妖怪兽道',
			'博丽神社',
			'红魔馆',
			'魔法森林',
			'迷途竹林',
			'旧地狱',
			'地灵殿',
			'命莲寺',
			'神灵庙',
			'太阳花田',
			'辉针城',
		],
		price: '9999-9999',
		positiveTags: ['肉', '高级', '传说', '饱腹', '鲜', '生', '力量涌现', '不可思议', TAG_LARGE_PARTITION],
		negativeTags: [],
		beverageTags: ['高酒精', '烧酒', '直饮', '辛'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '「饕餮的饕餮之宴」',
					description: '除尤魔以外的顾客都只会点最贵的食物和酒水，且这些订单不消耗预算，持续30秒。',
				},
			],
			negative: [
				{
					name: '「刚欲兽神饕餮的晚餐」',
					description:
						'暴走的尤魔将会随机吞噬掉3-5个食材和1-3个酒水，并吞噬1个厨具，使该厨具当晚无法使用。在血池地狱挑战中，会额外恢复5%的HP。',
				},
			],
		},
		positiveTagMapping: {
			饱腹: '无限胃袋',
			鲜: '不要馊掉了',
			生: '血淋淋',
			[TAG_LARGE_PARTITION]: '指缝都塞不满',
		},
	},
	{
		id: 2006,
		name: '古明地恋',
		description: [
			'地灵殿之主的妹妹，封闭了第三只眼的觉！由于封闭了内心所以存在感也变得很低，神秘的身影让她在地底收获了许多追崇者。总是挂着灿烂的笑容，但谁也无法知道她真正的内心是怎么想的。就连她自己也不知道。',
			null,
			null,
		],
		dlc: 2,
		places: [
			'地灵殿',
			'妖怪兽道',
			'人间之里',
			'博丽神社',
			'红魔馆',
			'迷途竹林',
			'魔法森林',
			'妖怪之山',
			'旧地狱',
			'命莲寺',
			'神灵庙',
			'太阳花田',
			'辉针城',
		],
		price: '800-1200',
		positiveTags: ['咸', '甜', '生', '猎奇', '不可思议', '梦幻'],
		negativeTags: [],
		beverageTags: ['高酒精', '烧酒', '苦', '气泡'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '「自在极意无意识」',
					description:
						'顾客点单、吃饭和店员操作等所有需要冷却时间的动作，全部无冷却、无意识发动，达到理论速度的极限，持续60秒。',
				},
			],
			negative: [
				{
					name: '「自我极意无意识」',
					description: '普通顾客点单全部变成被恋恋遮住的盲单，需要通过查询图鉴喜好来完成，持续60秒。',
				},
			],
		},
		positiveTagMapping: {
			不可思议: '永远猜不到我想要什么',
		},
	},
	{
		id: 3009,
		name: '二岩猯藏',
		description: [
			'妖怪狸的首领，有着相应的威严和领导风范，擅长变幻术。不过再如何擅长变幻的妖兽，想要完全藏起尾巴和耳朵都是不可能的。另外尾巴的大小其实是妖力的计量表，或许她从最初开始就没有藏起自己尾巴的打算。',
			null,
			null,
		],
		dlc: 3,
		places: ['妖怪兽道', '人间之里', '博丽神社', '命莲寺', '神灵庙'],
		price: '1000-1200',
		positiveTags: ['肉', '水产', '家常', '传说', '下酒', '和风', '果味', TAG_POPULAR_POSITIVE],
		negativeTags: ['灼热', '辣'],
		beverageTags: ['高酒精', '可加热', '烧酒', '古典'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '「魔卡小狸十股变化」',
					description:
						'召唤若干狸猫，变化成就座顾客的样子（不包括揣藏本人），并重新加入到排队队列中。狸猫变化的顾客，喜好和预算与变化对象无异，但所有狸猫变化成的稀有顾客整晚只能释放一次变化对象的符卡。',
				},
			],
			negative: [
				{
					name: '「惩罚无良商家的最好办法」',
					description:
						'接下来的30秒内，收到的都是叶子变成的钱币，晚间结算时才会发现，这期间获得的金钱全部不会成为收入。',
				},
			],
		},
		positiveTagMapping: {
			和风: '佐渡老家',
		},
	},
	{
		id: 5012,
		name: '八云紫',
		description: [
			'创造了幻想乡的贤者之一，据说是幻想乡最古老的妖怪，虽然神出鬼没而且性格有点儿不近人情，但其实一直以来暗中维护着幻想乡的安全和稳定…虽然没有得到多数人的理解，但恐怕也没有像她一样真挚地对待幻想乡、爱着幻想乡的人了。',
			null,
			null,
		],
		dlc: 5,
		places: [
			'妖怪兽道',
			'人间之里',
			'红魔馆',
			'迷途竹林',
			'魔法森林',
			'妖怪之山',
			'旧地狱',
			'地灵殿',
			'命莲寺',
			'神灵庙',
			'太阳花田',
			'辉针城',
			'月之都',
			'魔界',
		],
		price: '4000-6000',
		positiveTags: ['家常', '高级', '传说', '适合拍照', '凉爽', '猎奇', '汤羹'],
		negativeTags: ['饱腹', '菌类'],
		beverageTags: ['中酒精', '高酒精', '烧酒', '古典'],
		collection: false,
		spellCards: {
			positive: [
				{
					name: '「人与妖的梦乡」',
					description:
						'在当日结束前触发时，冻结所有剩余时间大于44秒的Buff时间，使之不再减少，直至当日结束。再次触发或在当日结束后触发，所有剩余时间大于44秒的Buff时间增加当前剩余时长的10%（每种类型的Buff至多通过此符卡增加17秒）。',
				},
			],
			negative: [
				{
					name: '「现与隐的境界」',
					description:
						'在场上开启数个会变换位置的隙间，如果接近隙间，则会被吸入其中，然后随机传送到其他隙间处，同时托盘内的酒水会消失，持续30秒。',
				},
			],
		},
		positiveTagMapping: {
			适合拍照: '食之品相',
		},
	},
] as const satisfies ICustomerRare[];
